<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!--
Licensed to the Apache Software Foundation (ASF) under one
or more contributor license agreements.  See the NOTICE file
distributed with this work for additional information
regarding copyright ownership.  The ASF licenses this file
to you under the Apache License, Version 2.0 (the
"License"); you may not use this file except in compliance
with the License.  You may obtain a copy of the License at

  http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing,
software distributed under the License is distributed on an
"AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
KIND, either express or implied.  See the License for the
specific language governing permissions and limitations
under the License.
-->

<!-- Generated by Apache Maven Doxia Site Renderer 1.4 at 2021-02-05 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>Beigesoft - 
    Беижсофт™ ПО для быстрой разработки кросс-платформенного финансового ПО с ВЕБ-интерфейсом.</title>
    <style type="text/css" media="all">
      @import url("./css/bootstrap.min.css");
      @import url("./css/bootstrap-theme.min.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
    <meta name="Date-Revision-yyyymmdd" content="20210205" />
    <meta http-equiv="Content-Language" content="en" />
        
          <link rel="icon" href="images/favicon.png">
  </head>
  <body>
      <img class="logo-right" src="images/logo.png" alt="${project.organization.name} logo">
    <div class="page-header">
      <h1>Beigesoft™ Enterprise Information System Java code. <small>      
                    
                <div class="xleft">
        <span id="publishDate">Last Published: 2021-02-05</span>
                  &nbsp;| <span id="projectVersion">Version: 1.2-SNAPSHOT</span>
                      </div>
      </small></h1>
    </div>
    <div id="leftColumn" class="list-group">
              
                    
                                <h5>Project Documentation</h5>
                  
                                                                                                                                                                                                                                                                        <a href="project-info.html" class="list-group-item"><span class='glyphicon glyphicon-expand' aria-hidden='true'></span>  Project Information</a>
                                                                                                               <a href="project-reports.html" class="list-group-item"><span class='glyphicon glyphicon-expand' aria-hidden='true'></span>  Project Reports</a>
                   
                       <h5>Articles</h5>
                  
                                  <a href="eis-bobs-pizza.html" class="list-group-item">Beigesoft™ EIS, Bob's pizza example</a>
                                     <a href="eis-iv.html" class="list-group-item">Пример ведения коммерческого бухгалтерского учета в Беижсофт™ ИСП</a>
                                     <a href="blcexmplen.html" class="list-group-item">Beigesoft™ libraries for rapid development of cross-platform financial WEB-applications.</a>
                                     <a href="blcexmplru.html" class="list-group-item">Беижсофт™ библиотеки для быстрой разработки кроссс-платформенного финансового ПО с ВЕБ-интерфейсом</a>
                                     <a href="bslfsc.html" class="list-group-item">Beigesoft™ Linux From Source Code</a>
                                     <a href="bslfscru.html" class="list-group-item">Беижсофт™ Линукс из исходных кодов</a>
                                     <a href="bsplay.html" class="list-group-item">Beigesoft™ multimedia player</a>
                                     <a href="bs-ctsp-in-c.html" class="list-group-item">Type-safe programming complex high-level applications in C.</a>
                                     <a href="pdesign.html" class="list-group-item">Programming approaches.</a>
                                     <a href="data-protect.html" class="list-group-item">Data protection.</a>
             
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                   
                    
          </div>
    <div id="bodyColumn">
        

  

    <div class="section">
<h2>&#x411;&#x430;&#x437;&#x43e;&#x432;&#x430;&#x44f; &#x438;&#x43d;&#x444;&#x43e;&#x440;&#x43c;&#x430;&#x446;&#x438;&#x44f; &#x43e; &#x41f;&#x41e; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;.<a name="a____."></a></h2>

    
<p>* &#x41f;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43d;&#x43d;&#x430;&#x44f; &#x438;&#x43d;&#x444;&#x43e;&#x440;&#x43c;&#x430;&#x446;&#x438;&#x44f; &#x441;&#x43b;&#x43e;&#x436;&#x43d;&#x430; &#x434;&#x43b;&#x44f; &#x43d;&#x435;&#x437;&#x43d;&#x430;&#x43a;&#x43e;&#x43c;&#x44b;&#x445; &#x441; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;&#x43c;, &#x43e;&#x441;&#x43e;&#x431;&#x435;&#x43d;&#x43d;&#x43e; &#x432;&#x442;&#x43e;&#x440;&#x430;&#x44f; &#x447;&#x430;&#x441;&#x442;&#x44c;.</p>

    
<div class="section">
<div class="section">
<h4>&#x41f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x438;&#x43d;&#x444;&#x43e;&#x440;&#x43c;&#x430;&#x446;&#x438;&#x43e;&#x43d;&#x43d;&#x44b;&#x445; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x435;&#x439; &#x441;&#x43e;&#x445;&#x440;&#x430;&#x43d;&#x44f;&#x435;&#x43c;&#x44b;&#x445; &#x432; &#x431;&#x430;&#x437;&#x443; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445;.<a name="a______."></a></h4>
    
<p>
      </p>
<ul>
        
<li>&#x42d;&#x442;&#x43e; &#x442;&#x430;&#x43a;&#x438;&#x435; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x438; &#x43a;&#x430;&#x43a; &#x41d;&#x430;&#x43a;&#x43b;&#x430;&#x434;&#x43d;&#x430;&#x44f;, &#x41a;&#x43e;&#x43d;&#x442;&#x440;&#x430;&#x433;&#x435;&#x43d;&#x442;...</li>
        
<li>&#x417;&#x434;&#x435;&#x441;&#x44c; &#x434;&#x43b;&#x44f; &#x43a;&#x440;&#x430;&#x442;&#x43a;&#x43e;&#x441;&#x442;&#x438; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44f; &#x442;&#x435;&#x440;&#x43c;&#x438;&#x43d; &quot;&#x418;&#x421; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x44c;&quot;</li>
      </ul>
    
    
<p>
      &#x415;&#x441;&#x442;&#x44c; &#x434;&#x432;&#x430; &#x442;&#x438;&#x43f;&#x430; &#x418;&#x421; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x435;&#x439;: &#x43e;&#x431;&#x43c;&#x435;&#x43d;&#x438;&#x432;&#x430;&#x435;&#x43c;&#x44b;&#x435; (&#x441;&#x438;&#x43d;&#x445;&#x440;&#x43e;&#x43d;&#x438;&#x437;&#x438;&#x440;&#x443;&#x435;&#x43c;&#x44b;&#x435;) &#x43c;&#x435;&#x436;&#x434;&#x443; &#x431;&#x430;&#x437;&#x430;&#x43c;&#x438; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x438; &#x43d;&#x435;&#x442;.
    </p>
    </div>
<div class="section">
<h4>&#x41e;&#x431;&#x43c;&#x435;&#x43d;&#x438;&#x432;&#x430;&#x435;&#x43c;&#x44b;&#x435; &#x43c;&#x435;&#x436;&#x434;&#x443; &#x431;&#x430;&#x437;&#x430;&#x43c;&#x438; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x418;&#x421; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x438;<a name="a_____"></a></h4>
    
<p>&#x41e;&#x431;&#x43c;&#x435;&#x43d;&#x438;&#x432;&#x430;&#x435;&#x43c;&#x44b;&#x435; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x438; &#x43c;&#x43e;&#x433;&#x443;&#x442; &#x431;&#x44b;&#x442;&#x44c; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x44b; &#x432; &#x440;&#x430;&#x437;&#x43d;&#x44b;&#x445; &#x431;&#x430;&#x437;&#x430;&#x445; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x438; &#x437;&#x430;&#x442;&#x435;&#x43c; &#x441;&#x438;&#x43d;&#x445;&#x440;&#x43e;&#x43d;&#x438;&#x437;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x44b; &#x441; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;&#x43c; &#x438;&#x445; &#x44f;&#x432;&#x43d;&#x43e;&#x433;&#x43e; &#x438;&#x43b;&#x438; &#x43d;&#x435;&#x44f;&#x432;&#x43d;&#x43e;&#x433;&#x43e; &#x43a;&#x43e;&#x434;&#x430; (&#x438;&#x434;&#x435;&#x43d;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442;&#x43e;&#x440;&#x430;).
      &#x415;&#x441;&#x442;&#x44c; &#x434;&#x432;&#x430; &#x442;&#x438;&#x43f;&#x430; &#x43e;&#x431;&#x43c;&#x435;&#x43d;&#x438;&#x432;&#x430;&#x435;&#x43c;&#x44b;&#x445; &#x418;&#x421; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x435;&#x439;:
      </p>
<ul>
        
<li>&#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x438; &#x441; &#x433;&#x43b;&#x43e;&#x431;&#x430;&#x43b;&#x44c;&#x43d;&#x44b;&#x43c; &#x43a;&#x43e;&#x434;&#x43e;&#x43c;</li>
        
<li>&#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x438; &#x441; &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438; &#x433;&#x435;&#x43d;&#x435;&#x440;&#x438;&#x440;&#x443;&#x435;&#x43c;&#x44b;&#x43c; &#x43a;&#x43e;&#x434;&#x43e;&#x43c; &#x438; &#x43d;&#x435;&#x44f;&#x432;&#x43d;&#x44b;&#x439; &#x43a;&#x43e;&#x434;&#x43e;&#x43c; &#x440;&#x43e;&#x436;&#x434;&#x435;&#x43d;&#x438;&#x44f;, &#x442;&#x43e; &#x435;&#x441;&#x442;&#x44c; &#x43e;&#x43d;&#x438; &#x438;&#x43c;&#x435;&#x44e;&#x442; &#x438;&#x434;&#x435;&#x43d;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442;&#x43e;&#x440; &#x441;&#x43e;&#x441;&#x442;&#x43e;&#x44f;&#x449;&#x438;&#x439; &#x438;&#x437; &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x433;&#x43e; &#x43a;&#x43e;&#x434;&#x430; &#x432; &#x442;&#x435;&#x43a;&#x443;&#x449;&#x435;&#x439; &#x431;&#x430;&#x437;&#x435;, &#x43a;&#x43e;&#x434; &#x431;&#x430;&#x437;&#x44b; &#x440;&#x43e;&#x436;&#x434;&#x435;&#x43d;&#x438;&#x44f; &#x438; &#x43a;&#x43e;&#x434; &#x432; &#x431;&#x430;&#x437;&#x435; &#x440;&#x43e;&#x436;&#x434;&#x435;&#x43d;&#x438;&#x44f; &#x434;&#x43b;&#x44f; &#x438;&#x43c;&#x43f;&#x43e;&#x440;&#x442;&#x43d;&#x43e;&#x439; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x438;, &#x44d;&#x442;&#x43e; &#x431;&#x43e;&#x43b;&#x435;&#x435; &#x431;&#x44b;&#x441;&#x442;&#x440;&#x430;&#x44f; &#x438; &#x43a;&#x440;&#x43e;&#x441;&#x441;-&#x43f;&#x43b;&#x430;&#x442;&#x444;&#x43e;&#x440;&#x43c;&#x435;&#x43d;&#x43d;&#x430;&#x44f; &#x430;&#x43b;&#x44c;&#x442;&#x435;&#x440;&#x43d;&#x430;&#x442;&#x438;&#x432;&#x430; &#x448;&#x438;&#x440;&#x43e;&#x43a;&#x43e; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x43c;&#x443;&#x44e; &#x413;&#x423;&#x418;&#x414; &#x438;&#x434;&#x435;&#x43d;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442;&#x43e;&#x440;&#x443;</li>
      </ul>
      &#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x43f;&#x435;&#x440;&#x432;&#x43e;&#x433;&#x43e; &#x442;&#x438;&#x43f;&#x430; &#x44d;&#x442;&#x43e; &#x43a;&#x43e;&#x43d;&#x442;&#x440;&#x430;&#x433;&#x435;&#x43d;&#x442; &#x432; &#x43a;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x43a;&#x43e;&#x434;&#x430; &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x43e;&#x433;&#x43e; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44f; &#x418;&#x41d;&#x41d;. &#x41e;&#x434;&#x438;&#x43d;&#x430;&#x43a;&#x43e;&#x432;&#x44b;&#x435; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x438; &#x43f;&#x435;&#x440;&#x432;&#x43e;&#x433;&#x43e; &#x442;&#x438;&#x43f;&#x430; &#x43c;&#x43e;&#x433;&#x443;&#x442; &#x431;&#x44b;&#x442;&#x44c; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x44b; &#x438; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x44b; &#x432; &#x440;&#x430;&#x437;&#x43d;&#x44b;&#x445; &#x431;&#x430;&#x437;&#x430;&#x445; &#x432; &#x43e;&#x434;&#x43d;&#x43e; &#x432;&#x440;&#x435;&#x43c;&#x44f;, &#x43d;&#x435; &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x436;&#x434;&#x430;&#x442;&#x44c; &#x43e;&#x431;&#x43c;&#x435;&#x43d;&#x430; &#x441; &#x433;&#x43b;&#x430;&#x432;&#x43d;&#x43e;&#x439; &#x431;&#x430;&#x437;&#x44b; &#x447;&#x442;&#x43e;&#x431;&#x44b; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x442;&#x44c;.
      &#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x435;&#x439; &#x432;&#x442;&#x43e;&#x440;&#x43e;&#x433;&#x43e; &#x442;&#x438;&#x43f;&#x430; - &#x41d;&#x430;&#x43a;&#x43b;&#x430;&#x434;&#x43d;&#x430;&#x44f; &#x438;&#x43b;&#x438; &#x435;&#x435; &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x430;. &#x420;&#x430;&#x437;&#x43d;&#x44b;&#x435; &#x43d;&#x430;&#x43a;&#x43b;&#x430;&#x434;&#x43d;&#x44b;&#x435; &#x43c;&#x43e;&#x433;&#x443;&#x442; &#x431;&#x44b;&#x442;&#x44c; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x44b; &#x432; &#x440;&#x430;&#x437;&#x43d;&#x44b;&#x445; &#x43f;&#x435;&#x440;&#x438;&#x444;&#x435;&#x440;&#x438;&#x439;&#x43d;&#x44b;&#x445; &#x431;&#x430;&#x437;&#x430;&#x445;, &#x437;&#x430;&#x442;&#x435;&#x43c; &#x438;&#x43c;&#x43f;&#x43e;&#x440;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x44b; &#x432; &#x446;&#x435;&#x43d;&#x442;&#x440;&#x430;&#x43b;&#x44c;&#x43d;&#x443;&#x44e; &#x431;&#x435;&#x437; &#x43a;&#x43e;&#x43b;&#x43b;&#x438;&#x437;&#x438;&#x439;.
    
    
<p>
      &#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x435;&#x439; &#x43f;&#x435;&#x440;&#x432;&#x43e;&#x433;&#x43e; &#x442;&#x438;&#x43f;&#x430; &#x438;&#x437; &#x431;&#x430;&#x437;&#x43e;&#x432;&#x43e;&#x439; &#x431;&#x438;&#x431;&#x43b;&#x438;&#x43e;&#x442;&#x435;&#x43a;&#x438; <b>beige-blc.jar</b>:
      </p>
<ul>
        
<li>org.beigesoft.mdlp.Lng - &#x42f;&#x437;&#x44b;&#x43a;&#x438;, &#x432; &#x43a;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x43a;&#x43e;&#x434;&#x430; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44f; &#x433;&#x43b;&#x43e;&#x431;&#x430;&#x43b;&#x44c;&#x43d;&#x44b;&#x439; &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x43e;&#x432;&#x44b;&#x439; &#x43a;&#x43e;&#x434;, &#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &quot;en&quot; or &quot;ru&quot;</li>
        
<li>org.beigesoft.mdlp.CsvMth - CSV &#x43c;&#x435;&#x442;&#x43e;&#x434;, &#x41a;&#x43e;&#x434; &#x434;&#x43b;&#x438;&#x43d;&#x43d;&#x43e;&#x435; &#x446;&#x435;&#x43b;&#x43e;&#x435;</li>
        
<li>org.beigesoft.mdlp.CsvCl - &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x430; CSV &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x430;, &#x41a;&#x43e;&#x434; &#x434;&#x43b;&#x438;&#x43d;&#x43d;&#x43e;&#x435; &#x446;&#x435;&#x43b;&#x43e;&#x435;</li>
      </ul>
      &#x41b;&#x44e;&#x431;&#x43e;&#x439; &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442; &#x438; &#x43d;&#x43e;&#x43c;&#x435;&#x43d;&#x43a;&#x43b;&#x430;&#x442;&#x443;&#x440;&#x430; &#x432; <b>beige-acc.jar</b> &#x44d;&#x442;&#x43e; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x438; &#x432;&#x442;&#x43e;&#x440;&#x43e;&#x433;&#x43e; &#x442;&#x438;&#x43f;&#x430;.
      &#x415;&#x441;&#x43b;&#x438; &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x438;&#x43c;&#x435;&#x442;&#x44c; &#x43e;&#x434;&#x438;&#x43d;&#x430;&#x43a;&#x43e;&#x432;&#x443;&#x44e; &#x43d;&#x43e;&#x43c;&#x435;&#x43d;&#x43a;&#x43b;&#x430;&#x442;&#x443;&#x440;&#x443; &#x432; &#x440;&#x430;&#x437;&#x43d;&#x44b;&#x445; &#x431;&#x430;&#x437;&#x430;&#x445;, &#x442;&#x43e; &#x43d;&#x435;&#x43e;&#x431;&#x445;&#x43e;&#x434;&#x438;&#x43c;&#x43e; &#x436;&#x434;&#x430;&#x442;&#x44c; &#x438;&#x43c;&#x43f;&#x43e;&#x440;&#x442;&#x430; &#x438;&#x437; &#x433;&#x43b;&#x430;&#x432;&#x43d;&#x43e;&#x439; &quot;&#x440;&#x43e;&#x434;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x441;&#x43a;&#x43e;&#x439;&quot; &#x431;&#x430;&#x437;&#x44b;.
    
    </div>
<div class="section">
<h4>&#x41d;&#x435;&#x43e;&#x431;&#x43c;&#x435;&#x43d;&#x438;&#x432;&#x430;&#x435;&#x43c;&#x44b;&#x435; &#x43c;&#x435;&#x436;&#x434;&#x443; &#x431;&#x430;&#x437;&#x430;&#x43c;&#x438; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x418;&#x421; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x438;.<a name="a_____."></a></h4>
    
<p>
      &#x422;&#x430;&#x43a;&#x438;&#x435; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x438; &#x43d;&#x435; &#x43d;&#x443;&#x436;&#x434;&#x430;&#x44e;&#x442;&#x441;&#x44f; &#x432; &#x438;&#x43c;&#x43f;&#x43e;&#x440;&#x442;&#x435;. &#x412; &#x43b;&#x44e;&#x431;&#x43e;&#x43c; &#x441;&#x43b;&#x443;&#x447;&#x430;&#x435; &#x43e;&#x43d;&#x438; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x44e;&#x442;&#x441;&#x44f; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x432; &#x43e;&#x434;&#x43d;&#x43e;&#x439; &#x431;&#x430;&#x437;&#x435; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445;.
      &#x414;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x438; &#x438;&#x43c;&#x435;&#x44e;&#x442; &#x43f;&#x440;&#x43e;&#x441;&#x442;&#x43e;&#x439; &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438; &#x433;&#x435;&#x43d;&#x435;&#x440;&#x438;&#x440;&#x443;&#x435;&#x43c;&#x44b;&#x439; &#x43a;&#x43e;&#x434;. &#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x442;&#x430;&#x43a;&#x438;&#x445; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x435;&#x439; - &#x43a;&#x43e;&#x440;&#x437;&#x438;&#x43d;&#x430; &#x438; &#x435;&#x435; &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x438; &#x432; &#x431;&#x430;&#x437;&#x435; &#x412;&#x415;&#x411;-&#x43c;&#x430;&#x433;&#x430;&#x437;&#x438;&#x43d;&#x430;.
    </p>

    </div>
<div class="section">
<h4>&#x411;&#x430;&#x437;&#x43e;&#x432;&#x44b;&#x435; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442; &#x41e;&#x420;&#x41c; &#x418;&#x421; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x438;.<a name="a____."></a></h4>
    
<p>&#x41b;&#x44e;&#x431;&#x430;&#x44f; &#x418;&#x421; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x44c; &#x434;&#x43e;&#x43b;&#x436;&#x43d;&#x430; &#x438;&#x43c;&#x435;&#x442;&#x44c; &#x438;&#x434;&#x435;&#x43d;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442;&#x43e;&#x440; (&#x43a;&#x43e;&#x434;/primary key), &#x432;&#x435;&#x440;&#x441;&#x438;&#x44e; &#x434;&#x43b;&#x44f; &#x44d;&#x43a;&#x441;&#x43f;&#x43e;&#x440;&#x442;&#x430;, &#x438;&#x43c;&#x43f;&#x43e;&#x440;&#x442;&#x430; &#x438; &#x431;&#x43b;&#x43e;&#x43a;&#x438;&#x440;&#x43e;&#x432;&#x43a;&#x438; &#x43f;&#x440;&#x438; &#x440;&#x435;&#x434;&#x430;&#x43a;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x438;. &#x422;&#x430;&#x43a;&#x436;&#x435; &#x438;&#x43c;&#x435;&#x44e;&#x442; &#x43f;&#x43e;&#x43b;&#x435; &quot;isNew&quot; - &quot;&#x43d;&#x43e;&#x432;&#x430;&#x44f;&quot; &#x434;&#x43b;&#x44f; &#x43f;&#x440;&#x438;&#x43d;&#x44f;&#x442;&#x438;&#x44f; &#x440;&#x435;&#x448;&#x435;&#x43d;&#x438;&#x44f; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44c; &#x432; &#x431;&#x430;&#x437;&#x435; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x43d;&#x43e;&#x432;&#x443;&#x44e; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x44c; &#x438;&#x43b;&#x438; &#x438;&#x437;&#x43c;&#x435;&#x43d;&#x438;&#x442;&#x44c; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x44e;&#x449;&#x443;&#x44e;.
      &#x411;&#x430;&#x437;&#x43e;&#x432;&#x44b;&#x435; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x438; &#x438;&#x43c;&#x435;&#x44e;&#x442; &#x432;&#x441;&#x435; &#x44d;&#x442;&#x438; &#x441;&#x432;&#x43e;&#x439;&#x441;&#x442;&#x432;&#x430; (&#x43f;&#x43e;&#x43b;&#x44f;).</p>
    
<p>&#x427;&#x442;&#x43e;&#x431;&#x44b; &#x441;&#x434;&#x435;&#x43b;&#x430;&#x442;&#x44c; &#x432;&#x430;&#x448;&#x443; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x44c; &#x440;&#x430;&#x431;&#x43e;&#x447;&#x435;&#x439; &#x434;&#x43b;&#x44f; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442; &#x41e;&#x420;&#x41c;, &#x432;&#x44b; &#x434;&#x43e;&#x43b;&#x436;&#x43d;&#x44b; &#x441;&#x434;&#x435;&#x43b;&#x430;&#x442;&#x44c; &#x435;&#x451; &#x43f;&#x43e;&#x442;&#x43e;&#x43c;&#x43a;&#x43e;&#x43c; &#x431;&#x430;&#x437;&#x43e;&#x432;&#x43e;&#x439; &#x418;&#x421; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x438;.
      &#x412; &#x414;&#x436;&#x430;&#x432;&#x430; &#x44d;&#x442;&#x43e; &#x434;&#x435;&#x43b;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x441;&#x43b;&#x43e;&#x432;&#x430;&#x43c;&#x438; &quot;extend&quot; &#x438;&#x43b;&#x438; &quot;implement&quot;:
      </p>
<ul>
        
<li>org.beigesoft.mdl.IHasId - &#x431;&#x430;&#x437;&#x43e;&#x432;&#x44b;&#x439; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;</li>
        
<li>org.beigesoft.mdl.AIdStr - &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43a;&#x442;&#x43d;&#x430;&#x44f; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x44c; &#x441; &#x43a;&#x43e;&#x434;&#x43e;&#x43c; &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x43e;&#x432;&#x43e;&#x433;&#x43e; &#x442;&#x438;&#x43f;&#x430; String</li>
        
<li>org.beigesoft.mdl.AIdLn - &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43a;&#x442;&#x43d;&#x430;&#x44f; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x44c; &#x441; &#x43d;&#x435;&#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x43c; &#x43a;&#x43e;&#x434;&#x43e;&#x43c; &#x447;&#x438;&#x441;&#x43b;&#x43e;&#x432;&#x43e;&#x433;&#x43e; &#x442;&#x438;&#x43f;&#x430; Long</li>
        
<li>org.beigesoft.mdl.AIdLnNm - &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43a;&#x442;&#x43d;&#x430;&#x44f; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x44c; &#x441; &#x43d;&#x435;&#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x43c; &#x43a;&#x43e;&#x434;&#x43e;&#x43c; &#x447;&#x438;&#x441;&#x43b;&#x43e;&#x432;&#x43e;&#x433;&#x43e; &#x442;&#x438;&#x43f;&#x430; Long &#x438; &#x441; &#x43f;&#x43e;&#x43b;&#x435;&#x43c; Nme (&#x418;&#x43c;&#x44f;)</li>
        
<li>org.beigesoft.mdl.AOrId - &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43a;&#x442;&#x43d;&#x430;&#x44f; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x44c; &#x441; &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x43c; &#x43a;&#x43e;&#x434;&#x43e;&#x43c; &#x438; &#x43d;&#x435;&#x44f;&#x432;&#x43d;&#x44b;&#x439; &#x43a;&#x43e;&#x434;&#x43e;&#x43c; &#x440;&#x43e;&#x436;&#x434;&#x435;&#x43d;&#x438;&#x44f; (&#x43e;&#x431;&#x43c;&#x435;&#x43d;&#x438;&#x432;&#x430;&#x435;&#x43c;&#x430;&#x44f; &#x43c;&#x435;&#x436;&#x434;&#x443; &#x411;&#x414;)</li>
        
<li>org.beigesoft.mdl.AOrIdNm - &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43a;&#x442;&#x43d;&#x430;&#x44f; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x44c; &#x441; &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x43c; &#x43a;&#x43e;&#x434;&#x43e;&#x43c; &#x438; &#x43d;&#x435;&#x44f;&#x432;&#x43d;&#x44b;&#x439; &#x43a;&#x43e;&#x434;&#x43e;&#x43c; &#x440;&#x43e;&#x436;&#x434;&#x435;&#x43d;&#x438;&#x44f; (&#x43e;&#x431;&#x43c;&#x435;&#x43d;&#x438;&#x432;&#x430;&#x435;&#x43c;&#x430;&#x44f; &#x43c;&#x435;&#x436;&#x434;&#x443; &#x411;&#x414;)</li>
        
<li>org.beigesoft.mdl.AIdLna - &#x430;&#x431;&#x441;&#x442;&#x440;&#x430;&#x43a;&#x442;&#x43d;&#x430;&#x44f; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x44c; &#x441; &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x43c; &#x43a;&#x43e;&#x434;&#x43e;&#x43c; (&#x43d;&#x435;&#x43e;&#x431;&#x43c;&#x435;&#x43d;&#x438;&#x432;&#x430;&#x435;&#x43c;&#x430;&#x44f; &#x43c;&#x435;&#x436;&#x434;&#x443; &#x411;&#x414;)</li>
        
<li>...</li>
      </ul>
      &#x412;&#x43b;&#x430;&#x434;&#x435;&#x435;&#x43c;&#x44b;&#x435; &#x441;&#x43f;&#x438;&#x441;&#x43a;&#x438; (&#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x438; &#x43d;&#x430;&#x43a;&#x43b;&#x430;&#x434;&#x43d;&#x43e;&#x439;) &#x434;&#x43e;&#x43b;&#x436;&#x43d;&#x44b; &#x440;&#x435;&#x430;&#x43b;&#x438;&#x437;&#x43e;&#x432;&#x44b;&#x432;&#x430;&#x442;&#x44c;/&#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x44f;&#x442;&#x44c; (implement/extend):
      
<ul>
        
<li>org.beigesoft.mdl.IOwned - &#x431;&#x430;&#x437;&#x43e;&#x432;&#x44b;&#x439; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;</li>
        
<li>org.beigesoft.mdlp.IOwnedi - &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; &#x441; &#x43d;&#x435;&#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x43c; &#x43a;&#x43e;&#x434;&#x43e;&#x43c; &#x447;&#x438;&#x441;&#x43b;&#x43e;&#x432;&#x43e;&#x433;&#x43e; &#x442;&#x438;&#x43f;&#x430; Long</li>
        
<li>org.beigesoft.mdlp.IOwnedOr - &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; &#x441; &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x43c; &#x43a;&#x43e;&#x434;&#x43e;&#x43c; &#x438; &#x43d;&#x435;&#x44f;&#x432;&#x43d;&#x44b;&#x439; &#x43a;&#x43e;&#x434;&#x43e;&#x43c; &#x440;&#x43e;&#x436;&#x434;&#x435;&#x43d;&#x438;&#x44f; (&#x43e;&#x431;&#x43c;&#x435;&#x43d;&#x438;&#x432;&#x430;&#x435;&#x43c;&#x430;&#x44f; &#x43c;&#x435;&#x436;&#x434;&#x443; &#x411;&#x414;)</li>
        
<li>org.beigesoft.mdlp.IOwneda - &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; &#x441; &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x43c; &#x43a;&#x43e;&#x434;&#x43e;&#x43c; (&#x43d;&#x435;&#x43e;&#x431;&#x43c;&#x435;&#x43d;&#x438;&#x432;&#x430;&#x435;&#x43c;&#x430;&#x44f; &#x43c;&#x435;&#x436;&#x434;&#x443; &#x411;&#x414;)</li>
      </ul>
    
    </div>
<div class="section">
<h4>&#x41c;&#x43e;&#x434;&#x435;&#x43b;&#x438; &#x441;&#x43e; &#x441;&#x43b;&#x43e;&#x436;&#x43d;&#x44b;&#x43c; &#x438;&#x434;&#x435;&#x43d;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442;&#x43e;&#x440;&#x43e;&#x43c; (primary key).<a name="a____primary_key."></a></h4>
    
<p>&#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442; &#x41e;&#x420;&#x41c; &#x43f;&#x43e;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442; &#x438;&#x434;&#x435;&#x43d;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442;&#x43e;&#x440;&#x44b; &#x43b;&#x44e;&#x431;&#x43e;&#x439; &#x441;&#x43b;&#x43e;&#x436;&#x43d;&#x43e;&#x441;&#x442;&#x438;. &#x41d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x438; &#x438;&#x437; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442; &#x418;&#x421;&#x41f; <b>beige-acc.jar</b>:
      </p>
<ul>
        
<li>org.beigesoft.ws.mdlp.Deliv - &#x414;&#x43e;&#x441;&#x442;&#x430;&#x432;&#x43a;&#x430;, &#x43a;&#x43e;&#x434; &#x442;&#x438;&#x43f;&#x430; &#x43f;&#x435;&#x440;&#x435;&#x447;&#x438;&#x441;&#x43b;&#x435;&#x43d;&#x438;&#x435; (enumeration)</li>
        
<li>org.beigesoft.ws.mdlp.Cart - &#x41a;&#x43e;&#x440;&#x437;&#x438;&#x43d;&#x430; &#x438;&#x43c;&#x435;&#x435;&#x442; &#x438;&#x434;&#x435;&#x43d;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442;&#x43e;&#x440; &#x442;&#x438;&#x43f;&#x430; &#x41f;&#x43e;&#x43a;&#x443;&#x43f;&#x430;&#x442;&#x435;&#x43b;&#x44c; (&#x434;&#x440;&#x443;&#x433;&#x430;&#x44f; &#x418;&#x421; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x44c;) (Buyer)</li>
        
<li>org.beigesoft.acc.mdlp.WrhItm - &#x43d;&#x43e;&#x43c;&#x435;&#x43d;&#x43a;&#x43b;&#x430;&#x442;&#x443;&#x440;&#x430; &#x43d;&#x430; &#x441;&#x43a;&#x43b;&#x430;&#x434;&#x435; &#x441; &#x442;&#x440;&#x43e;&#x439;&#x43d;&#x44b;&#x43c; &#x438;&#x434;&#x435;&#x43d;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442;&#x43e;&#x440;&#x43e;&#x43c; - &#x41d;&#x43e;&#x43c;&#x435;&#x43d;&#x43a;&#x43b;&#x430;&#x442;&#x443;&#x440;&#x430; (Itm), &#x415;&#x434;&#x438;&#x43d;&#x438;&#x446;&#x430;&#x418;&#x437;&#x43c;&#x435;&#x440;&#x435;&#x43d;&#x438;&#x44f; (Uom), &#x41c;&#x435;&#x441;&#x442;&#x43e; &#x432; &#x441;&#x43a;&#x43b;&#x430;&#x434;&#x435; (WrhPl), &#x442;.&#x435;. &#x44d;&#x442;&#x43e; &#x43e;&#x434;&#x43d;&#x43e;&#x432;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x43d;&#x43e; &#x438; &#x438;&#x43d;&#x43e;&#x441;&#x442;&#x440;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x43a;&#x43b;&#x44e;&#x447;&#x438;, &#x438; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44e;&#x442;&#x441;&#x44f; &#x432; &#x441;&#x432;&#x44f;&#x437;&#x43a;&#x435; &#x43a;&#x430;&#x43a; &#x43f;&#x435;&#x440;&#x432;&#x438;&#x447;&#x43d;&#x44b;&#x439; &#x43a;&#x43b;&#x44e;&#x447;.</li>
      </ul>
      &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;-&#x412;&#x435;&#x431; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438; &#x433;&#x435;&#x43d;&#x435;&#x440;&#x438;&#x440;&#x443;&#x435;&#x442; &#x444;&#x43e;&#x440;&#x43c;&#x44b; &#x434;&#x43b;&#x44f; &#x437;&#x430;&#x43f;&#x43e;&#x43b;&#x43d;&#x435;&#x43d;&#x438;&#x44f; &#x442;&#x430;&#x43a;&#x438;&#x445; &#x441;&#x43b;&#x43e;&#x436;&#x43d;&#x44b;&#x445; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x435;&#x439;. &#x421;&#x43c;&#x43e;&#x442;&#x440;&#x438;&#x442;&#x435; &#x415;&#x418;&#x421; &#x412;&#x435;&#x431;-&#x41c;&#x430;&#x433;&#x430;&#x437;&#x438;&#x43d; &#x434;&#x43b;&#x44f; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;&#x430;: &quot;&#x426;&#x435;&#x43d;&#x430; &#x422;&#x43e;&#x432;&#x430;&#x440;&#x430;&quot;, &quot;&#x422;&#x43e;&#x432;&#x430;&#x440; &#x432; &#x41a;&#x430;&#x442;&#x430;&#x43b;&#x43e;&#x433;&#x435;&quot;...
    
    </div></div></div>

  


    </div>
    <div class="clear">
    </div>
    <hr/>
    <div class="footer">
              Copyright &#169;                   2019&#x2013;2021.
           All rights reserved.      
                    
                </div>
  </body>
</html>
