<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!--
Licensed to the Apache Software Foundation (ASF) under one
or more contributor license agreements.  See the NOTICE file
distributed with this work for additional information
regarding copyright ownership.  The ASF licenses this file
to you under the Apache License, Version 2.0 (the
"License"); you may not use this file except in compliance
with the License.  You may obtain a copy of the License at

  http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing,
software distributed under the License is distributed on an
"AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
KIND, either express or implied.  See the License for the
specific language governing permissions and limitations
under the License.
-->

<!-- Generated by Apache Maven Doxia Site Renderer 1.4 at 2021-02-15 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>Beigesoft - 
    Беижсофт™ ПО для быстрой разработки кросс-платформенного финансового ПО с ВЕБ-интерфейсом.</title>
    <style type="text/css" media="all">
      @import url("./css/bootstrap.min.css");
      @import url("./css/bootstrap-theme.min.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
    <meta name="Date-Revision-yyyymmdd" content="20210215" />
    <meta http-equiv="Content-Language" content="en" />
        
          <link rel="icon" href="images/favicon.png">
  </head>
  <body>
      <img class="logo-right" src="images/logo.png" alt="${project.organization.name} logo">
    <div class="page-header">
      <h1>Beigesoft™ Enterprise Information System Java code. <small>      
                    
                <div class="xleft">
        <span id="publishDate">Last Published: 2021-02-15</span>
                  &nbsp;| <span id="projectVersion">Version: 1.2-SNAPSHOT</span>
                      </div>
      </small></h1>
    </div>
    <div id="leftColumn" class="list-group">
              
                    
                                <h5>Project Documentation</h5>
                  
                                                                                                                                                                                                                                                                        <a href="project-info.html" class="list-group-item"><span class='glyphicon glyphicon-expand' aria-hidden='true'></span>  Project Information</a>
                                                                                                               <a href="project-reports.html" class="list-group-item"><span class='glyphicon glyphicon-expand' aria-hidden='true'></span>  Project Reports</a>
                   
                       <h5>Articles</h5>
                  
                                  <a href="eis-bobs-pizza.html" class="list-group-item">Beigesoft™ EIS, Bob's pizza example</a>
                                     <a href="eis-iv.html" class="list-group-item">Пример ведения коммерческого бухгалтерского учета в Беижсофт™ ИСП</a>
                                     <a href="blcexmplen.html" class="list-group-item">Beigesoft™ libraries for rapid development of cross-platform financial WEB-applications.</a>
                                     <a href="blcexmplru.html" class="list-group-item">Беижсофт™ библиотеки для быстрой разработки кроссс-платформенного финансового ПО с ВЕБ-интерфейсом</a>
                                     <a href="bslfsc.html" class="list-group-item">Beigesoft™ Linux From Source Code</a>
                                     <a href="bslfscru.html" class="list-group-item">Беижсофт™ Линукс из исходных кодов</a>
                                     <a href="bsplay.html" class="list-group-item">Beigesoft™ multimedia player</a>
                                     <a href="bs-ctsp-in-c.html" class="list-group-item">Type-safe programming complex high-level applications in C.</a>
                                     <a href="pdesign.html" class="list-group-item">Programming approaches.</a>
                                     <a href="data-protect.html" class="list-group-item">Data protection.</a>
             
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                   
                    
          </div>
    <div id="bodyColumn">
        

  

    <div class="section">
<div class="section">
<h4>&#x41f;&#x440;&#x435;&#x438;&#x43c;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x43e;&#x431;&#x435;&#x441;&#x43f;&#x435;&#x447;&#x435;&#x43d;&#x438;&#x44f; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;.<a name="a____."></a></h4>

    
<p>
      &#x412;&#x43e; &#x43f;&#x435;&#x440;&#x432;&#x44b;&#x445;, &#x41f;&#x41e; &#x431;&#x430;&#x437;&#x438;&#x440;&#x443;&#x44e;&#x449;&#x435;&#x435;&#x441;&#x44f; &#x43d;&#x430; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442; &#x431;&#x438;&#x431;&#x43b;&#x438;&#x43e;&#x442;&#x435;&#x43a;&#x430;&#x445; &#x431;&#x443;&#x434;&#x435;&#x442; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x442;&#x44c; &#x432;&#x435;&#x437;&#x434;&#x435;. &#x412;&#x441;&#x435; &#x447;&#x430;&#x441;&#x442;&#x438; - &#x41e;&#x420;&#x41c;, &#x433;&#x435;&#x43d;&#x435;&#x440;&#x430;&#x442;&#x43e;&#x440; &#x43e;&#x442;&#x447;&#x435;&#x442;&#x43e;&#x432; &#x432; &#x41f;&#x414;&#x424; (PDF), &#x412;&#x415;&#x411;-&#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x44e;&#x442; &#x438; &#x43d;&#x430; &#x43e;&#x431;&#x44b;&#x447;&#x43d;&#x43e;&#x439; &#x414;&#x436;&#x430;&#x432;&#x430; (&#x43d;&#x430; &#x41c;&#x421; &#x412;&#x438;&#x43d;&#x434;&#x43e;&#x443;&#x441;, &#x42e;&#x41d;&#x418;&#x41a;&#x421; &#x43f;&#x43e;&#x434;&#x43e;&#x431;&#x43d;&#x44b;&#x445; &#x41e;&#x421;), &#x438; &#x43d;&#x430; &#x410;&#x43d;&#x434;&#x440;&#x43e;&#x438;&#x434;&#x435;.
    </p>
    
<p>
      &#x412;&#x43e; &#x432;&#x442;&#x43e;&#x440;&#x44b;&#x445;, &#x44d;&#x442;&#x43e; &#x43f;&#x440;&#x43e;&#x438;&#x437;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x44c;. &#x412;&#x441;&#x435; &#x447;&#x430;&#x441;&#x442;&#x438; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x44e;&#x442; &#x431;&#x44b;&#x441;&#x442;&#x440;&#x43e; &#x434;&#x430;&#x436;&#x435; &#x43d;&#x430; &#x441;&#x43b;&#x430;&#x431;&#x44b;&#x445; &#x443;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x441;&#x442;&#x432;&#x430;&#x445;, &#x43a; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;&#x443; &#x43d;&#x430; &#x441;&#x43c;&#x430;&#x440;&#x442;&#x444;&#x43e;&#x43d;&#x435;. &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442; &#x412;&#x415;&#x411;-&#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; &#x431;&#x430;&#x437;&#x438;&#x440;&#x443;&#x435;&#x442;&#x441;&#x44f; &#x43d;&#x430; JSP. JSP &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;-&#x441;&#x430;&#x439;&#x434; &#x412;&#x415;&#x411; &#x442;&#x435;&#x445;&#x43d;&#x43e;&#x43b;&#x43e;&#x433;&#x438;&#x44f; &#x430;&#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x438;&#x447;&#x43d;&#x430; PHP, ASPX &#x438; &#x43f;&#x440;&#x43e;&#x447;&#x438;&#x43c; &#x43f;&#x43e;&#x434;&#x43e;&#x431;&#x43d;&#x44b;&#x43c;. &#x414;&#x430;&#x43d;&#x43d;&#x44b;&#x439; &#x442;&#x438;&#x43f; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;-&#x441;&#x430;&#x439;&#x434; &#x442;&#x435;&#x445;&#x43d;&#x43e;&#x43b;&#x43e;&#x433;&#x438;&#x438; &#x44f;&#x432;&#x43b;&#x44f;&#x435;&#x442;&#x441;&#x44f; &#x434;&#x43e;&#x43c;&#x438;&#x43d;&#x438;&#x440;&#x443;&#x44e;&#x449;&#x438;&#x43c;.
      JSP &#x431;&#x44b;&#x441;&#x442;&#x440;&#x435;&#x435; &#x447;&#x435;&#x43c; PHP (&#x438; &#x434;&#x440;&#x443;&#x433;&#x438;&#x445; &#x441;&#x43a;&#x440;&#x438;&#x43f;&#x442;&#x43e;&#x432;&#x44b;&#x445; &#x44f;&#x437;&#x44b;&#x43a;&#x43e;&#x432;) &#x437;&#x430; &#x441;&#x447;&#x435;&#x442; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x438; &quot;&#x43d;&#x430; &#x43b;&#x435;&#x442;&#x443;&quot; &#x43f;&#x440;&#x43e;&#x43c;&#x435;&#x436;&#x443;&#x442;&#x43e;&#x447;&#x43d;&#x43e;&#x433;&#x43e; &#x441;&#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x431;&#x430;&#x439;&#x442;-&#x43a;&#x43e;&#x434;&#x430; &#x432; &#x43f;&#x440;&#x43e;&#x446;&#x435;&#x441;&#x441;&#x43e;&#x440;&#x43d;&#x44b;&#x439; &#x43a;&#x43e;&#x434;. &#x413;&#x435;&#x43d;&#x435;&#x440;&#x430;&#x442;&#x43e;&#x440; &#x43e;&#x442;&#x447;&#x435;&#x442;&#x43e;&#x432; &#x43a;&#x44d;&#x448;&#x438;&#x440;&#x443;&#x435;&#x442; TTF &#x448;&#x440;&#x438;&#x444;&#x442;&#x44b; &#x438; &#x432;&#x43d;&#x435;&#x434;&#x440;&#x44f;&#x435;&#x442; &#x432; PDF &#x444;&#x430;&#x439;&#x43b; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x43c;&#x44b;&#x435; &#x441;&#x438;&#x43c;&#x432;&#x43e;&#x43b;&#x44b;.
      &#x421;&#x442;&#x430;&#x43d;&#x434;&#x430;&#x440;&#x442;&#x43d;&#x44b;&#x435; &#x41e;&#x420;&#x41c; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44e;&#x442; &quot;lazy initialization/&#x43b;&#x44d;&#x437;&#x438; &#x438;&#x43d;&#x438;&#x446;&#x438;&#x430;&#x43b;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44e;&quot; &#x434;&#x43b;&#x44f; &#x438;&#x437;&#x432;&#x43b;&#x435;&#x447;&#x435;&#x43d;&#x438;&#x44f; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x438; &#x438;&#x437; &#x431;&#x430;&#x437;&#x44b; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445;. &#x422;&#x43e; &#x435;&#x441;&#x442;&#x44c; &#x43e;&#x43d;&#x438; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44e;&#x442; &#x43d;&#x435;&#x441;&#x43a;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x421;&#x41a;&#x41b; &#x437;&#x430;&#x43f;&#x440;&#x43e;&#x441;&#x43e;&#x432; &#x434;&#x43b;&#x44f; &#x438;&#x437;&#x432;&#x43b;&#x435;&#x447;&#x435;&#x43d;&#x438;&#x44f; &#x432;&#x441;&#x435;&#x445; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x438;.
      &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442; &#x41e;&#x420;&#x41c; &#x43f;&#x43e;&#x437;&#x432;&#x43e;&#x43b;&#x44f;&#x435;&#x442; &#x438;&#x437;&#x432;&#x43b;&#x435;&#x43a;&#x430;&#x442;&#x44c; &#x43d;&#x435;&#x43e;&#x431;&#x445;&#x43e;&#x434;&#x438;&#x43c;&#x44b;&#x435; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x432; &#x43e;&#x434;&#x43d;&#x43e;&#x43c; &#x421;&#x41a;&#x41b; &#x437;&#x430;&#x43f;&#x440;&#x43e;&#x441;&#x435; (&#x441; &#x414;&#x416;&#x41e;&#x418;&#x41d;&#x430;&#x43c;&#x438;). &#x41e;&#x434;&#x438;&#x43d; &#x442;&#x430;&#x43a;&#x43e;&#x439; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x43e;&#x439; &#x437;&#x430;&#x43f;&#x440;&#x43e;&#x441; (&#x438;&#x43c;&#x435;&#x43d;&#x43d;&#x43e; &#x441; &#x414;&#x416;&#x41e;&#x418;&#x41d;&#x430;&#x43c;&#x438;) &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x435;&#x442; &#x431;&#x44b;&#x441;&#x442;&#x440;&#x435;&#x435; &#x447;&#x435;&#x43c; &#x43d;&#x435;&#x441;&#x43a;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x43c;&#x430;&#x43b;&#x435;&#x43d;&#x44c;&#x43a;&#x438;&#x445; &#x43f;&#x440;&#x438; &#x438;&#x437;&#x432;&#x43b;&#x435;&#x447;&#x435;&#x43d;&#x438;&#x438; &#x43e;&#x434;&#x438;&#x43d;&#x430;&#x43a;&#x43e;&#x432;&#x44b;&#x445; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x435;.
    </p>
    
<p>
      &#x412; &#x442;&#x440;&#x435;&#x442;&#x44c;&#x438;&#x445;, &#x441; &#x43f;&#x43e;&#x43c;&#x43e;&#x449;&#x44c;&#x44e; &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x41f;&#x41e; &#x432;&#x44b; &#x43c;&#x43e;&#x436;&#x435;&#x442;&#x435; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x441;&#x43b;&#x43e;&#x436;&#x43d;&#x44b;&#x435; &#x431;&#x438;&#x437;&#x43d;&#x435;&#x441; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x44f; &#x431;&#x44b;&#x441;&#x442;&#x440;&#x43e;. &#x412;&#x44b; &#x43c;&#x43e;&#x436;&#x435;&#x442;&#x435; &#x443;&#x431;&#x435;&#x434;&#x438;&#x442;&#x44c;&#x441;&#x44f; &#x432; &#x44d;&#x442;&#x43e;&#x43c; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x432; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x435; &#x43f;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43d;&#x43d;&#x43e;&#x435; &#x432; &#x441;&#x43b;&#x435;&#x434;&#x443;&#x44e;&#x449;&#x438;&#x445; &#x441;&#x442;&#x430;&#x442;&#x44c;&#x44f;&#x445;. &#x422;&#x430;&#x43a;&#x436;&#x435; &#x43f;&#x43e;&#x441;&#x43c;&#x43e;&#x442;&#x440;&#x438;&#x442;&#x435; &#x43d;&#x430; &#x43e;&#x447;&#x435;&#x43d;&#x44c; &#x441;&#x43b;&#x43e;&#x436;&#x43d;&#x43e;&#x435; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x435; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;-&#x418;&#x421;&#x41f; &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x43e;&#x435; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x43e; &#x43d;&#x430; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x431;&#x438;&#x431;&#x43b;&#x438;&#x43e;&#x442;&#x435;&#x43a;&#x430;&#x445;.
      &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442; &#x433;&#x435;&#x43d;&#x435;&#x440;&#x430;&#x442;&#x43e;&#x440; &#x43e;&#x442;&#x447;&#x435;&#x442;&#x43e;&#x432; &#x43d;&#x435; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x440;&#x438;&#x441;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x434;&#x438;&#x430;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x44b;, &#x433;&#x440;&#x430;&#x444;&#x438;&#x43a;&#x438; &#x438; &#x448;&#x442;&#x440;&#x438;&#x445;-&#x43a;&#x43e;&#x434;&#x44b;. &#x415;&#x433;&#x43e; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x437;&#x430;&#x43d;&#x44f;&#x43b;&#x43e; &#x443; &#x43c;&#x435;&#x43d;&#x44f; 3 &#x43c;&#x435;&#x441;&#x44f;&#x446;&#x430;. &#x41f;&#x414;&#x424; &#x438;&#x43c;&#x435;&#x435;&#x442; &#x432;&#x441;&#x442;&#x440;&#x43e;&#x435;&#x43d;&#x43d;&#x44b;&#x435; &#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x430; &#x434;&#x43b;&#x44f; &#x440;&#x438;&#x441;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x43b;&#x438;&#x43d;&#x438;&#x439; &#x438; &#x444;&#x438;&#x433;&#x443;&#x440;. &#x41f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x431;&#x438;&#x431;&#x43b;&#x438;&#x43e;&#x442;&#x435;&#x43a;&#x438; &#x434;&#x43b;&#x44f; &#x43e;&#x442;&#x440;&#x438;&#x441;&#x43e;&#x432;&#x43a;&#x438; &#x434;&#x438;&#x430;&#x433;&#x440;&#x430;&#x43c;&#x43c; &#x438;&#x43b;&#x438; &#x448;&#x442;&#x440;&#x438;&#x445;-&#x43a;&#x43e;&#x434;&#x43e;&#x432; &#x43d;&#x435; &#x437;&#x430;&#x439;&#x43c;&#x435;&#x442; &#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x432;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x438;. &#x42d;&#x442;&#x43e; &#x440;&#x44f;&#x434;&#x43e;&#x432;&#x430;&#x44f; &#x437;&#x430;&#x434;&#x430;&#x447;&#x430; &#x434;&#x430;&#x436;&#x435; &#x434;&#x43b;&#x44f; &#x410;&#x439;&#x422;&#x438; &#x441;&#x442;&#x443;&#x434;&#x435;&#x43d;&#x442;&#x430;.
      &#x41f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x43e;&#x442;&#x447;&#x435;&#x442;&#x43e;&#x432; &#x431;&#x435;&#x437; &#x432;&#x438;&#x437;&#x443;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x433;&#x43e; &#x440;&#x435;&#x434;&#x430;&#x43a;&#x442;&#x43e;&#x440;&#x430; &#x43f;&#x440;&#x43e;&#x438;&#x437;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x441;&#x44f; &#x43d;&#x435;&#x441;&#x43b;&#x43e;&#x436;&#x43d;&#x43e; &#x438; &#x431;&#x44b;&#x441;&#x442;&#x440;&#x43e; (&#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x439;&#x442;&#x435; &#x433;&#x43e;&#x442;&#x43e;&#x432;&#x44b;&#x435; &#x448;&#x430;&#x431;&#x43b;&#x43e;&#x43d;&#x44b;). &#x41d;&#x430; &#x43f;&#x440;&#x430;&#x43a;&#x442;&#x438;&#x43a;&#x435; &quot;&#x43c;&#x435;&#x442;&#x438;&#x442;&#x44c;&#x441;&#x44f;&quot; &#x441; &#x442;&#x43e;&#x447;&#x43d;&#x43e;&#x441;&#x442;&#x44c;&#x44e;  &#x434;&#x43e; &#x43c;&#x438;&#x43b;&#x43b;&#x438;&#x43c;&#x435;&#x442;&#x440;&#x430; &#x432; &#x432;&#x438;&#x437;&#x443;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x43c; &#x440;&#x435;&#x434;&#x430;&#x43a;&#x442;&#x43e;&#x440;&#x435; &#x442;&#x44f;&#x436;&#x435;&#x43b;&#x435;&#x435;.
    </p>
    
<p>
      &#x412; &#x447;&#x435;&#x442;&#x432;&#x435;&#x440;&#x442;&#x44b;&#x445;, &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x435; &#x41f;&#x41e; &#x438; &#x432;&#x441;&#x435; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x43c;&#x43e;&#x435; &#x41f;&#x41e; &#x441;&#x442;&#x43e;&#x440;&#x43e;&#x43d;&#x43d;&#x438;&#x445; &#x43f;&#x440;&#x43e;&#x438;&#x437;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x435;&#x43b;&#x435;&#x439; &#x438;&#x43c;&#x435;&#x44e;&#x442; &#x441;&#x432;&#x43e;&#x431;&#x43e;&#x434;&#x43d;&#x44b;&#x435; &#x43b;&#x438;&#x446;&#x435;&#x43d;&#x437;&#x438;&#x438;.
      BSD 2-Clause &#x43b;&#x438;&#x446;&#x435;&#x43d;&#x437;&#x438;&#x44f; &#x433;&#x43e;&#x432;&#x43e;&#x440;&#x438;&#x442;:
      </p>
<ul>
        
<li>&#x44d;&#x442;&#x43e; &#x41f;&#x41e; &#x441; &#x43e;&#x442;&#x43a;&#x440;&#x44b;&#x442;&#x44b;&#x43c; &#x43a;&#x43e;&#x434;&#x43e;&#x43c;, &#x442;.&#x435;. &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x438;&#x437;&#x43c;&#x435;&#x43d;&#x44f;&#x442;&#x44c;</li>
        
<li>&#x431;&#x435;&#x441;&#x43f;&#x43b;&#x430;&#x442;&#x43d;&#x43e; &#x434;&#x43b;&#x44f; &#x43b;&#x44e;&#x431;&#x44b;&#x445; &#x446;&#x435;&#x43b;&#x435;&#x439;, &#x432; &#x442;&#x43e;&#x43c; &#x447;&#x438;&#x441;&#x43b;&#x435; &#x438; &#x434;&#x43b;&#x44f; &#x43a;&#x43e;&#x43c;&#x43c;&#x435;&#x440;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x433;&#x43e; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f;</li>
        
<li>&#x43d;&#x435;&#x442; &#x433;&#x430;&#x440;&#x430;&#x43d;&#x442;&#x438;&#x438; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x43e;&#x441;&#x43f;&#x43e;&#x441;&#x43e;&#x431;&#x43d;&#x43e;&#x441;&#x442;&#x438;</li>
        
<li>&#x43d;&#x435;&#x442; &#x43e;&#x431;&#x44f;&#x437;&#x430;&#x442;&#x435;&#x43b;&#x44c;&#x441;&#x442;&#x432; &#x438; &#x43e;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43d;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x437;&#x430; &#x432;&#x43e;&#x437;&#x43c;&#x43e;&#x436;&#x43d;&#x44b;&#x435; &#x444;&#x438;&#x43d;&#x430;&#x43d;&#x441;&#x43e;&#x432;&#x44b;&#x435; &#x43f;&#x43e;&#x442;&#x435;&#x440;&#x438;</li>
        
<li>&#x432;&#x44b; &#x434;&#x43e;&#x43b;&#x436;&#x43d;&#x44b; &#x432;&#x43a;&#x43b;&#x44e;&#x447;&#x438;&#x442;&#x44c; &#x438;&#x43d;&#x444;&#x43e;&#x440;&#x43c;&#x430;&#x446;&#x438;&#x44e; &#x43e; &#x43f;&#x440;&#x430;&#x432;&#x43e;&#x43e;&#x431;&#x43b;&#x430;&#x434;&#x430;&#x442;&#x435;&#x43b;&#x435; &#x438; &#x43b;&#x438;&#x446;&#x435;&#x43d;&#x437;&#x438;&#x438; &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x41f;&#x41e; &#x432; &#x441;&#x432;&#x43e;&#x435; &#x43f;&#x440;&#x43e;&#x438;&#x437;&#x432;&#x43e;&#x434;&#x43d;&#x43e;&#x435; &#x41f;&#x41e; (&#x432; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x44b;&#x439; &#x43a;&#x43e;&#x434; &#x438; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x43d;&#x44f;&#x435;&#x43c;&#x43e;&#x435; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x435;). &#x41f;&#x440;&#x43e;&#x441;&#x442;&#x43e; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x439;&#x442;&#x435; HTML &#x444;&#x430;&#x439;&#x43b; &#x441;&#x43e; &#x441;&#x43f;&#x438;&#x441;&#x43a;&#x43e;&#x43c; &#x43b;&#x438;&#x446;&#x435;&#x43d;&#x437;&#x438;&#x439; &#x432;&#x441;&#x435;&#x445; &#x447;&#x430;&#x441;&#x442;&#x435;&#x439;.</li>
        
<li>&#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x443;&#x441;&#x43b;&#x43e;&#x432;&#x438;&#x44f; &#x434;&#x430;&#x43d;&#x44b; &#x43d;&#x430;&#x432;&#x441;&#x435;&#x433;&#x434;&#x430;</li>
      </ul>
      &#x41f;&#x440;&#x435;&#x434;&#x43f;&#x43e;&#x441;&#x43b;&#x435;&#x434;&#x43d;&#x435;&#x435; &#x443;&#x441;&#x43b;&#x43e;&#x432;&#x438;&#x435; &#x43e;&#x431;&#x437;&#x44b;&#x432;&#x430;&#x44e;&#x442; &quot;&#x441;&#x430;&#x43c;&#x43e;&#x440;&#x435;&#x43a;&#x43b;&#x430;&#x43c;&#x43e;&#x439;&quot;. &#x415;&#x441;&#x43b;&#x438; &#x43a;&#x442;&#x43e;-&#x43d;&#x438;&#x431;&#x443;&#x434;&#x44c; &#x43d;&#x430;&#x43f;&#x438;&#x448;&#x435;&#x442; &#x43a;&#x43d;&#x438;&#x433;&#x443; &#x438; &quot;&#x437;&#x430;&#x431;&#x443;&#x434;&#x435;&#x442;&quot; &#x432;&#x43a;&#x43b;&#x44e;&#x447;&#x438;&#x442;&#x44c; &#x441;&#x43f;&#x438;&#x441;&#x43e;&#x43a; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x438;&#x441;&#x442;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x43e;&#x432;, &#x442;&#x43e; &#x44d;&#x442;&#x43e; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43d;&#x435;&#x437;&#x430;&#x43a;&#x43e;&#x43d;&#x43d;&#x43e;.
      &#x42d;&#x442;&#x43e; &#x43d;&#x435; &quot;&#x441;&#x430;&#x43c;&#x43e;&#x440;&#x435;&#x43a;&#x43b;&#x430;&#x43c;&#x430;&quot;, &#x44d;&#x442;&#x43e; &#x438;&#x43d;&#x444;&#x43e;&#x440;&#x43c;&#x430;&#x446;&#x438;&#x44f; &#x43e;&#x431; &#x430;&#x432;&#x442;&#x43e;&#x440;&#x430;&#x445;, &#x443;&#x441;&#x43b;&#x43e;&#x432;&#x438;&#x44f;&#x445;, &#x43e;&#x442;&#x432;&#x435;&#x442;&#x441;&#x442;&#x432;&#x435;&#x43d;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x430;&#x432;&#x442;&#x43e;&#x440;&#x43e;&#x432;. &#x41d;&#x430; &#x430;&#x43d;&#x433;&#x43b;&#x43e;&#x44f;&#x437;&#x44b;&#x447;&#x43d;&#x43e;&#x43c; &#x440;&#x44b;&#x43d;&#x43a;&#x435; &#x43f;&#x43e;&#x43b;&#x43d;&#x43e; &#x432;&#x44b;&#x441;&#x43e;&#x43a;&#x43e;&#x440;&#x435;&#x439;&#x442;&#x435;&#x43d;&#x433;&#x43e;&#x432;&#x43e;&#x433;&#x43e; &#x431;&#x435;&#x441;&#x43f;&#x43e;&#x43b;&#x435;&#x437;&#x43d;&#x43e;&#x433;&#x43e; &#x41f;&#x41e;, &#x434;&#x443;&#x431;&#x43b;&#x438;&#x43a;&#x430;&#x442;&#x43e;&#x432;.
      &#x41f;&#x43e;&#x441;&#x43b;&#x435;&#x434;&#x43d;&#x438;&#x439; &#x440;&#x430;&#x437; &#x43a;&#x43e;&#x433;&#x434;&#x430; &#x437;&#x430;&#x43a;&#x43e;&#x43d; &#x443;&#x434;&#x430;&#x440;&#x44f;&#x43b; &#x43f;&#x43e; &#x442;&#x430;&#x43a;&#x43e;&#x433;&#x43e; &#x440;&#x43e;&#x434;&#x430; &#x43f;&#x43b;&#x43e;&#x445;&#x438;&#x43c; &#x432;&#x435;&#x449;&#x430;&#x43c; &#x432; &#x410;&#x439;&#x422;&#x438; &#x441;&#x444;&#x435;&#x440;&#x435; &#x431;&#x44b;&#x43b; &#x437;&#x430;&#x43a;&#x43e;&#x43d; &#x43e; &#x437;&#x430;&#x449;&#x438;&#x442;&#x435; &#x43f;&#x435;&#x440;&#x441;&#x43e;&#x43d;&#x430;&#x43b;&#x44c;&#x43d;&#x44b;&#x445; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445;. &#x41c;&#x43d;&#x43e;&#x433;&#x438;&#x435; &#x43f;&#x43e;&#x44d;&#x442;&#x43e;&#x43c;&#x443; &#x43f;&#x43e;&#x43d;&#x435;&#x441;&#x43b;&#x438; &#x43f;&#x440;&#x44f;&#x43c;&#x44b;&#x435; &#x443;&#x431;&#x44b;&#x442;&#x43a;&#x438;, &#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x434;&#x43e;&#x43f;&#x43e;&#x43b;&#x43d;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x430;&#x44f; &#x43f;&#x43b;&#x430;&#x442;&#x430; &#x437;&#x430; &#x43d;&#x435;&#x443;&#x43a;&#x430;&#x437;&#x430;&#x43d;&#x438;&#x435; &#x438;&#x43d;&#x444;&#x43e;&#x440;&#x43c;&#x430;&#x446;&#x438;&#x438; &#x432; WHOIS.
      &#x422;&#x430;&#x43a;&#x436;&#x435; &#x435;&#x441;&#x442;&#x44c; &#x41f;&#x41e; &#x441; &#x43d;&#x435;&#x43f;&#x440;&#x430;&#x432;&#x438;&#x43b;&#x44c;&#x43d;&#x44b;&#x43c;&#x438; &#x438;&#x43b;&#x438; &#x43d;&#x435;&#x43e;&#x434;&#x43d;&#x43e;&#x437;&#x43d;&#x430;&#x447;&#x43d;&#x44b;&#x43c;&#x438; &#x43b;&#x438;&#x446;&#x435;&#x43d;&#x437;&#x438;&#x44f;&#x43c;&#x438;, &#x441; &#x43d;&#x435;&#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43d;&#x44b;&#x43c; &#x430;&#x432;&#x442;&#x43e;&#x440;&#x441;&#x442;&#x432;&#x43e;&#x43c;. &#x412;&#x44b; &#x43c;&#x43e;&#x436;&#x435;&#x442;&#x435; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x438;&#x442;&#x44c; &#x43a;&#x430;&#x43a;&#x43e;&#x435; &#x43d;&#x438;&#x431;&#x443;&#x434;&#x44c; &#x441;&#x432;&#x43e;&#x431;&#x43e;&#x434;&#x43d;&#x43e;&#x435; &#x41f;&#x41e; &#x441; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x44b;&#x43c; &#x43a;&#x43e;&#x434;&#x43e;&#x43c;, &#x438; &#x43e;&#x431;&#x43d;&#x430;&#x440;&#x443;&#x436;&#x438;&#x442;&#x44c; &#x43f;&#x440;&#x43e;&#x431;&#x43b;&#x435;&#x43c;&#x43d;&#x44b;&#x435; &#x441; &#x442;&#x43e;&#x447;&#x43a;&#x438; &#x437;&#x440;&#x435;&#x43d;&#x438;&#x44f; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x447;&#x430;&#x441;&#x442;&#x438;.
    
    
<p>* &#x413;&#x430;&#x440;&#x430;&#x43d;&#x442;&#x438;&#x44f; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x43e;&#x441;&#x43f;&#x43e;&#x441;&#x43e;&#x431;&#x43d;&#x43e;&#x441;&#x442;&#x438;. &#x415;&#x441;&#x442;&#x44c; &#x434;&#x43e;&#x432;&#x43e;&#x43b;&#x44c;&#x43d;&#x43e; &#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43d;&#x430;&#x44f; &#x43e;&#x448;&#x438;&#x431;&#x43a;&#x430; &quot;&#x43e;&#x442;&#x43a;&#x430;&#x437; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x43e;&#x441;&#x43f;&#x43e;&#x441;&#x43e;&#x431;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x43d;&#x430; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x438;&#x445; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445;&quot;, &#x442;.&#x435;. &#x43a;&#x43e;&#x433;&#x434;&#x430; &#x412;&#x430;&#x448;&#x430; &#x431;&#x430;&#x437;&#x430; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &quot;&#x432;&#x44b;&#x440;&#x43e;&#x441;&#x43b;&#x430;&quot;.
    &#x412;&#x44b; &#x43c;&#x43e;&#x436;&#x435;&#x442;&#x435; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x438;&#x442;&#x44c; &#x434;&#x430;&#x43d;&#x43d;&#x443;&#x44e; &#x43e;&#x448;&#x438;&#x431;&#x43a;&#x443; &#x43d;&#x430; &#x421;&#x41a;&#x443;&#x42d;&#x41b;&#x430;&#x439;&#x442; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;-&#x418;&#x421;&#x41f; &#x438; &#x434;&#x435;&#x43c;&#x43e;&#x43d;&#x441;&#x442;&#x440;&#x430;&#x446;&#x438;&#x43e;&#x43d;&#x43d;&#x43e;&#x439; &#x431;&#x430;&#x437;&#x435; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; bobs-pizza-ws6.sqlite (&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44c;/&#x43f;&#x430;&#x440;&#x43e;&#x43b;&#x44c; admin/admin) &#x438;&#x437; https://sourceforge.net/projects/beige-accounting/ .
    &#x41f;&#x440;&#x43e;&#x441;&#x442;&#x43e; &#x43e;&#x442;&#x43a;&#x440;&#x43e;&#x439;&#x442;&#x435; &#x412;&#x415;&#x411;-&#x43c;&#x430;&#x433;&#x430;&#x437;&#x438;&#x43d; (&#x43e;&#x43d; &#x441;&#x43e;&#x434;&#x435;&#x440;&#x436;&#x438;&#x442; 4000 &#x430;&#x432;&#x442;&#x43e;) - &#x410;&#x432;&#x442;&#x43e; &#x438; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x43d;&#x438;&#x442;&#x435; &#x444;&#x438;&#x43b;&#x44c;&#x442;&#x440; &quot;&#x41f;&#x440;&#x43e;&#x438;&#x437;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x435;&#x43b;&#x44c; &#x412; &#x441;&#x43f;&#x438;&#x441;&#x43a;&#x435; (Ford, Honda) / &#x426;&#x432;&#x435;&#x442; &#x412; &#x441;&#x43f;&#x438;&#x441;&#x43a;&#x435; (&#x41a;&#x440;&#x430;&#x441;&#x43d;&#x44b;&#x439;) / &#x423;&#x43f;&#x43e;&#x440;&#x44f;&#x434;&#x43e;&#x447;&#x438;&#x442; &#x43f;&#x43e; &#x426;&#x435;&#x43d;&#x430; &#x412;&#x43e;&#x437;&#x440;&#x430;&#x441;&#x442;&#x430;&#x43d;&#x438;&#x435;&quot; - &#x43d;&#x430; &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x43c; &#x444;&#x438;&#x43b;&#x44c;&#x442;&#x440;&#x435; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x430; &#x437;&#x430;&#x432;&#x438;&#x441;&#x43d;&#x435;&#x442; &#x43d;&#x430;&#x434;&#x43e;&#x43b;&#x433;&#x43e;, &#x434;&#x440;&#x443;&#x433;&#x43e;&#x439; &#x43f;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43d;&#x43d;&#x44b;&#x439; &#x434;&#x435;&#x43c;&#x43e;-&#x444;&#x438;&#x43b;&#x44c;&#x442;&#x440; (&#x441;&#x43c;&#x43e;&#x442;&#x440;&#x438;&#x442;&#x435; &#x441;&#x43a;&#x440;&#x438;&#x43d;&#x448;&#x43e;&#x442;&#x44b; &#x432; <a href="eis-webstore1.html">Bob's web-store example. Part 1, catalog.</a>) &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x435;&#x442; 1 &#x43c;&#x438;&#x43d;&#x443;&#x442;&#x443;.
    &#x417;&#x430;&#x442;&#x435;&#x43c; &#x441;&#x434;&#x435;&#x43b;&#x430;&#x439;&#x442;&#x435; &#x41f;&#x43e;&#x441;&#x442;&#x433;&#x440;&#x435;&#x421;&#x41a;&#x443;&#x42d;&#x43b; &#x438;&#x43b;&#x438; &#x41c;&#x430;&#x439;&#x421;&#x438;&#x41a;&#x432;&#x44d;&#x43b; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44e; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;-&#x418;&#x421;&#x41f; &#x438; &#x438;&#x43c;&#x43f;&#x43e;&#x440;&#x442;&#x438;&#x440;&#x443;&#x439;&#x442;&#x435; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x438;&#x437; &#x421;&#x41a;&#x443;&#x42d;&#x41b;&#x430;&#x439;&#x442; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; (&#x441;&#x43c;&#x43e;&#x442;&#x440;&#x438;&#x442;&#x435; <a href="eis-import-db-web.html">Import an EIS database by using WEB-service</a>), &#x438; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x44c;&#x442;&#x435; &#x447;&#x442;&#x43e; &#x441;&#x43f;&#x438;&#x441;&#x43e;&#x43a; &#x430;&#x432;&#x442;&#x43e; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x435;&#x442; &#x431;&#x44b;&#x441;&#x442;&#x440;&#x43e; &#x43f;&#x440;&#x438; &#x43b;&#x44e;&#x431;&#x43e;&#x43c; &#x444;&#x438;&#x43b;&#x44c;&#x442;&#x440;&#x435;.
    </p>
    
    </div>
<div class="section">
<h4>&#x41f;&#x43e;&#x447;&#x435;&#x43c;&#x443; &#x441;&#x442;&#x43e;&#x438;&#x442; &#x432;&#x44b;&#x431;&#x440;&#x430;&#x442;&#x44c; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;-&#x412;&#x415;&#x411;? &#x421;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x438;&#x435; &#x412;&#x415;&#x411;-&#x441;&#x442;&#x440;&#x430;&#x43d;&#x438;&#x446; &#x434;&#x438;&#x43d;&#x430;&#x43c;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438; &#x43d;&#x430; &#x441;&#x442;&#x43e;&#x440;&#x43e;&#x43d;&#x435; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x430; &#x438; &#x43d;&#x430; &#x441;&#x442;&#x43e;&#x440;&#x43e;&#x43d;&#x435; &#x43a;&#x43b;&#x438;&#x435;&#x43d;&#x442;&#x430; (&#x432; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x435;).<a name="a___-__-__________."></a></h4>
    
<p>&#x421;&#x442;&#x440;&#x430;&#x43d;&#x438;&#x446;&#x44b; &#x444;&#x43e;&#x440;&#x43c;&#x438;&#x440;&#x443;&#x44e;&#x442;&#x441;&#x44f; &#x434;&#x438;&#x43d;&#x430;&#x43c;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438; &#x43e;&#x431;&#x44b;&#x447;&#x43d;&#x43e; &#x43b;&#x438;&#x431;&#x43e; &#x43d;&#x430; &#x441;&#x442;&#x43e;&#x440;&#x43e;&#x43d;&#x435; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x430;, &#x43b;&#x438;&#x431;&#x43e; &#x43d;&#x435;&#x43f;&#x43e;&#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x435;&#x43d;&#x43d;&#x43e; &#x432; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x435;. &#x41e;&#x431;&#x435; &#x442;&#x435;&#x445;&#x43d;&#x43e;&#x43b;&#x43e;&#x433;&#x438;&#x438; &#x43f;&#x43e;&#x44f;&#x432;&#x438;&#x43b;&#x438;&#x441;&#x44c; &#x434;&#x430;&#x432;&#x43d;&#x43e;.</p>
    
<p>&#x41d;&#x430; &#x441;&#x442;&#x43e;&#x440;&#x43e;&#x43d;&#x435; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x430;: CGI-BIN (C, PERL,...), PHP, ASP, JSP, ASPX, &#x43e;&#x441;&#x43d;&#x43e;&#x432;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x43d;&#x430; JEE Apache Velocity &#x438; Wicket; &#x43d;&#x43e;&#x432;&#x44b;&#x435; JEE Thymeleaf... &#x41e;&#x43d;&#x438; &#x433;&#x435;&#x43d;&#x435;&#x440;&#x438;&#x440;&#x443;&#x44e;&#x442; HTML &#x441;&#x442;&#x440;&#x430;&#x43d;&#x438;&#x446;&#x44b; &#x446;&#x435;&#x43b;&#x438;&#x43a;&#x43e;&#x43c; - &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x438; &#x440;&#x430;&#x437;&#x43c;&#x435;&#x442;&#x43a;&#x430;.</p>
    
<p>&#x41d;&#x430; &#x441;&#x442;&#x43e;&#x440;&#x43e;&#x43d;&#x435; &#x43a;&#x43b;&#x438;&#x435;&#x43d;&#x442;&#x430; (&#x432; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x435;): &#x430;) &#x414;&#x436;&#x430;&#x432;&#x430;&#x421;&#x43a;&#x440;&#x438;&#x43f;&#x442; (JS): &#x43e;&#x441;&#x43d;&#x43e;&#x432;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x43d;&#x430; JEE GWT and JSF, Angular; &#x43d;&#x43e;&#x432;&#x44b;&#x435; Node, React, Vue, ...  ; &#x431;) &#x43f;&#x43b;&#x430;&#x433;&#x438;&#x43d;&#x44b; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;.
      &#x421;&#x435;&#x440;&#x432;&#x435;&#x440; &#x43f;&#x43e;&#x441;&#x44b;&#x43b;&#x430;&#x435;&#x442; &#x434;&#x438;&#x43d;&#x430;&#x43c;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x435; (&#x43e;&#x431;&#x44b;&#x447;&#x43d;&#x43e; &#x43a;&#x430;&#x43a; JSON &#x43e;&#x442;&#x432;&#x435;&#x442;) &#x438; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x439; HTML &#x448;&#x430;&#x431;&#x43b;&#x43e;&#x43d; (&#x43e;&#x431;&#x44b;&#x447;&#x43d;&#x43e; &#x441;&#x43e;&#x434;&#x435;&#x440;&#x436;&#x438;&#x442; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; JS &#x431;&#x438;&#x431;&#x43b;&#x438;&#x43e;&#x442;&#x435;&#x43a;&#x438;), &#x43b;&#x44e;&#x431;&#x430;&#x44f; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x43d;&#x430;&#x44f; &#x442;&#x435;&#x445;&#x43d;&#x43e;&#x43b;&#x43e;&#x433;&#x438;&#x44f; (PHP, JSP...) &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x434;&#x435;&#x43b;&#x430;&#x442;&#x44c; &#x44d;&#x442;&#x43e;,
      &#x442;.&#x435;. &#x438;&#x437;&#x432;&#x43b;&#x435;&#x43a;&#x430;&#x435;&#x442; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x438; &#x43f;&#x43e;&#x441;&#x44b;&#x43b;&#x430;&#x435;&#x442; &#x43a;&#x430;&#x43a; JSON &#x43e;&#x442;&#x432;&#x435;&#x442;.
      &#x41d;&#x430; &#x441;&#x442;&#x43e;&#x440;&#x43e;&#x43d;&#x435; &#x43a;&#x43b;&#x438;&#x435;&#x43d;&#x442;&#x430; &#x43f;&#x43b;&#x430;&#x433;&#x438;&#x43d; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430; &#x438;&#x43b;&#x438; JS &#x431;&#x438;&#x431;&#x43b;&#x438;&#x43e;&#x442;&#x435;&#x43a;&#x430; &#x43f;&#x43e;&#x441;&#x44b;&#x43b;&#x430;&#x435;&#x442; &#x437;&#x430;&#x43f;&#x440;&#x43e;&#x441; &#x43d;&#x430; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x435;, &#x434;&#x430;&#x43b;&#x435;&#x435; &#x43e;&#x442;&#x440;&#x438;&#x441;&#x43e;&#x432;&#x44b;&#x432;&#x430;&#x435;&#x442; &#x432;&#x438;&#x434;&#x436;&#x435;&#x442;&#x44b; (&#x444;&#x43e;&#x440;&#x43c;&#x44b;, &#x441;&#x43f;&#x438;&#x441;&#x43a;&#x438;) &#x432; HTML &#x441;&#x442;&#x440;&#x430;&#x43d;&#x438;&#x446;&#x435;.
      &#x421;&#x43c;&#x43e;&#x442;&#x440;&#x438;&#x442;&#x435; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x444;&#x43e;&#x440;&#x43c;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x441;&#x43f;&#x438;&#x441;&#x43a;&#x430; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x430;&#x43c;&#x438; JS &#x431;&#x438;&#x431;&#x43b;&#x438;&#x43e;&#x442;&#x435;&#x43a;&#x438;: https://js.devexpress.com/Demos/WidgetsGallery/Demo/DataGrid/Overview/AngularJS/Light/.
      &#x411;&#x43b;&#x430;&#x433;&#x43e;&#x434;&#x430;&#x440;&#x44f; &#x413;&#x443;&#x433;&#x43b; &#x432;&#x441;&#x435; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44e;&#x442; &#x435;&#x433;&#x43e; HTML &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x44b;. &#x413;&#x443;&#x433;&#x43b; &#x43f;&#x440;&#x43e;&#x434;&#x432;&#x438;&#x43d;&#x443;&#x43b; JS &#x437;&#x43d;&#x430;&#x447;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;. &#x41f;&#x43e;&#x44d;&#x442;&#x43e;&#x43c;&#x443; &#x434;&#x430;&#x43d;&#x43d;&#x430;&#x44f; &#x442;&#x435;&#x445;&#x43d;&#x43e;&#x43b;&#x43e;&#x433;&#x438;&#x44f; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x438;&#x44f; &#x412;&#x415;&#x411;-&#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x43e;&#x432; &#x437;&#x430;&#x43d;&#x438;&#x43c;&#x430;&#x435;&#x442; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x443;&#x44e; &#x434;&#x43e;&#x43b;&#x44e;.
    </p>
    
<p>
      &#x412;&#x43e; &#x43c;&#x43d;&#x43e;&#x433;&#x438;&#x445; &#x441;&#x43b;&#x443;&#x447;&#x430;&#x44f;&#x445; &#x43e;&#x431;&#x435; &#x442;&#x435;&#x445;&#x43d;&#x43e;&#x43b;&#x43e;&#x433;&#x438;&#x438; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44e;&#x442;&#x441;&#x44f; &#x432; &#x43e;&#x434;&#x43d;&#x43e;&#x43c; &#x412;&#x415;&#x411;-&#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x438;, &#x442;.&#x435;. &#x43f;&#x43e;&#x441;&#x442;&#x440;&#x43e;&#x435;&#x43d;&#x438;&#x435; &#x412;&#x415;&#x411;-&#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x430; &#x434;&#x438;&#x43d;&#x430;&#x43c;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438; &#x438; &#x43d;&#x430; &#x441;&#x442;&#x43e;&#x440;&#x43e;&#x43d;&#x435; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x430;, &#x438; &#x43d;&#x430; &#x441;&#x442;&#x43e;&#x440;&#x43e;&#x43d;&#x435; &#x43a;&#x43b;&#x438;&#x435;&#x43d;&#x442;&#x430;.
      &#x41a; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;&#x443; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;-&#x418;&#x421;&#x41f; &#x434;&#x43b;&#x44f; &#x412;&#x415;&#x411;-&#x43c;&#x430;&#x433;&#x430;&#x437;&#x438;&#x43d;&#x430; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x442; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; JSP, &#x434;&#x430;&#x436;&#x435; &#x431;&#x435;&#x437; AJAX. &#x41d;&#x43e; &#x43f;&#x43b;&#x430;&#x442;&#x435;&#x436;&#x43d;&#x44b;&#x439; &#x448;&#x43b;&#x44e;&#x437; &#x41f;&#x44d;&#x439;&#x41f;&#x430;&#x43b; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x442; JS &#x441;&#x43e;&#x437;&#x434;&#x430;&#x432;&#x430;&#x435;&#x43c;&#x44b;&#x439; &#x412;&#x415;&#x411;-&#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;. 
    </p>
    
<p>&#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;-&#x412;&#x415;&#x411; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x442; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x43d;&#x44b;&#x435; JSP &#x434;&#x43b;&#x44f; &#x433;&#x435;&#x43d;&#x435;&#x440;&#x430;&#x446;&#x438;&#x438; HTML &#x441;&#x442;&#x440;&#x430;&#x43d;&#x438;&#x446; &#x43f;&#x43e;&#x43b;&#x43d;&#x43e;&#x441;&#x442;&#x44c;&#x44e; &#x43b;&#x438;&#x431;&#x43e; &#x438;&#x445; &#x447;&#x430;&#x441;&#x442;&#x435;&#x439; (&#x432; &#x43b;&#x44e;&#x431;&#x43e;&#x43c; &#x441;&#x43b;&#x443;&#x447;&#x430;&#x435; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x441; HTML &#x440;&#x430;&#x437;&#x43c;&#x435;&#x442;&#x43a;&#x43e;&#x439;).
      &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;-&#x412;&#x415;&#x411; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x442; AJAX &#x437;&#x430;&#x43f;&#x440;&#x43e;&#x441;&#x44b; &#x438; JSON &#x43e;&#x442;&#x432;&#x435;&#x442;&#x44b; &#x438; &#x43c;&#x43e;&#x434;&#x438;&#x444;&#x438;&#x446;&#x438;&#x440;&#x443;&#x435;&#x442; HTML &#x441;&#x442;&#x440;&#x430;&#x43d;&#x438;&#x446;&#x443; (&#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x438; &#x440;&#x430;&#x437;&#x43c;&#x435;&#x442;&#x43a;&#x443;) &#x447;&#x430;&#x441;&#x442;&#x44f;&#x43c;&#x438;, &#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x43a;&#x43e;&#x433;&#x434;&#x430; &#x432;&#x44b; &#x43d;&#x430;&#x436;&#x438;&#x43c;&#x430;&#x435;&#x442;&#x435; <b>&#x417;&#x430;&#x43f;&#x438;&#x441;&#x430;&#x442;&#x44c;</b>,
      &#x442;&#x43e;&#x433;&#x434;&#x430; &#x43f;&#x43e;&#x441;&#x44b;&#x43b;&#x430;&#x435;&#x442;&#x441;&#x44f; AJAX &#x437;&#x430;&#x43f;&#x440;&#x43e;&#x441;, &#x437;&#x430;&#x442;&#x435;&#x43c; &#x43f;&#x43e;&#x43b;&#x443;&#x447;&#x435;&#x43d;&#x43d;&#x44b;&#x439; JSON &#x43c;&#x443;&#x43b;&#x44c;&#x442;&#x438;-&#x446;&#x435;&#x43b;&#x435;&#x432;&#x43e;&#x439; &#x43e;&#x442;&#x432;&#x435;&#x442; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44f; &#x434;&#x43b;&#x44f; &#x43e;&#x431;&#x43d;&#x43e;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x444;&#x43e;&#x440;&#x43c;&#x44b;, &#x43f;&#x43e;&#x434;&#x43b;&#x435;&#x436;&#x430;&#x449;&#x435;&#x433;&#x43e; &#x441;&#x43f;&#x438;&#x441;&#x43a;&#x430;,
      &#x432;&#x44b;&#x432;&#x43e;&#x434;&#x430; &#x441;&#x43e;&#x43e;&#x431;&#x449;&#x435;&#x43d;&#x438;&#x44f; (&#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &quot;&#x440;&#x435;&#x434;&#x430;&#x43a;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x443;&#x441;&#x43f;&#x435;&#x448;&#x43d;&#x43e;&quot;) &#x438; &#x43f;&#x440;&#x43e;&#x447;&#x435;&#x435; &#x447;&#x442;&#x43e; &#x432;&#x43a;&#x43b;&#x44e;&#x447;&#x435;&#x43d;&#x43e; &#x432; &#x43f;&#x43e;&#x43b;&#x443;&#x447;&#x435;&#x43d;&#x43d;&#x44b;&#x439; JSON &#x43e;&#x442;&#x432;&#x435;&#x442;.
      &#x418;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; AJAX &#x438; JSON &#x43f;&#x43e;&#x437;&#x432;&#x43e;&#x43b;&#x44f;&#x435;&#x442; &#x443;&#x43c;&#x435;&#x43d;&#x44c;&#x448;&#x438;&#x442;&#x44c; &#x442;&#x440;&#x430;&#x444;&#x444;&#x438;&#x43a;, &#x442;.&#x435;. &#x44d;&#x442;&#x43e; &#x431;&#x44b;&#x441;&#x442;&#x440;&#x435;&#x435; &#x447;&#x435;&#x43c; &#x43e;&#x431;&#x43d;&#x43e;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x435; &#x432;&#x441;&#x435;&#x439; &#x441;&#x442;&#x440;&#x430;&#x43d;&#x438;&#x446;&#x438; &#x43f;&#x43e;&#x441;&#x43b;&#x435; &#x43e;&#x442;&#x43f;&#x440;&#x430;&#x432;&#x43a;&#x438; &#x444;&#x43e;&#x440;&#x43c;&#x44b;.
      &#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; <b>beige-web/src/main/webapp/WEB-INF/jsp/esj.jsp</b>:
</p>
<div>
<pre style="white-space: pre-wrap;">
&lt;%@ page language=&quot;java&quot; contentType=&quot;application/json; charset=UTF-8&quot; pageEncoding=&quot;UTF-8&quot;%&gt;
&lt;%@ taglib prefix=&quot;c&quot; uri=&quot;http://java.sun.com/jsp/jstl/core&quot; %&gt;
&lt;%@ taglib prefix=&quot;fmt&quot; uri=&quot;http://java.sun.com/jsp/jstl/fmt&quot; %&gt;
&lt;jsp:include page=&quot;tml/var.jsp&quot;/&gt;
&lt;jsp:useBean id=&quot;usdDp&quot; class=&quot;java.util.HashMap&quot; scope=&quot;request&quot;/&gt;
&lt;c:set var=&quot;ent&quot; value=&quot;${rvs.uvs.ent}&quot; scope=&quot;request&quot;/&gt;
&lt;c:set var=&quot;frPlNm&quot; value=&quot;frmMnPl&quot; scope=&quot;request&quot;/&gt;
&lt;c:set var=&quot;frAct&quot; value=&quot;srv&quot; scope=&quot;request&quot;/&gt;
&lt;c:import url=&quot;/WEB-INF/jsp/tml/ed.jsp&quot; varReader=&quot;rdEdEn&quot; charEncoding=&quot;UTF-8&quot;&gt;
{&quot;mlTrRsp&quot;:
  [{&quot;trgNm&quot;: &quot;${frPlNm}&quot;, &quot;cont&quot;: &quot;${utJsp.toJsonStrCls(rdEdEn)}&quot;,
    &quot;trgPrNm&quot;: null, &quot;jscr&quot;: null}
    &lt;c:set var=&quot;jscr&quot; value=&quot;${hldUvd.setJs(rvs,usdDp,frPlNm)}bsOpnDlg('${frPlNm}EdDlg');&quot;/&gt;
    &lt;c:if test=&quot;${not empty rvs.msgSuc}&quot;&gt;
      &lt;c:set var=&quot;jscr&quot; value=&quot;${jscr}bsShwSuc('${i18n.getMsg(rvs.msgSuc, rvs.upf.lng.iid)}');&quot;/&gt;
    &lt;/c:if&gt;
    &lt;c:if test=&quot;${not empty rvs.msgWrn}&quot;&gt;
      &lt;c:set var=&quot;jscr&quot; value=&quot;${jscr}bsShwWrn('${i18n.getMsg(rvs.msgWrn, rvs.upf.lng.iid)}');&quot;/&gt;
    &lt;/c:if&gt;
    &lt;c:if test=&quot;${not empty rvs.msgErr}&quot;&gt;
      &lt;c:set var=&quot;jscr&quot; value=&quot;${jscr}bsShwErr('${i18n.getMsg(rvs.msgErr, rvs.upf.lng.iid)}');&quot;/&gt;
    &lt;/c:if&gt;
    &lt;c:if test=&quot;${not empty numJsAf}&quot;&gt;
      &lt;c:set var=&quot;jscr&quot; value=&quot;${jscr}${numJsAf}&quot;/&gt;
    &lt;/c:if&gt;
    &lt;c:set var=&quot;lsPlNm&quot; value=&quot;lstMnPl&quot; scope=&quot;request&quot;/&gt;
    &lt;c:set var=&quot;prfFlOrFrm&quot; value=&quot;${lsPlNm}&quot; scope=&quot;request&quot;/&gt;
    &lt;c:set var=&quot;rndLst&quot; value=&quot;lj&quot; scope=&quot;request&quot;/&gt;
    &lt;c:import url=&quot;/WEB-INF/jsp/tml/lst.jsp&quot; varReader=&quot;rdEnts&quot; charEncoding=&quot;UTF-8&quot;&gt;
      ,{&quot;trgNm&quot;: &quot;${lsPlNm}lst&quot;, &quot;cont&quot;: &quot;${utJsp.toJsonStrCls(rdEnts)}&quot;,
        &quot;trgPrNm&quot;: null, &quot;jscr&quot;: &quot;${utJsp.toJsonStr(jscr)}&quot;}
    &lt;/c:import&gt;
  ]
}
&lt;/c:import&gt;
</pre></div>
      &#x414;&#x430;&#x43d;&#x43d;&#x44b;&#x439; &#x43e;&#x442;&#x432;&#x435;&#x442; &#x43e;&#x431;&#x43d;&#x43e;&#x432;&#x43b;&#x44f;&#x435;&#x442; &#x444;&#x43e;&#x440;&#x43c;&#x443; (&#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x43d;&#x443;&#x44e; <b>jsp/tml/ed.jsp</b> &#x438;&#x437; &#x43f;&#x435;&#x440;&#x435;&#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x431;&#x438;&#x437;&#x43d;&#x435;&#x441;-&#x441;&#x435;&#x440;&#x432;&#x438;&#x441;&#x43e;&#x43c; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x438; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445;)
      &#x432; HTML &#x441;&#x442;&#x440;&#x430;&#x43d;&#x438;&#x446;&#x435; &#x432;&#x43d;&#x443;&#x442;&#x440;&#x438; <b>DIV</b> &#x446;&#x435;&#x43b;&#x438; &#x441; &#x438;&#x434;&#x435;&#x43d;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442;&#x43e;&#x440;&#x43e;&#x43c; ID=<b>${frmMnPl}</b>. &#x422;&#x43e;&#x436;&#x435; &#x441;&#x430;&#x43c;&#x43e;&#x435; &#x43f;&#x440;&#x43e;&#x438;&#x441;&#x445;&#x43e;&#x434;&#x438;&#x442; &#x441;&#x43e; &#x441;&#x43f;&#x438;&#x441;&#x43a;&#x43e;&#x43c;. JSON &#x43e;&#x442;&#x432;&#x435;&#x442; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x441;&#x43e;&#x434;&#x435;&#x440;&#x436;&#x438;&#x442; &#x438;&#x43d;&#x441;&#x442;&#x440;&#x443;&#x43a;&#x446;&#x438;&#x438; &#x414;&#x436;&#x430;&#x432;&#x430;&#x421;&#x43a;&#x440;&#x438;&#x43f;&#x442;, &#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x434;&#x43b;&#x44f; &#x432;&#x44b;&#x432;&#x43e;&#x434;&#x430; &#x441;&#x43e;&#x43e;&#x431;&#x449;&#x435;&#x43d;&#x438;&#x44f; &#x43e;&#x431; &#x43e;&#x448;&#x438;&#x431;&#x43a;&#x435;/&#x443;&#x441;&#x43f;&#x435;&#x445;&#x435; &#x438; &#x434;&#x43b;&#x44f; &#x43e;&#x442;&#x43a;&#x440;&#x44b;&#x442;&#x438;&#x44f; &#x43c;&#x43e;&#x434;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x439; &#x444;&#x43e;&#x440;&#x43c;&#x44b;.
    
    
<p>&#x41a;&#x430;&#x43a;&#x430;&#x44f; &#x442;&#x435;&#x445;&#x43d;&#x43e;&#x43b;&#x43e;&#x433;&#x438;&#x44f; &#x43b;&#x443;&#x447;&#x448;&#x435;? &#x412;&#x43e; &#x43f;&#x435;&#x440;&#x432;&#x44b;&#x445;, &#x438;&#x433;&#x43d;&#x43e;&#x440;&#x438;&#x440;&#x443;&#x439;&#x442;&#x435; &#x43f;&#x451;&#x441;&#x442;&#x440;&#x44b;&#x435; &#x441;&#x43b;&#x43e;&#x432;&#x430;  &#x432;&#x440;&#x43e;&#x434;&#x435; &quot;&#x43d;&#x43e;&#x432;&#x435;&#x439;&#x448;&#x438;&#x439;&quot;, &quot;&#x43f;&#x440;&#x43e;&#x434;&#x432;&#x438;&#x43d;&#x443;&#x442;&#x44b;&#x439;&quot;...
      &#x41e;&#x431;&#x44b;&#x447;&#x43d;&#x43e;&#x435; &#x441;&#x43e;&#x440;&#x435;&#x432;&#x43d;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x434;&#x430;&#x435;&#x442; &#x430;&#x431;&#x441;&#x43e;&#x43b;&#x44e;&#x442;&#x43d;&#x43e; &#x442;&#x43e;&#x447;&#x43d;&#x44b;&#x439; &#x43e;&#x442;&#x432;&#x435;&#x442;, &#x43f;&#x440;&#x43e;&#x441;&#x442;&#x43e; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x442;&#x435; &#x440;&#x430;&#x437;&#x43d;&#x44b;&#x435; &#x442;&#x435;&#x445;&#x43d;&#x43e;&#x43b;&#x43e;&#x433;&#x438;&#x438; (&#x431;&#x438;&#x431;&#x43b;&#x438;&#x43e;&#x442;&#x435;&#x43a;&#x438;) &#x43d;&#x430; &#x440;&#x435;&#x430;&#x43b;&#x44c;&#x43d;&#x44b;&#x445; &#x441;&#x43b;&#x43e;&#x436;&#x43d;&#x44b;&#x445; &#x437;&#x430;&#x434;&#x430;&#x447;&#x430;&#x445;. &#x41d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x444;&#x43e;&#x440;&#x43c;&#x44b; &#x43d;&#x430;&#x43a;&#x43b;&#x430;&#x434;&#x43d;&#x43e;&#x439; &#x438; &#x435;&#x435; &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x438; &#x432; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;-&#x418;&#x421;&#x41f; &#x43c;&#x435;&#x43d;&#x44f;&#x44e;&#x442;&#x441;&#x44f; &#x43e;&#x447;&#x435;&#x43d;&#x44c; &#x441;&#x438;&#x43b;&#x44c;&#x43d;&#x43e; &#x432; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x438; &#x43e;&#x442;: &#x430;) &#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x43e;&#x43e;&#x431;&#x43b;&#x430;&#x433;&#x430;&#x435;&#x43c;&#x430;&#x44f; &#x438;&#x43b;&#x438; &#x43d;&#x435;&#x442;, &#x431;) &#x432;&#x43a;&#x43b;&#x44e;&#x447;&#x435;&#x43d; &#x43b;&#x438; &#x41d;&#x414;&#x421; c) &#x441;&#x447;&#x438;&#x442;&#x430;&#x442;&#x44c; &#x41d;&#x414;&#x421; &#x43f;&#x43e;&#x441;&#x442;&#x440;&#x43e;&#x447;&#x43d;&#x43e;/&#x43f;&#x43e; &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x443; &#x434;) &#x441;&#x43e;&#x432;&#x43e;&#x43a;&#x443;&#x43f;&#x43d;&#x430;&#x44f; &#x43b;&#x438; &#x441;&#x442;&#x430;&#x432;&#x43a;&#x430; &#x41d;&#x414;&#x421; &#x435;) &#x41d;&#x414;&#x421; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x442; &#x43e;&#x442; &#x440;&#x435;&#x433;&#x438;&#x43e;&#x43d;&#x430; &#x43f;&#x43e;&#x43a;&#x443;&#x43f;&#x430;&#x442;&#x435;&#x43b;&#x44f;.
      &#x414;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x44b; &#x41d;&#x414;&#x421; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44e;&#x442;&#x441;&#x44f; &#x432; &#x434;&#x440;&#x443;&#x433;&#x438;&#x445; &#x441;&#x442;&#x440;&#x430;&#x43d;&#x430;&#x445;. &#x423; &#x43d;&#x430;&#x441; &#x442;&#x430;&#x43a;-&#x436;&#x435; &#x431;&#x44b;&#x43b;&#x438; &#x43c;&#x435;&#x441;&#x442;&#x43d;&#x44b;&#x435; &#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x438; &#x437;&#x430; &#x442;&#x43e;&#x432;&#x430;&#x440; (&#x433;&#x434;&#x435;-&#x442;&#x43e; &#x434;&#x43e; 2000?).
      &#x41a;&#x430;&#x442;&#x430;&#x43b;&#x43e;&#x433; &#x412;&#x415;&#x411;-&#x43c;&#x430;&#x433;&#x430;&#x437;&#x438;&#x43d;&#x430; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x43f;&#x43e;&#x43a;&#x430;&#x437;&#x44b;&#x432;&#x430;&#x442;&#x44c; &#x43f;&#x43e;&#x437;&#x438;&#x446;&#x438;&#x438; &#x441;&#x43e;&#x433;&#x43b;&#x430;&#x441;&#x43d;&#x43e; &#x434;&#x43e;&#x432;&#x43e;&#x43b;&#x44c;&#x43d;&#x43e; &#x441;&#x43b;&#x43e;&#x436;&#x43d;&#x43e;&#x439; &#x431;&#x438;&#x437;&#x43d;&#x435;&#x441;-&#x43b;&#x43e;&#x433;&#x438;&#x43a;&#x438;. &#x422;&#x430;&#x43a;&#x436;&#x435; &#x43f;&#x43e;&#x43f;&#x44b;&#x442;&#x430;&#x439;&#x442;&#x435;&#x441;&#x44c; &#x441;&#x434;&#x435;&#x43b;&#x430;&#x442;&#x44c; &#x443;&#x43d;&#x438;&#x432;&#x435;&#x440;&#x441;&#x430;&#x43b;&#x44c;&#x43d;&#x44b;&#x439; &#x433;&#x435;&#x43d;&#x435;&#x440;&#x430;&#x442;&#x43e;&#x440; &#x412;&#x415;&#x411;-&#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x430; (&#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438; &#x433;&#x435;&#x43d;&#x435;&#x440;&#x438;&#x440;&#x443;&#x435;&#x442; &#x444;&#x43e;&#x440;&#x43c;&#x44b; &#x438; &#x441;&#x43f;&#x438;&#x441;&#x43a;&#x438; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x438; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445;) &#x442;&#x430;&#x43a;&#x43e;&#x439; &#x43a;&#x430;&#x43a; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;-&#x412;&#x415;&#x411;.
      &#x41c;&#x43d;&#x43e;&#x433;&#x43e;&#x447;&#x438;&#x441;&#x43b;&#x435;&#x43d;&#x43d;&#x44b;&#x435; &#x431;&#x438;&#x431;&#x43b;&#x438;&#x43e;&#x442;&#x435;&#x43a;&#x438; &#x434;&#x43b;&#x44f; &#x412;&#x415;&#x411;-&#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x43e;&#x432; &#x43f;&#x440;&#x43e;&#x441;&#x442;&#x43e; &#x43a;&#x438;&#x448;&#x430;&#x442;, &#x43d;&#x43e; &#x43e;&#x43d;&#x438; &#x43e;&#x431;&#x44b;&#x447;&#x43d;&#x43e; &#x43d;&#x435; &#x43f;&#x440;&#x43e;&#x438;&#x437;&#x432;&#x43e;&#x434;&#x44f;&#x442; &#x445;&#x43e;&#x440;&#x43e;&#x448;&#x435;&#x433;&#x43e; &#x432;&#x43f;&#x435;&#x447;&#x430;&#x442;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x43f;&#x440;&#x438; &#x431;&#x43e;&#x43b;&#x435;&#x435; &#x433;&#x43b;&#x443;&#x431;&#x43e;&#x43a;&#x43e;&#x43c; &#x440;&#x430;&#x441;&#x441;&#x43c;&#x43e;&#x442;&#x440;&#x435;&#x43d;&#x438;&#x438;. &#x427;&#x435;&#x433;&#x43e; &#x441;&#x442;&#x43e;&#x438;&#x442; &#x448;&#x438;&#x440;&#x43f;&#x43e;&#x442;&#x440;&#x435;&#x431; &#x447;&#x442;&#x43e; &#x43f;&#x43e;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442; &#x438;&#x434;&#x435;&#x43d;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442;&#x43e;&#x440; &#x411;&#x414; (&#x43f;&#x435;&#x440;&#x432;&#x438;&#x447;&#x43d;&#x43e;&#x433;&#x43e; &#x43a;&#x43b;&#x44e;&#x447;&#x430;) &#x43b;&#x438;&#x448;&#x44c; &#x43e;&#x434;&#x43d;&#x43e;&#x433;&#x43e; &#x432;&#x438;&#x434;&#x430; - &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x435; &#x446;&#x435;&#x43b;&#x43e;&#x435; &#x447;&#x438;&#x441;&#x43b;&#x43e; &#x438;&#x43b;&#x438; &#x413;&#x423;&#x418;&#x414;. &#x411;&#x435;&#x438;&#x436;-&#x412;&#x415;&#x411; &#x43b;&#x435;&#x433;&#x43a;&#x43e; &#x43f;&#x43e;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x435;&#x442; &#x43b;&#x44e;&#x431;&#x44b;&#x435; &#x438;&#x434;&#x435;&#x43d;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442;&#x43e;&#x440;&#x44b;, &#x432; &#x442;.&#x447;. &#x441;&#x43e;&#x441;&#x442;&#x430;&#x432;&#x43d;&#x44b;&#x435; (&#x413;&#x423;&#x418;&#x414; &#x43d;&#x435; &#x440;&#x435;&#x430;&#x43b;&#x438;&#x437;&#x43e;&#x432;&#x430;&#x43d; &#x432;&#x432;&#x438;&#x434;&#x443; &#x435;&#x433;&#x43e; &#x43f;&#x440;&#x43e;&#x431;&#x43b;&#x435;&#x43c;&#x43d;&#x43e;&#x439; &#x43c;&#x443;&#x43b;&#x44c;&#x442;&#x438;&#x43f;&#x43b;&#x430;&#x442;&#x444;&#x43e;&#x440;&#x43c;&#x435;&#x43d;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x438; &#x431;&#x43e;&#x43b;&#x435;&#x435; &#x431;&#x44b;&#x441;&#x442;&#x440;&#x43e;&#x433;&#x43e; &#x438; &#x43c;&#x443;&#x43b;&#x44c;&#x442;&#x438;&#x43f;&#x43b;&#x430;&#x442;&#x444;&#x43e;&#x440;&#x43c;&#x435;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x430;&#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x430;, &#x43d;&#x43e; &#x435;&#x441;&#x43b;&#x438; &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x442;&#x43e; &#x440;&#x435;&#x430;&#x43b;&#x438;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x435;&#x433;&#x43e; &#x43d;&#x435;&#x434;&#x43e;&#x43b;&#x433;&#x43e;, &#x43f;&#x440;&#x430;&#x432;&#x434;&#x430; &#x421;&#x41a;&#x41b;&#x410;&#x419;&#x422; &#x431;&#x443;&#x434;&#x435;&#x442; &#x445;&#x440;&#x430;&#x43d;&#x438;&#x442;&#x44c; &#x435;&#x433;&#x43e; &#x442;&#x435;&#x43a;&#x441;&#x442;&#x43e;&#x432;&#x43e;&#x435; &#x43f;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x435;).
    </p>
    
<p>&#x41d;&#x435;&#x434;&#x43e;&#x441;&#x442;&#x430;&#x442;&#x43a;&#x438; &#x433;&#x435;&#x43d;&#x435;&#x440;&#x430;&#x446;&#x438;&#x438; &#x412;&#x415;&#x411;-&#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x430; &#x43d;&#x430; &#x441;&#x442;&#x43e;&#x440;&#x43e;&#x43d;&#x435; &#x43a;&#x43b;&#x438;&#x435;&#x43d;&#x442;&#x430;:
      </p>
<ul>
        
<li>&#x418;&#x43d;&#x442;&#x435;&#x440;&#x43d;&#x430;&#x446;&#x438;&#x43e;&#x43d;&#x430;&#x43b;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44f; - &#x432;&#x44b; &#x434;&#x43e;&#x43b;&#x436;&#x43d;&#x44b; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x438;&#x442;&#x44c; &#x43f;&#x43e;&#x43b;&#x43d;&#x44b;&#x435; &#x441;&#x43b;&#x43e;&#x432;&#x430;&#x440;&#x438; &#x432; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;</li>
        
<li>&#x412;&#x430;&#x43c; &#x447;&#x430;&#x441;&#x442;&#x43e; &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x43f;&#x43e;&#x441;&#x44b;&#x43b;&#x430;&#x442;&#x44c; &#x43d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x438; &#x434;&#x43b;&#x44f; &#x433;&#x435;&#x43d;&#x435;&#x440;&#x430;&#x446;&#x438;&#x438; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x430;, &#x438; &#x44d;&#x442;&#x43e; &#x43f;&#x440;&#x43e;&#x431;&#x43b;&#x435;&#x43c;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x43d;&#x43e; &#x435;&#x441;&#x43b;&#x438; &#x432;&#x44b; &#x43d;&#x435; &#x445;&#x43e;&#x442;&#x438;&#x442;&#x435; &#x432;&#x44b;&#x441;&#x442;&#x430;&#x432;&#x43b;&#x44f;&#x442;&#x44c; &#x43d;&#x435;&#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x435; &#x43d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x438; &quot;&#x43d;&#x430;&#x440;&#x443;&#x436;&#x443;&quot; (&#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x442; &#x43e;&#x442; &#x442;&#x435;&#x43a;&#x443;&#x449;&#x435;&#x433;&#x43e; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44f;, &#x43d;&#x43e; &#x43e;&#x43d; &#x43d;&#x435; &#x434;&#x43e;&#x43b;&#x436;&#x435;&#x43d; &#x44d;&#x442;&#x43e;&#x433;&#x43e; &#x437;&#x43d;&#x430;&#x442;&#x44c;).</li>
        
<li>&#x43e;&#x43f;&#x44f;&#x442;&#x44c;, &#x43b;&#x43e;&#x433;&#x438;&#x43a;&#x430; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x430; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x431;&#x44b;&#x442;&#x44c; &#x43e;&#x447;&#x435;&#x43d;&#x44c; &#x441;&#x43b;&#x43e;&#x436;&#x43d;&#x43e;&#x439; &#x438; &#x438;&#x437;&#x43c;&#x435;&#x43d;&#x44f;&#x435;&#x43c;&#x43e;&#x439;, &#x438; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x43d;&#x430;&#x44f; &#x442;&#x435;&#x445;&#x43d;&#x43e;&#x43b;&#x43e;&#x433;&#x438;&#x44f; &#x44f;&#x432;&#x43d;&#x43e; &#x43f;&#x440;&#x43e;&#x449;&#x435; &#x438; &#x431;&#x44b;&#x441;&#x442;&#x440;&#x435;&#x435; &#x434;&#x43b;&#x44f; &#x44d;&#x442;&#x43e;&#x433;&#x43e;.</li>
        
<li>&#x434;&#x43b;&#x44f; JS - &#x435;&#x433;&#x43e; &#x431;&#x438;&#x431;&#x43b;&#x438;&#x43e;&#x442;&#x435;&#x43a;&#x438; &#x43e;&#x433;&#x440;&#x43e;&#x43c;&#x43d;&#x44b;.</li>
        
<li>&#x434;&#x43b;&#x44f; JS - &#x43f;&#x43e;&#x441;&#x43c;&#x43e;&#x442;&#x440;&#x438;&#x442;&#x435; &#x432;&#x43d;&#x443;&#x442;&#x440;&#x44c; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;-&#x412;&#x415;&#x411;(&#x438;&#x43c;&#x435;&#x43d;&#x43d;&#x43e; &#x418;&#x421;&#x41f;), &#x43e;&#x43d; &#x447;&#x430;&#x441;&#x442;&#x43e; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x442; BigDecimal &#x432; &#x438;&#x43d;&#x441;&#x442;&#x440;&#x443;&#x43a;&#x446;&#x438;&#x44f;&#x445; JSP. &#x412; &#x43f;&#x440;&#x43e;&#x442;&#x438;&#x432;&#x43e;&#x43f;&#x43e;&#x43b;&#x43e;&#x436;&#x43d;&#x43e;&#x441;&#x442;&#x44c; &#x44d;&#x442;&#x43e;&#x43c;&#x443;, &#x414;&#x436;&#x430;&#x432;&#x430;&#x421;&#x43a;&#x440;&#x438;&#x43f;&#x442; &#x438;&#x43c;&#x435;&#x435;&#x442; &#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x43e;&#x43f;&#x430;&#x441;&#x43d;&#x44b;&#x445; &#x432;&#x435;&#x449;&#x435;&#x439; (&#x433;&#x438;&#x431;&#x43a;&#x43e;&#x441;&#x442;&#x44c;, JIT-&#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x442;&#x43e;&#x440;), &#x43d;&#x43e; &#x43d;&#x435; &#x438;&#x43c;&#x435;&#x435;&#x442; &#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x43d;&#x443;&#x436;&#x43d;&#x44b;&#x445; &#x432;&#x435;&#x449;&#x435;&#x439; &#x442;&#x430;&#x43a;&#x438;&#x445; &#x43a;&#x430;&#x43a; Decimal(&#x447;&#x438;&#x441;&#x43b;&#x43e;&#x432;&#x43e;&#x439; &#x43d;&#x43e; &#x43d;&#x435; &#x441; &#x43f;&#x43b;&#x430;&#x432;&#x430;&#x44e;&#x449;&#x435;&#x439; &#x442;&#x43e;&#x447;&#x43a;&#x43e;&#x439;) &#x442;&#x438;&#x43f;. &#x412;&#x44b; &#x43f;&#x43e;&#x43b;&#x443;&#x447;&#x438;&#x442;&#x435; &#x43f;&#x440;&#x43e;&#x431;&#x43b;&#x435;&#x43c;&#x44b; &#x43f;&#x440;&#x438; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x435; &#x441; &#x447;&#x438;&#x441;&#x43b;&#x430;&#x43c;&#x438; &#x441; &#x43f;&#x43b;&#x430;&#x432;&#x430;&#x44e;&#x449;&#x435;&#x439; &#x442;&#x43e;&#x447;&#x43a;&#x43e;&#x439; (float) &#x432; &#x414;&#x436;&#x430;&#x432;&#x430;&#x421;&#x43a;&#x440;&#x438;&#x43f;&#x442;&#x435;, &#x438; &#x432;&#x44b; &#x434;&#x43e;&#x43b;&#x436;&#x43d;&#x44b; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x434;&#x43e;&#x43f;&#x43e;&#x43b;&#x43d;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x44b;&#x435; JS &#x431;&#x438;&#x431;&#x43b;&#x438;&#x43e;&#x442;&#x435;&#x43a;&#x438; &#x434;&#x43b;&#x44f; &#x44d;&#x442;&#x43e;&#x433;&#x43e;.</li>
      </ul>
    
    
<p>&#x41d;&#x435;&#x434;&#x43e;&#x441;&#x442;&#x430;&#x442;&#x43a;&#x438; &#x433;&#x435;&#x43d;&#x435;&#x440;&#x430;&#x446;&#x438;&#x438; &#x412;&#x415;&#x411;-&#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x430; &#x43d;&#x430; &#x441;&#x442;&#x43e;&#x440;&#x43e;&#x43d;&#x435; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x430;:
      </p>
<ul>
        
<li>&#x414;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x438; &#x432;&#x438;&#x434;&#x436;&#x435;&#x442;&#x44b; &#x432;&#x43c;&#x435;&#x441;&#x442;&#x435; (&#x43a;&#x43b;&#x430;&#x441;&#x441;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x439; HTML), &#x442;&#x430;&#x43a;-&#x447;&#x442;&#x43e; &#x44d;&#x442;&#x43e; &#x443;&#x432;&#x435;&#x43b;&#x438;&#x446;&#x438;&#x432;&#x430;&#x435;&#x442; &#x442;&#x440;&#x430;&#x444;&#x444;&#x438;&#x43a; &#x432;&#x43e; &#x43c;&#x43d;&#x43e;&#x433;&#x438;&#x445; &#x441;&#x43b;&#x443;&#x447;&#x430;&#x44f;&#x445; &#x432; &#x441;&#x440;&#x430;&#x432;&#x43d;&#x435;&#x43d;&#x438;&#x438; &#x441; &#x43a;&#x43b;&#x438;&#x435;&#x43d;&#x442;&#x441;&#x43a;&#x438;&#x43c; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x43e;&#x43c;. &#x414;&#x43b;&#x44f; &#x43c;&#x43d;&#x43e;&#x433;&#x438;&#x445; &#x441;&#x43b;&#x443;&#x447;&#x430;&#x435;&#x432; (&#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;-&#x412;&#x415;&#x411; &#x442;.&#x435;. &#x412;&#x415;&#x411;-&#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; &#x434;&#x43b;&#x44f; &#x444;&#x438;&#x43d;&#x430;&#x43d;&#x441;&#x43e;&#x432;&#x44b;&#x445; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x439;), &#x440;&#x430;&#x437;&#x434;&#x435;&#x43b;&#x435;&#x43d;&#x438;&#x435; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x438; &#x432;&#x438;&#x434;&#x436;&#x435;&#x442;&#x43e;&#x432; &#x432; &#x444;&#x430;&#x437;&#x435; &#x43f;&#x440;&#x435;&#x437;&#x435;&#x43d;&#x442;&#x430;&#x446;&#x438;&#x438; &#x44d;&#x442;&#x43e; &#x445;&#x43e;&#x440;&#x43e;&#x448;&#x438;&#x439; &#x43f;&#x43e;&#x434;&#x445;&#x43e;&#x434;, &#x43d;&#x43e; &#x434;&#x43b;&#x44f; &#x44d;&#x442;&#x43e;&#x433;&#x43e; &#x434;&#x43e;&#x43b;&#x436;&#x435;&#x43d; &#x431;&#x44b;&#x442;&#x44c; HTML5+ (&#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43d;&#x438;&#x435; &#x438;&#x43b;&#x438; &#x43f;&#x43b;&#x430;&#x433;&#x438;&#x43d;), &#x43d;&#x435; JS.
          &#x412; &#x441;&#x43b;&#x443;&#x447;&#x430;&#x435;-&#x436;&#x435; &#x412;&#x415;&#x411;-&#x43c;&#x430;&#x433;&#x430;&#x437;&#x438;&#x43d;&#x430;, &#x444;&#x43e;&#x442;&#x43e; &#x442;&#x43e;&#x432;&#x430;&#x440;&#x43e;&#x432; &#x438; &#x438;&#x445; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x438;&#x435; &#x43e;&#x43f;&#x438;&#x441;&#x430;&#x43d;&#x438;&#x44f; &#x432;&#x435;&#x441;&#x44f;&#x442; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x435; &#x447;&#x435;&#x43c; HTML &#x440;&#x430;&#x437;&#x43c;&#x435;&#x442;&#x43a;&#x430;.
        </li>
        
<li>&#x422;.&#x43a;. HTML5 &#x440;&#x435;&#x430;&#x43b;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44f; &#x43d;&#x435; &#x43f;&#x43e;&#x43b;&#x43d;&#x430;&#x44f; (&#x438; &#x441;&#x43f;&#x435;&#x446;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x446;&#x438;&#x44f; &#x43e;&#x441;&#x43d;&#x43e;&#x432;&#x430;&#x43d;&#x430; &#x43d;&#x430; &#x433;&#x438;&#x431;&#x43a;&#x43e;&#x43c; &#x438; &#x43e;&#x43f;&#x430;&#x441;&#x43d;&#x43e;&#x43c; JS) &#x432;&#x430;&#x43c; &#x43d;&#x435;&#x43e;&#x431;&#x445;&#x43e;&#x434;&#x438;&#x43c;&#x43e; &#x434;&#x43e;&#x43a;&#x43e;&#x434;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x43d;&#x430; &#x414;&#x436;&#x430;&#x432;&#x430;&#x421;&#x43a;&#x440;&#x438;&#x43f;&#x442;, &#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x411;&#x435;&#x438;&#x436;-&#x412;&#x415;&#x411; &#x447;&#x438;&#x441;&#x43b;&#x43e;&#x432;&#x43e;&#x439; &#x432;&#x438;&#x434;&#x436;&#x435;&#x442; BsInpNum.js &#x438; BsNum.js &#x434;&#x43b;&#x44f; &#x43e;&#x43a;&#x440;&#x443;&#x433;&#x43b;&#x435;&#x43d;&#x438;&#x44f;.</li>
      </ul>
    
    
<p>&#x414;&#x43b;&#x44f; &#x433;&#x435;&#x43d;&#x435;&#x440;&#x430;&#x446;&#x438;&#x438; &#x412;&#x415;&#x411;-&#x418;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x430; &#x43e;&#x43f;&#x442;&#x438;&#x43c;&#x430;&#x43b;&#x44c;&#x43d;&#x44b;&#x43c; &#x438; &#x431;&#x435;&#x437;&#x43e;&#x43f;&#x430;&#x441;&#x43d;&#x44b;&#x43c; &#x441;&#x43f;&#x43e;&#x441;&#x43e;&#x431;&#x43e;&#x43c; HTML5+ (&#x438;&#x43b;&#x438; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43d;&#x438;&#x435;) &#x434;&#x43e;&#x43b;&#x436;&#x43d;&#x43e; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x442;&#x44c; &#x431;&#x435;&#x437; JS. &#x414;&#x43e;&#x43b;&#x436;&#x435;&#x43d; &#x431;&#x44b;&#x442;&#x44c; &#x43e;&#x433;&#x440;&#x430;&#x43d;&#x438;&#x447;&#x435;&#x43d;&#x43d;&#x44b;&#x439;, &#x441;&#x442;&#x440;&#x43e;&#x433;&#x43e;-&#x442;&#x438;&#x43f;&#x438;&#x437;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x43d;&#x44b;&#x439;, &#x443;&#x437;&#x43a;&#x43e;-&#x444;&#x443;&#x43d;&#x43a;&#x446;&#x438;&#x43e;&#x43d;&#x430;&#x43b;&#x44c;&#x43d;&#x44b;&#x439; &#x44f;&#x437;&#x44b;&#x43a;.
      &#x41d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;, &#x438;&#x437;&#x43c;&#x435;&#x43d;&#x435;&#x43d;&#x438;&#x435; &#x447;&#x438;&#x441;&#x43b;&#x43e;&#x432;&#x43e;&#x433;&#x43e; &#x43f;&#x43e;&#x43b;&#x44f; &#x441; &#x438;&#x434;&#x435;&#x43d;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442;&#x43e;&#x440;&#x43e;&#x43c; ID=quantity &#x432;&#x44b;&#x437;&#x43e;&#x432;&#x435;&#x442; &#x43f;&#x440;&#x43e;&#x446;&#x435;&#x434;&#x443;&#x440;&#x443; &quot;calculation: #total=#quantity*#price&quot;, &#x438; &#x43f;&#x43e;&#x43b;&#x44f; &#x432;&#x432;&#x43e;&#x434;&#x430; #total and #price &#x434;&#x43e;&#x43b;&#x436;&#x43d;&#x44b; &#x431;&#x44b;&#x442;&#x44c; &#x447;&#x438;&#x441;&#x43b;&#x43e;&#x432;&#x43e;&#x433;&#x43e; &#x442;&#x438;&#x43f;&#x430;. &#x422;&#x430;&#x43a;&#x436;&#x435; &#x43e;&#x43a;&#x440;&#x443;&#x433;&#x43b;&#x435;&#x43d;&#x438;&#x435; &#x438; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x43d;&#x430;&#x446;&#x438;&#x43e;&#x43d;&#x430;&#x43b;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44e; &#x434;&#x43e;&#x43b;&#x436;&#x435;&#x43d; &#x43e;&#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x43b;&#x44f;&#x442;&#x44c; &#x441;&#x430;&#x43c; HTML5+ (&#x43d;&#x435; JS).
      &#x42f;&#x437;&#x44b;&#x43a; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x434;&#x43e;&#x43b;&#x436;&#x435;&#x43d; &#x438;&#x43c;&#x435;&#x442;&#x44c; &#x441;&#x43f;&#x435;&#x446;&#x438;&#x430;&#x43b;&#x438;&#x437;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x43c;&#x430;&#x43a;&#x440;&#x43e;-&#x43a;&#x43e;&#x43c;&#x430;&#x43d;&#x434;&#x44b; (&#x43e;&#x43f;&#x438;&#x441;&#x430;&#x43d;&#x438;&#x435;) &#x434;&#x43b;&#x44f; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x438;&#x44f; &#x432;&#x438;&#x434;&#x436;&#x435;&#x442;&#x43e;&#x432; &#x43d;&#x430; &#x441;&#x442;&#x43e;&#x440;&#x43e;&#x43d;&#x435; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x430;, &#x438; &#x434;&#x43e;&#x43b;&#x436;&#x435;&#x43d; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x442;&#x44c; &#x431;&#x44b;&#x441;&#x442;&#x440;&#x43e; &#x431;&#x435;&#x437; JIT-&#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x442;&#x43e;&#x440;&#x430;. &#x422;&#x430;&#x43a;-&#x447;&#x442;&#x43e; &#x43e;&#x442;&#x43a;&#x43b;&#x44e;&#x447;&#x435;&#x43d;&#x438;&#x435; JS &#x43d;&#x435; &#x43f;&#x43e;&#x432;&#x43b;&#x438;&#x44f;&#x435;&#x442; &#x43d;&#x430; &#x442;&#x430;&#x43a;&#x438;&#x435; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x44f;.
      &#x415;&#x441;&#x43b;&#x438; &#x432;&#x44b; &#x43f;&#x43e;&#x441;&#x43c;&#x43e;&#x442;&#x440;&#x438;&#x442;&#x435; &#x43d;&#x430; &#x411;&#x435;&#x438;&#x436;-&#x412;&#x415;&#x411; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x44b;&#x439; &#x43a;&#x43e;&#x434;, &#x442;&#x43e; &#x443;&#x432;&#x438;&#x434;&#x438;&#x442;&#x435; &#x447;&#x442;&#x43e; &#x43e;&#x43d; &#x433;&#x43e;&#x442;&#x43e;&#x432; &#x434;&#x43b;&#x44f; &#x442;&#x430;&#x43a;&#x43e;&#x433;&#x43e; HTML5+ (&#x438;&#x43b;&#x438; &#x43f;&#x43b;&#x430;&#x433;&#x438;&#x43d;&#x430;) &#x433;&#x435;&#x43d;&#x435;&#x440;&#x430;&#x446;&#x438;&#x438; &#x43d;&#x430; &#x441;&#x442;&#x43e;&#x440;&#x43e;&#x43d;&#x435; &#x43a;&#x43b;&#x438;&#x435;&#x43d;&#x442;&#x430;, &#x442;.&#x435;. &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x43b;&#x438;&#x448;&#x44c; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x442;&#x44c; &#x43d;&#x43e;&#x432;&#x44b;&#x435; JSP &#x441;&#x442;&#x440;&#x430;&#x43d;&#x438;&#x446;&#x438; &#x433;&#x435;&#x43d;&#x435;&#x440;&#x438;&#x440;&#x443;&#x44e;&#x449;&#x438;&#x435; &#x442;&#x430;&#x43a;&#x43e;&#x438;&#x435; HTML5+ &#x438; JSON &#x43e;&#x442;&#x432;&#x435;&#x442;&#x44b; &#x441; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x43c;&#x438;(&#x431;&#x43e;&#x43b;&#x435;&#x435; &#x43e;&#x43f;&#x442;&#x438;&#x43c;&#x430;&#x43b;&#x435;&#x43d; &#x447;&#x435;&#x43c; XML).
      &#x421;&#x435;&#x440;&#x432;&#x43b;&#x435;&#x442;&#x44b; &#x438; &#x431;&#x438;&#x437;&#x43d;&#x435;&#x441;-&#x441;&#x435;&#x440;&#x432;&#x438;&#x441;&#x44b; &#x43e;&#x441;&#x442;&#x430;&#x43d;&#x443;&#x442;&#x44c;&#x441;&#x44f; &#x442;&#x430;&#x43a;&#x438;&#x43c;&#x438;-&#x436;&#x435;.
    </p>
    
  </div></div>


    </div>
    <div class="clear">
    </div>
    <hr/>
    <div class="footer">
              Copyright &#169;                   2019&#x2013;2021.
           All rights reserved.      
                    
                </div>
  </body>
</html>
