<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!--
Licensed to the Apache Software Foundation (ASF) under one
or more contributor license agreements.  See the NOTICE file
distributed with this work for additional information
regarding copyright ownership.  The ASF licenses this file
to you under the Apache License, Version 2.0 (the
"License"); you may not use this file except in compliance
with the License.  You may obtain a copy of the License at

  http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing,
software distributed under the License is distributed on an
"AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
KIND, either express or implied.  See the License for the
specific language governing permissions and limitations
under the License.
-->

<!-- Generated by Apache Maven Doxia Site Renderer 1.4 at 2021-02-05 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>Beigesoft - 
    Беижсофт™ ПО (библиотеки) для быстрой разработки кросс-платформенного финансового ПО с ВЕБ-интерфейсом.</title>
    <style type="text/css" media="all">
      @import url("./css/bootstrap.min.css");
      @import url("./css/bootstrap-theme.min.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
    <meta name="Date-Revision-yyyymmdd" content="20210205" />
    <meta http-equiv="Content-Language" content="en" />
        
          <link rel="icon" href="images/favicon.png">
  </head>
  <body>
      <img class="logo-right" src="images/logo.png" alt="${project.organization.name} logo">
    <div class="page-header">
      <h1>Beigesoft™ Enterprise Information System Java code. <small>      
                    
                <div class="xleft">
        <span id="publishDate">Last Published: 2021-02-05</span>
                  &nbsp;| <span id="projectVersion">Version: 1.2-SNAPSHOT</span>
                      </div>
      </small></h1>
    </div>
    <div id="leftColumn" class="list-group">
              
                    
                                <h5>Project Documentation</h5>
                  
                                                                                                                                                                                                                                                                        <a href="project-info.html" class="list-group-item"><span class='glyphicon glyphicon-expand' aria-hidden='true'></span>  Project Information</a>
                                                                                                               <a href="project-reports.html" class="list-group-item"><span class='glyphicon glyphicon-expand' aria-hidden='true'></span>  Project Reports</a>
                   
                       <h5>Articles</h5>
                  
                                  <a href="eis-bobs-pizza.html" class="list-group-item">Beigesoft™ EIS, Bob's pizza example</a>
                                     <a href="eis-iv.html" class="list-group-item">Пример ведения коммерческого бухгалтерского учета в Беижсофт™ ИСП</a>
                                     <a href="blcexmplen.html" class="list-group-item">Beigesoft™ libraries for rapid development of cross-platform financial WEB-applications.</a>
                                       <a href="blcexmplru.html" class="list-group-item active disabled">Беижсофт™ библиотеки для быстрой разработки кроссс-платформенного финансового ПО с ВЕБ-интерфейсом</a>
                                     <a href="bslfsc.html" class="list-group-item">Beigesoft™ Linux From Source Code</a>
                                     <a href="bslfscru.html" class="list-group-item">Беижсофт™ Линукс из исходных кодов</a>
                                     <a href="bsplay.html" class="list-group-item">Beigesoft™ multimedia player</a>
                                     <a href="bs-ctsp-in-c.html" class="list-group-item">Type-safe programming complex high-level applications in C.</a>
                                     <a href="pdesign.html" class="list-group-item">Programming approaches.</a>
                                     <a href="data-protect.html" class="list-group-item">Data protection.</a>
             
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                   
                    
          </div>
    <div id="bodyColumn">
        

  

    <div class="section">
<h2>&#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;&#x2122; &#x41f;&#x41e; &#x434;&#x43b;&#x44f; &#x431;&#x44b;&#x441;&#x442;&#x440;&#x43e;&#x439; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43e;&#x442;&#x43a;&#x438; &#x43a;&#x440;&#x43e;&#x441;&#x441;-&#x43f;&#x43b;&#x430;&#x442;&#x444;&#x43e;&#x440;&#x43c;&#x435;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x444;&#x438;&#x43d;&#x430;&#x43d;&#x441;&#x43e;&#x432;&#x43e;&#x433;&#x43e; &#x41f;&#x41e; &#x441; &#x412;&#x415;&#x411;-&#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;&#x43e;&#x43c;.<a name="a_____-____-."></a></h2>

    
<p>* &#x41a;&#x440;&#x43e;&#x441;&#x441;-&#x43f;&#x43b;&#x430;&#x442;&#x444;&#x43e;&#x440;&#x43c;&#x435;&#x43d;&#x43d;&#x43e;&#x435; &#x43e;&#x437;&#x43d;&#x430;&#x447;&#x430;&#x435;&#x442; &#x447;&#x442;&#x43e; &#x432;&#x441;&#x435; &#x447;&#x430;&#x441;&#x442;&#x438; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x44f; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x44e;&#x442; &#x43e;&#x434;&#x43d;&#x43e;&#x432;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x43d;&#x43e; &#x43d;&#x430; &#x43b;&#x44e;&#x431;&#x43e;&#x439; &#x43e;&#x43f;&#x435;&#x440;&#x430;&#x446;&#x438;&#x43e;&#x43d;&#x43d;&#x43e;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x435;. &#x41d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x43b;&#x43e;&#x43a;&#x430;&#x43b;&#x44c;&#x43d;&#x430;&#x44f; (&#x418;&#x43d;&#x442;&#x435;&#x440;&#x43d;&#x435;&#x442;-&#x43d;&#x435;&#x434;&#x43e;&#x441;&#x442;&#x443;&#x43f;&#x43d;&#x430;&#x44f;) &#x432;&#x435;&#x440;&#x441;&#x438;&#x44f; &#x434;&#x43b;&#x44f; &#x410;&#x43d;&#x434;&#x440;&#x43e;&#x438;&#x434;&#x430; &#x432;&#x43a;&#x43b;&#x44e;&#x447;&#x430;&#x435;&#x442; &#x432; &#x441;&#x435;&#x431;&#x44f; &#x438; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440; &#x431;&#x430;&#x437;&#x44b; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x438; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x44f; (&#x412;&#x415;&#x411; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;), &#x412;&#x415;&#x411;-&#x43a;&#x43b;&#x438;&#x435;&#x43d;&#x442; - &#x411;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;-&#x425;&#x440;&#x43e;&#x43c; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x435;&#x442; &#x437;&#x434;&#x435;&#x441;&#x44c; &#x436;&#x435;.</p>

    
<p>&#x414;&#x430;&#x43d;&#x43d;&#x430;&#x44f; &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x430;&#x446;&#x438;&#x44f; &#x43f;&#x440;&#x435;&#x434;&#x43d;&#x430;&#x437;&#x43d;&#x430;&#x447;&#x435;&#x43d;&#x430; &#x434;&#x43b;&#x44f; &#x448;&#x438;&#x440;&#x43e;&#x43a;&#x43e;&#x439; &#x430;&#x443;&#x434;&#x438;&#x442;&#x43e;&#x440;&#x438;&#x438;. &#x41d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x43c;&#x430;&#x442;&#x435;&#x440;&#x438;&#x430;&#x43b; &#x440;&#x430;&#x441;&#x441;&#x447;&#x438;&#x442;&#x430;&#x43d; &#x438; &#x434;&#x43b;&#x44f; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x438;&#x441;&#x442;&#x43e;&#x432; &#x43a;&#x442;&#x43e; &#x440;&#x430;&#x43d;&#x435;&#x435; &#x43d;&#x435; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43b; &#x414;&#x436;&#x430;&#x432;&#x443;, &#x438; &#x434;&#x43b;&#x44f; &#x442;&#x435;&#x445; &#x43a;&#x442;&#x43e; &#x445;&#x43e;&#x447;&#x435;&#x442; &#x43e;&#x446;&#x435;&#x43d;&#x438;&#x442;&#x44c; &#x442;&#x440;&#x443;&#x434;&#x43e;&#x435;&#x43c;&#x43a;&#x43e;&#x441;&#x442;&#x44c; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; (&#x438;&#x437;&#x43c;&#x435;&#x43d;&#x435;&#x43d;&#x438;&#x44f;, &#x434;&#x43e;&#x43f;&#x43e;&#x43b;&#x43d;&#x435;&#x43d;&#x438;&#x44f;) &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442; &#x418;&#x421;&#x41f;.</p>
    
<p>&#x412; &#x43d;&#x430;&#x447;&#x430;&#x43b;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x44c;&#x441;&#x44f; &#x43b;&#x435;&#x433;&#x43a;&#x430;&#x44f;, &#x43d;&#x435; &#x442;&#x440;&#x435;&#x431;&#x443;&#x44e;&#x449;&#x430;&#x44f; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43a;&#x438; &#x421;&#x41a;&#x41b;&#x430;&#x439;&#x442; (SQLite) &#x431;&#x430;&#x437;&#x430; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445;. &#x412; &#x43a;&#x43e;&#x43d;&#x446;&#x435; &#x43c;&#x44b; &#x441;&#x43a;&#x43e;&#x43f;&#x438;&#x440;&#x443;&#x435;&#x43c; &#x432;&#x441;&#x435; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x438;&#x437; &#x43b;&#x43e;&#x43a;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x439; &#x421;&#x41a;&#x41b;&#x430;&#x439;&#x442; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x432; &#x43e;&#x431;&#x43b;&#x430;&#x447;&#x43d;&#x443;&#x44e;, &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x44e;&#x449;&#x443;&#x44e; &#x43d;&#x430; &#x41f;&#x43e;&#x441;&#x442;&#x433;&#x440;&#x435;&#x441; (Postgres) &#x438;&#x43b;&#x438; &#x41c;&#x430;&#x439;&#x42d;&#x441;&#x41a;&#x443;&#x42d;&#x43b; (MySQL).
      &#x422;&#x430;&#x43a;&#x436;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43f;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43d;&#x430; &#x438;&#x43d;&#x444;&#x43e;&#x440;&#x43c;&#x430;&#x446;&#x438;&#x44f; &#x43f;&#x43e; &#x437;&#x430;&#x449;&#x438;&#x442;&#x435; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445;, &#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x430; &#x446;&#x438;&#x444;&#x440;&#x43e;&#x432;&#x43e;&#x439; &#x43f;&#x43e;&#x434;&#x43f;&#x438;&#x441;&#x438; &#x444;&#x430;&#x439;&#x43b;&#x430;.
    </p>

    
<div class="section">
<div class="section">
<h4>&#x421;&#x442;&#x430;&#x442;&#x44c;&#x438;:<a name="a:"></a></h4>      
    
    
<div class="section">
<h5>
      <a href="bclwhyru.html">&#x41f;&#x440;&#x435;&#x438;&#x43c;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x43e;&#x431;&#x435;&#x441;&#x43f;&#x435;&#x447;&#x435;&#x43d;&#x438;&#x44f; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;.</a>
    <a name="a____."></a></h5>
    
    </div>
<div class="section">
<h5>
      <a href="bclbasicru.html">&#x411;&#x430;&#x437;&#x43e;&#x432;&#x430;&#x44f; &#x438;&#x43d;&#x444;&#x43e;&#x440;&#x43c;&#x430;&#x446;&#x438;&#x44f; &#x43e; &#x41f;&#x41e; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;.</a>
    <a name="a____."></a></h5>
    
    </div>
<div class="section">
<h5>
      <a href="bclprogrenvru.html">&#x423;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43a;&#x430; &#x441;&#x440;&#x435;&#x434;&#x44b; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f;.</a>
    <a name="a__."></a></h5>

    
<p>* &#x410;&#x440;&#x445;&#x438;&#x432; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x44b;&#x445; &#x43a;&#x43e;&#x434;&#x43e;&#x432; &#x441;&#x43b;&#x435;&#x434;&#x443;&#x44e;&#x449;&#x435;&#x433;&#x43e; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x44f; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x438;&#x442;&#x44c; &#x438;&#x437; https://sourceforge.net/projects/beige-accounting/files/EIS1.0/</p>

    </div>
<div class="section">
<h5>
      <a href="bclrapidru1.html">&#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x43f;&#x440;&#x43e;&#x441;&#x442;&#x43e;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b; &#x437;&#x430;&#x43a;&#x430;&#x437;&#x430; &#x442;&#x43e;&#x432;&#x430;&#x440;&#x430;. &#x427;&#x430;&#x441;&#x442;&#x44c; 1, &#x431;&#x430;&#x437;&#x43e;&#x432;&#x430;&#x44f; &#x431;&#x438;&#x437;&#x43d;&#x435;&#x441; &#x43b;&#x43e;&#x433;&#x438;&#x43a;&#x430;.</a>
    <a name="a____.__1___."></a></h5>
    
    </div>
<div class="section">
<h5>
      <a href="bclrapidru2.html">&#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x43f;&#x440;&#x43e;&#x441;&#x442;&#x43e;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b; &#x437;&#x430;&#x43a;&#x430;&#x437;&#x430; &#x442;&#x43e;&#x432;&#x430;&#x440;&#x430;. &#x427;&#x430;&#x441;&#x442;&#x44c; 2, &#x43e;&#x431;&#x43b;&#x430;&#x447;&#x43d;&#x430;&#x44f; WAR &#x432;&#x435;&#x440;&#x441;&#x438;&#x44f;.</a>
    <a name="a____.__2__WAR_."></a></h5>

    </div></div></div></div>

  


    </div>
    <div class="clear">
    </div>
    <hr/>
    <div class="footer">
              Copyright &#169;                   2019&#x2013;2021.
           All rights reserved.      
                    
                </div>
  </body>
</html>
