<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!--
Licensed to the Apache Software Foundation (ASF) under one
or more contributor license agreements.  See the NOTICE file
distributed with this work for additional information
regarding copyright ownership.  The ASF licenses this file
to you under the Apache License, Version 2.0 (the
"License"); you may not use this file except in compliance
with the License.  You may obtain a copy of the License at

  http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing,
software distributed under the License is distributed on an
"AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
KIND, either express or implied.  See the License for the
specific language governing permissions and limitations
under the License.
-->

<!-- Generated by Apache Maven Doxia Site Renderer 1.4 at 2021-02-05 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>Beigesoft - 
    Беижсофт™ Линукс из исходных кодов (ЛИИК).</title>
    <style type="text/css" media="all">
      @import url("./css/bootstrap.min.css");
      @import url("./css/bootstrap-theme.min.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
    <meta name="Date-Revision-yyyymmdd" content="20210205" />
    <meta http-equiv="Content-Language" content="en" />
        
          <link rel="icon" href="images/favicon.png">
  </head>
  <body>
      <img class="logo-right" src="images/logo.png" alt="${project.organization.name} logo">
    <div class="page-header">
      <h1>Beigesoft™ Enterprise Information System Java code. <small>      
                    
                <div class="xleft">
        <span id="publishDate">Last Published: 2021-02-05</span>
                  &nbsp;| <span id="projectVersion">Version: 1.2-SNAPSHOT</span>
                      </div>
      </small></h1>
    </div>
    <div id="leftColumn" class="list-group">
              
                    
                                <h5>Project Documentation</h5>
                  
                                                                                                                                                                                                                                                                        <a href="project-info.html" class="list-group-item"><span class='glyphicon glyphicon-expand' aria-hidden='true'></span>  Project Information</a>
                                                                                                               <a href="project-reports.html" class="list-group-item"><span class='glyphicon glyphicon-expand' aria-hidden='true'></span>  Project Reports</a>
                   
                       <h5>Articles</h5>
                  
                                  <a href="eis-bobs-pizza.html" class="list-group-item">Beigesoft™ EIS, Bob's pizza example</a>
                                     <a href="eis-iv.html" class="list-group-item">Пример ведения коммерческого бухгалтерского учета в Беижсофт™ ИСП</a>
                                     <a href="blcexmplen.html" class="list-group-item">Beigesoft™ libraries for rapid development of cross-platform financial WEB-applications.</a>
                                     <a href="blcexmplru.html" class="list-group-item">Беижсофт™ библиотеки для быстрой разработки кроссс-платформенного финансового ПО с ВЕБ-интерфейсом</a>
                                     <a href="bslfsc.html" class="list-group-item">Beigesoft™ Linux From Source Code</a>
                                       <a href="bslfscru.html" class="list-group-item active disabled">Беижсофт™ Линукс из исходных кодов</a>
                                     <a href="bsplay.html" class="list-group-item">Beigesoft™ multimedia player</a>
                                     <a href="bs-ctsp-in-c.html" class="list-group-item">Type-safe programming complex high-level applications in C.</a>
                                     <a href="pdesign.html" class="list-group-item">Programming approaches.</a>
                                     <a href="data-protect.html" class="list-group-item">Data protection.</a>
             
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                   
                    
          </div>
    <div id="bodyColumn">
        

  

    <div class="section">
<h3>&#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;&#x2122; &#x41b;&#x438;&#x43d;&#x443;&#x43a;&#x441; &#x438;&#x437; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x44b;&#x445; &#x43a;&#x43e;&#x434;&#x43e;&#x432; (&#x41b;&#x418;&#x418;&#x41a;).<a name="a_____."></a></h3>
    
    
<div class="section">
<h4>&#x417;&#x430;&#x447;&#x435;&#x43c; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x438;&#x437; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x44b;&#x445; &#x43a;&#x43e;&#x434;&#x43e;&#x432;?<a name="a____"></a></h4>

<p>
&#x41f;&#x440;&#x430;&#x43a;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438; &#x432;&#x441;&#x435; &#x41b;&#x438;&#x43d;&#x443;&#x43a;&#x441; &#x434;&#x438;&#x441;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x438;&#x432;&#x44b; &#x434;&#x43e;&#x441;&#x442;&#x443;&#x43f;&#x43d;&#x44b; &#x432; &#x431;&#x438;&#x43d;&#x430;&#x440;&#x43d;&#x43e;&#x43c; &#x432;&#x438;&#x434;&#x435;.
&#x41c;&#x43d;&#x43e;&#x433;&#x438;&#x435; &#x43f;&#x43e;&#x441;&#x442;&#x430;&#x432;&#x449;&#x438;&#x43a;&#x438; &#x43f;&#x435;&#x440;&#x435;&#x441;&#x442;&#x430;&#x43b;&#x438; &#x43f;&#x43e;&#x434;&#x434;&#x435;&#x440;&#x436;&#x438;&#x432;&#x430;&#x442;&#x44c; 32&#x440;&#x430;&#x437;&#x440;&#x44f;&#x434;&#x43d;&#x44b;&#x435; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438;. &#x418;&#x43d;&#x43e;&#x433;&#x434;&#x430; &#x43f;&#x43e;&#x441;&#x43b;&#x435; &#x43e;&#x431;&#x43d;&#x43e;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x439; &#x432;&#x43e;&#x437;&#x43d;&#x438;&#x43a;&#x430;&#x44e;&#x442; &#x43f;&#x440;&#x43e;&#x431;&#x43b;&#x435;&#x43c;&#x44b;.
&#x412; &#x43e;&#x431;&#x449;&#x435;&#x43c; &#x43f;&#x435;&#x440;&#x432;&#x430;&#x44f; &#x43f;&#x440;&#x438;&#x447;&#x438;&#x43d;&#x430; - &#x44d;&#x442;&#x43e; &#x438;&#x43c;&#x435;&#x442;&#x44c; &#x441;&#x442;&#x430;&#x431;&#x438;&#x43b;&#x44c;&#x43d;&#x44b;&#x439;, &#x43d;&#x435;&#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43c;&#x44b;&#x439; &#x41b;&#x438;&#x43d;&#x443;&#x43a;&#x441; &quot;&#x441;&#x43e;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x43f;&#x440;&#x43e;&#x438;&#x437;&#x432;&#x43e;&#x434;&#x441;&#x442;&#x432;&#x430;&quot;.
</p>

</div>
<div class="section">
<h4>&#x41a;&#x430;&#x43a;&#x438;&#x435; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x44b; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x438; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x44e;&#x442;?<a name="a___"></a></h4>

<p>
  &#x41f;&#x435;&#x440;&#x432;&#x44b;&#x439; - &#x44d;&#x442;&#x43e; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x44f; &#x434;&#x43b;&#x44f; &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x43a;&#x43e;&#x43c;&#x43f;&#x44c;&#x44e;&#x442;&#x435;&#x440;&#x430; &#x438; &#x43e;&#x43f;&#x435;&#x440;&#x430;&#x446;&#x438;&#x43e;&#x43d;&#x43d;&#x43e;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b;. &#x412;&#x44b; &#x43c;&#x43e;&#x436;&#x435;&#x442;&#x435; &#x441;&#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x442;&#x430;&#x43a;&#x438;&#x43c; &#x43e;&#x431;&#x440;&#x430;&#x437;&#x43e;&#x43c; &#x43b;&#x44e;&#x431;&#x43e;&#x435; &#x432;&#x44b;&#x441;&#x43e;&#x43a;&#x43e;&#x443;&#x440;&#x43e;&#x432;&#x43d;&#x435;&#x432;&#x43e;&#x435; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x435;, &#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x43c;&#x443;&#x437;&#x44b;&#x43a;&#x430;&#x43b;&#x44c;&#x43d;&#x44b;&#x439; &#x43f;&#x440;&#x43e;&#x438;&#x433;&#x440;&#x44b;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44c;.
  &#x414;&#x43b;&#x44f; &#x44d;&#x442;&#x43e;&#x433;&#x43e; &#x43d;&#x443;&#x436;&#x43d;&#x430; &#x43c;&#x438;&#x43d;&#x438;&#x43c;&#x430;&#x43b;&#x44c;&#x43d;&#x430;&#x44f; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x438;&#x440;&#x443;&#x44e;&#x449;&#x430;&#x44f; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x430;. &#x42d;&#x442;&#x43e; &#x43c;&#x438;&#x43d;&#x438;&#x43c;&#x443;&#x43c; &#x431;&#x438;&#x431;&#x43b;&#x438;&#x43e;&#x442;&#x435;&#x43a; &#x438; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c; - glibc, gcc, binutils, bash...
  &#x414;&#x43b;&#x44f; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x43d;&#x438;&#x44f; &#x44d;&#x442;&#x43e;&#x439; &#x43c;&#x438;&#x43d;&#x438;&#x43c;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x439; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x438;&#x440;&#x443;&#x44e;&#x449;&#x435;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b; &#x438;&#x437; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x44b;&#x445; &#x43a;&#x43e;&#x434;&#x43e;&#x432; &#x43d;&#x443;&#x436;&#x43d;&#x430; &#x43a;&#x440;&#x43e;&#x441;&#x441;-&#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x44f;.
</p>

<p>
  &#x412;&#x442;&#x43e;&#x440;&#x43e;&#x439; &#x43c;&#x435;&#x442;&#x43e;&#x434; &#x44d;&#x442;&#x43e; &#x43a;&#x440;&#x43e;&#x441;&#x441;-&#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x44f;. &#x42d;&#x442;&#x43e; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x438; &#x438;&#x43d;&#x441;&#x442;&#x430;&#x43b;&#x43b;&#x44f;&#x446;&#x438;&#x44f; &#x432; &#x434;&#x440;&#x443;&#x433;&#x43e;&#x439; &#x43a;&#x43e;&#x440;&#x435;&#x43d;&#x44c; (&#x43e;&#x442;&#x43b;&#x438;&#x447;&#x43d;&#x44b;&#x439; &#x43e;&#x442; &#x442;&#x435;&#x43a;&#x443;&#x449;&#x435;&#x433;&#x43e; /), &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x44f; &#x432;&#x43e;&#x437;&#x43c;&#x43e;&#x436;&#x43d;&#x430; &#x434;&#x43b;&#x44f; &#x43e;&#x442;&#x43b;&#x438;&#x447;&#x43d;&#x43e;&#x439; &#x43e;&#x442; &#x442;&#x435;&#x43a;&#x443;&#x449;&#x435;&#x439; &#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43a;&#x442;&#x443;&#x440;&#x44b;, &#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x44f; &#x434;&#x43b;&#x44f; ARM (&#x43f;&#x43b;&#x430;&#x43d;&#x448;&#x435;&#x442;&#x430;) &#x43d;&#x430; &#x43e;&#x431;&#x44b;&#x447;&#x43d;&#x43e;&#x43c; &#x43a;&#x43e;&#x43c;&#x43f;&#x44c;&#x44e;&#x442;&#x435;&#x440;&#x435; x86.
  &#x415;&#x441;&#x442;&#x44c; &#x447;&#x435;&#x442;&#x44b;&#x440;&#x435; &#x441;&#x442;&#x430;&#x43d;&#x434;&#x430;&#x440;&#x442;&#x43d;&#x44b;&#x435; &#x43f;&#x435;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x43d;&#x44b;&#x435; &#x434;&#x43b;&#x44f; &#x44d;&#x442;&#x43e;&#x433;&#x43e;:
  </p>
<ul>
    
<li>--sysroot - &#x433;&#x43e;&#x432;&#x43e;&#x440;&#x438;&#x442; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x442;&#x43e;&#x440;&#x443; &#x433;&#x434;&#x435; &#x438;&#x441;&#x43a;&#x430;&#x442;&#x44c; &#x437;&#x430;&#x433;&#x43e;&#x43b;&#x43e;&#x432;&#x43a;&#x438;, &#x430; &#x43b;&#x438;&#x43d;&#x43a;&#x43e;&#x432;&#x449;&#x438;&#x43a;&#x443; &#x433;&#x434;&#x435; &#x438;&#x441;&#x43a;&#x430;&#x442;&#x44c; &#x431;&#x438;&#x431;&#x43b;&#x438;&#x43e;&#x442;&#x435;&#x43a;&#x438; (&#x433;&#x434;&#x435; &#x43d;&#x43e;&#x432;&#x44b;&#x439; &#x43a;&#x43e;&#x440;&#x435;&#x43d;&#x44c;)</li>
    
<li>DESTDIR - &#x433;&#x43e;&#x432;&#x43e;&#x440;&#x438;&#x442; &quot;make&quot; &#x433;&#x434;&#x435; &#x43d;&#x43e;&#x432;&#x430;&#x44f; &#x43a;&#x43e;&#x440;&#x43d;&#x435;&#x432;&#x430;&#x44f; &#x434;&#x438;&#x440;&#x435;&#x43a;&#x442;&#x43e;&#x440;&#x438;&#x44f; &#x434;&#x43b;&#x44f; &#x438;&#x43d;&#x441;&#x442;&#x430;&#x43b;&#x43b;&#x44f;&#x446;&#x438;&#x438;</li>
    
<li>--host - &#x433;&#x43e;&#x432;&#x43e;&#x440;&#x438;&#x442; &quot;configure&quot; &#x43a;&#x430;&#x43a;&#x430;&#x44f; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x438;&#x440;&#x443;&#x435;&#x43c;&#x430;&#x439; &#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43a;&#x442;&#x443;&#x440;&#x430;</li>
    
<li>--build - &#x433;&#x43e;&#x432;&#x43e;&#x440;&#x438;&#x442; &quot;configure&quot; &#x43a;&#x430;&#x43a;&#x430;&#x44f; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x438;&#x440;&#x443;&#x44e;&#x449;&#x430;&#x44f; &#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43a;&#x442;&#x443;&#x440;&#x430;, &#x431;&#x435;&#x437; &#x44d;&#x442;&#x43e;&#x439; &#x43f;&#x435;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x43d;&#x43e;&#x439; &quot;configure&quot; &#x431;&#x443;&#x434;&#x435;&#x442; &#x441;&#x447;&#x438;&#x442;&#x430;&#x442;&#x44c; &#x447;&#x442;&#x43e; &#x44d;&#x442;&#x43e; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x44f; &#x434;&#x43b;&#x44f; &#x442;&#x435;&#x43a;&#x443;&#x449;&#x435;&#x439; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b; &#x430; &quot;host&quot; &#x43b;&#x438;&#x448;&#x44c; &#x443;&#x442;&#x43e;&#x447;&#x43d;&#x44f;&#x435;&#x442; &#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43a;&#x442;&#x443;&#x440;&#x443;, &#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; i586-sse2</li>
  </ul>
  &#x41f;&#x435;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x43d;&#x443;&#x44e; &quot;--target&quot; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44e;&#x442; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x434;&#x43b;&#x44f; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x438; &#x43a;&#x440;&#x43e;&#x441;&#x441;-&#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x438;&#x440;&#x443;&#x44e;&#x449;&#x435;&#x433;&#x43e; &#x41f;&#x41e; (gcc, binutils).


<p>&#x415;&#x441;&#x442;&#x44c; &#x442;&#x430;&#x43a;&#x436;&#x435; CHROOT &#x43c;&#x435;&#x442;&#x43e;&#x434;, LFS &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x442; &#x435;&#x433;&#x43e;.</p>


<p>&#x413;&#x43b;&#x430;&#x432;&#x43d;&#x430;&#x44f; &#x43f;&#x440;&#x43e;&#x431;&#x43b;&#x435;&#x43c;&#x430; &#x432; &#x442;&#x43e;&#x43c;, &#x447;&#x442;&#x43e; &#x434;&#x430;&#x436;&#x435; &#x43d;&#x438;&#x437;&#x43a;&#x43e; &#x443;&#x440;&#x43e;&#x432;&#x43d;&#x435;&#x432;&#x43e;&#x435; &#x41f;&#x41e; &#x43d;&#x435; &#x441;&#x43e;&#x431;&#x43b;&#x44e;&#x434;&#x430;&#x435;&#x442; &#x441;&#x442;&#x430;&#x43d;&#x434;&#x430;&#x440;&#x442;&#x44b; &#x43a;&#x440;&#x43e;&#x441;&#x441;-&#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x438; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x43e;&#x43c; &quot;--sysroot&quot;.
&#x422;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x442;&#x43e;&#x440;&#x44b; &#x43f;&#x440;&#x430;&#x432;&#x438;&#x43b;&#x44c;&#x43d;&#x43e; &#x442;&#x440;&#x430;&#x43a;&#x442;&#x443;&#x44e;&#x442; &#x434;&#x430;&#x43d;&#x43d;&#x443;&#x44e; &#x43f;&#x435;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x43d;&#x443;&#x44e;, &#x442;.&#x435;. &#x438;&#x449;&#x443;&#x442; &#x437;&#x430;&#x433;&#x43e;&#x43b;&#x43e;&#x432;&#x43a;&#x438; &#x432; &quot;&#x446;&#x435;&#x43b;&#x435;&#x432;&#x43e;&#x43c; &#x43a;&#x43e;&#x440;&#x43d;&#x435;&quot;.
&#x41b;&#x438;&#x43d;&#x43a;&#x43e;&#x432;&#x449;&#x438;&#x43a; &#x442;&#x440;&#x430;&#x43a;&#x442;&#x443;&#x435;&#x442; &quot;&#x446;&#x435;&#x43b;&#x435;&#x432;&#x43e;&#x439; &#x43a;&#x43e;&#x440;&#x435;&#x43d;&#x44c;&quot; &#x43a;&#x430;&#x43a; &quot;&#x434;&#x43e;&#x43f;&#x43e;&#x43b;&#x43d;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x44b;&#x439;&quot;.
&#x41a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x438;&#x440;&#x443;&#x435;&#x43c;&#x43e;&#x435; &#x41f;&#x41e; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x437;&#x430;&#x43f;&#x443;&#x441;&#x43a;&#x430;&#x442;&#x44c; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e;-&#x447;&#x442;&#x43e; &#x441;&#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x44b; &#x434;&#x43b;&#x44f; &#x441;&#x430;&#x43c;&#x43e;&#x438;&#x43d;&#x441;&#x442;&#x430;&#x43b;&#x43b;&#x44f;&#x446;&#x438;&#x438;, &#x442;&#x43e; &#x435;&#x441;&#x442;&#x44c; &#x44d;&#x442;&#x43e; &#x43d;&#x435; &#x43f;&#x440;&#x43e;&#x439;&#x434;&#x435;&#x442; &#x435;&#x441;&#x43b;&#x438; &#x446;&#x435;&#x43b;&#x435;&#x432;&#x43e;&#x439; &#x43f;&#x440;&#x43e;&#x446;&#x435;&#x441;&#x441;&#x43e;&#x440; &#x434;&#x440;&#x443;&#x433;&#x43e;&#x433;&#x43e; &#x442;&#x438;&#x43f;&#x430;.
&#x414;&#x430;&#x436;&#x435; &#x441; CHROOT &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x43e;&#x43c; &#x43f;&#x440;&#x43e;&#x438;&#x441;&#x445;&#x43e;&#x434;&#x44f;&#x442; &#x43f;&#x43e;&#x434;&#x43e;&#x431;&#x43d;&#x44b;&#x435; &#x43f;&#x440;&#x43e;&#x431;&#x43b;&#x435;&#x43c;&#x44b;, &#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &quot;coreutils&quot;: error help2man: can't get `--help' info from man/dir.td/dir.
&#x41f;&#x43e;&#x445;&#x43e;&#x436;&#x435;, &#x447;&#x442;&#x43e; &#x43f;&#x440;&#x43e;&#x431;&#x43b;&#x435;&#x43c;&#x430; &#x432; &#x441;&#x43f;&#x443;&#x442;&#x44b;&#x432;&#x430;&#x43d;&#x438;&#x438; &#x442;&#x435;&#x43a;&#x443;&#x449;&#x438;&#x445; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x43d;&#x44b;&#x445; &#x438; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x438;&#x440;&#x443;&#x435;&#x43c;&#x44b;&#x445; &#x431;&#x438;&#x431;&#x43b;&#x438;&#x43e;&#x442;&#x435;&#x43a; &#x438; &#x43d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x435;&#x43a;.
&#x422;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x43f;&#x440;&#x43e;&#x431;&#x43b;&#x435;&#x43c;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x43d;&#x43e; &#x43f;&#x440;&#x438; &#x43a;&#x440;&#x43e;&#x441;&#x441;-&#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x438; &#x434;&#x43b;&#x44f; &#x43e;&#x431;&#x44b;&#x447;&#x43d;&#x43e;&#x433;&#x43e; &#x43a;&#x43e;&#x43c;&#x43f;&#x44c;&#x44e;&#x442;&#x435;&#x440;&#x430;.
&#x41a;&#x43e;&#x43d;&#x435;&#x447;&#x43d;&#x43e;-&#x436;&#x435; &#x441;&#x43f;&#x435;&#x446;&#x438;&#x430;&#x43b;&#x438;&#x437;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x438;&#x440;&#x443;&#x44e;&#x449;&#x438;&#x435; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x44b; &#x434;&#x43b;&#x44f; &#x43f;&#x43b;&#x430;&#x43d;&#x448;&#x435;&#x442;&#x43d;&#x44b;&#x445; &#x41e;&#x421; &#x440;&#x435;&#x448;&#x430;&#x44e;&#x442; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x43f;&#x440;&#x43e;&#x431;&#x43b;&#x435;&#x43c;&#x44b;.
</p>


<p>
  &#x41a;&#x43b;&#x430;&#x441;&#x441;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x430;&#x44f; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x44f; &#x434;&#x43b;&#x44f; &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x43a;&#x43e;&#x43c;&#x44c;&#x44e;&#x442;&#x435;&#x440;&#x430; &#x43f;&#x43e;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43c;&#x435;&#x432;&#x430;&#x435;&#x442; &#x447;&#x442;&#x43e; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x438;&#x43d;&#x441;&#x442;&#x432;&#x43e; &#x41f;&#x41e; &#x443;&#x436;&#x435; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43b;&#x435;&#x43d;&#x43e;. &#x418;&#x43d;&#x441;&#x442;&#x430;&#x43b;&#x43b;&#x438;&#x440;&#x443;&#x435;&#x43c;&#x43e;&#x435; &#x41f;&#x41e; &#x447;&#x430;&#x441;&#x442;&#x43e; &#x438;&#x43c;&#x435;&#x435;&#x442; &#x434;&#x435;&#x43b;&#x43e; &#x441; &#x434;&#x440;&#x443;&#x433;&#x438;&#x43c; &#x41f;&#x41e; &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x43e;&#x435; &#x442;&#x43e;&#x436;&#x435; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x442; &#x43e;&#x442; &#x43f;&#x435;&#x440;&#x432;&#x43e;&#x433;&#x43e; (&#x432;&#x437;&#x430;&#x438;&#x43c;&#x43e;-&#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x44c;).
  &#x414;&#x430;&#x436;&#x435; &#x431;&#x430;&#x437;&#x43e;&#x432;&#x430;&#x44f; &#x431;&#x438;&#x431;&#x43b;&#x438;&#x43e;&#x442;&#x435;&#x43a;&#x430; GLIBC &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442; SELINUX &#x434;&#x43b;&#x44f; &#x43f;&#x43e;&#x434;&#x434;&#x435;&#x440;&#x436;&#x43a;&#x438; &#x43f;&#x43e;&#x441;&#x43b;&#x435;&#x434;&#x43d;&#x435;&#x439; (&#x441;&#x430;&#x43c;&#x430; GLIBC &#x43d;&#x438;&#x43a;&#x43e;&#x433;&#x434;&#x430; &#x43d;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x441;&#x432;&#x44f;&#x437;&#x430;&#x43d;&#x430; &#x43b;&#x438;&#x43d;&#x43a;&#x43e;&#x432;&#x449;&#x438;&#x43a;&#x43e;&#x43c; &#x441; libselinux), &#x442;&#x43e; &#x435;&#x441;&#x442;&#x44c; &#x43d;&#x435;&#x43e;&#x431;&#x445;&#x43e;&#x434;&#x438;&#x43c;&#x430; &#x43f;&#x43e;&#x432;&#x442;&#x43e;&#x440;&#x43d;&#x430;&#x44f; &#x438;&#x43d;&#x441;&#x442;&#x430;&#x43b;&#x43b;&#x44f;&#x446;&#x438;&#x44f; &#x41f;&#x41e; &#x441; &#x432;&#x437;&#x430;&#x438;&#x43c;&#x43e;-&#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x44f;&#x43c;&#x438;.
  &#x42d;&#x442;&#x438; &#x434;&#x432;&#x430; &#x444;&#x430;&#x43a;&#x442;&#x430; - &quot;&#x43f;&#x43e;&#x432;&#x442;&#x43e;&#x440;&#x43d;&#x43e;&#x435; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x432;&#x432;&#x438;&#x434;&#x443; &#x432;&#x437;&#x430;&#x438;&#x43c;&#x43e;-&#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x435;&#x439;&quot; &#x438; &quot;&#x43f;&#x440;&#x43e;&#x431;&#x43b;&#x435;&#x43c;&#x430; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x43f;&#x440;&#x438; &#x43a;&#x440;&#x43e;&#x441;&#x441;-&#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x438;&quot; &#x432;&#x435;&#x434;&#x435;&#x442; &#x43a; &#x43f;&#x440;&#x430;&#x432;&#x438;&#x43b;&#x44c;&#x43d;&#x43e;&#x43c;&#x443; &#x43f;&#x443;&#x442;&#x438; &#x43a; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x438; &#x41b;&#x418;&#x418;&#x41a;:
  </p>
<ol style="list-style-type: decimal">
    
<li>&#x43a;&#x440;&#x43e;&#x441;&#x441;-&#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x44f; &#x432;&#x441;&#x435;&#x433;&#x43e; &#x41f;&#x41e; (&#x432;&#x43a;&#x43b;&#x44e;&#x447;&#x430;&#x44f; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x438;&#x440;&#x443;&#x44e;&#x449;&#x435;&#x435; - gcc, binutils, make, ...), &#x43d;&#x430; &#x44d;&#x442;&#x43e;&#x43c; &#x448;&#x430;&#x433;&#x435; &#x43f;&#x43e;&#x43b;&#x443;&#x447;&#x430;&#x435;&#x43c; &#x441;&#x44b;&#x440;&#x43e;&#x439; &#x41b;&#x418;&#x418;&#x41a;</li>
    
<li>&#x43f;&#x43e;&#x432;&#x442;&#x43e;&#x440;&#x43d;&#x430;&#x44f; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x44f; &#x434;&#x43b;&#x44f; &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x43a;&#x43e;&#x43c;&#x43f;&#x44c;&#x44e;&#x442;&#x435;&#x440;&#x430; (&#x432;&#x43a;&#x43b;&#x44e;&#x447;&#x430;&#x44f; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x438; &#x432;&#x437;&#x430;&#x438;&#x43c;&#x43e;-&#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x438;) &#x43d;&#x430; &#x437;&#x430;&#x433;&#x440;&#x443;&#x436;&#x435;&#x43d;&#x43d;&#x43e;&#x43c; &#x441;&#x44b;&#x440;&#x43e;&#x43c; &#x41b;&#x418;&#x418;&#x41a;</li>
  </ol>
  &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;&#x2122; &#x41b;&#x438;&#x43d;&#x443;&#x43a;&#x441; &#x438;&#x437; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x44b;&#x445; &#x43a;&#x43e;&#x434;&#x43e;&#x432; &#x43d;&#x430;&#x447;&#x438;&#x43d;&#x430;&#x44f; &#x441; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; 1.5 &#x434;&#x435;&#x43b;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x43e;&#x43c; &#x447;&#x438;&#x441;&#x442;&#x43e;&#x439; &#x43a;&#x440;&#x43e;&#x441;&#x441;-&#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x438; (&#x431;&#x435;&#x437; chroot), &#x437;&#x430;&#x442;&#x435;&#x43c; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x43e;&#x43c; &#x43e;&#x431;&#x44b;&#x447;&#x43d;&#x43e;&#x439; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x438;.



<p>
  &#x412;&#x432;&#x438;&#x434;&#x443; &#x441;&#x43b;&#x43e;&#x436;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x43a;&#x440;&#x43e;&#x441;&#x441;-&#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x438; &#x43d;&#x430;&#x447;&#x438;&#x43d;&#x430;&#x44f; &#x441; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; 1.6 &#x41b;&#x418;&#x418;&#x41a; &#x434;&#x435;&#x43b;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x441;&#x43b;&#x435;&#x434;&#x443;&#x44e;&#x449;&#x438;&#x43c; &#x441;&#x43f;&#x43e;&#x441;&#x43e;&#x431;&#x43e;&#x43c;:
  </p>
<ol style="list-style-type: decimal">
    
<li>&#x43a;&#x440;&#x43e;&#x441;&#x441;-&#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x44f; &#x43c;&#x438;&#x43d;&#x438;&#x43c;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x433;&#x43e; &#x41b;&#x418;&#x418;&#x41a; &#x441; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x438;&#x440;&#x443;&#x44e;&#x449;&#x438;&#x43c; &#x41f;&#x41e; (gcc, binutils, make, etc.) &#x431;&#x435;&#x437; systemd &#x438; dbus.</li>
    
<li>&#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x44f; &#x434;&#x43b;&#x44f; &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x43a;&#x43e;&#x43c;&#x43f;&#x44c;&#x44e;&#x442;&#x435;&#x440;&#x430; &#x444;&#x430;&#x437;&#x430; 1 &#x431;&#x435;&#x437; &#x442;&#x435;&#x441;&#x442;&#x43e;&#x432; &#x41f;&#x41e; &#x432;&#x43a;&#x43b;&#x44e;&#x447;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e; &#x43f;&#x43e; systemd &#x438; dbus &#x43d;&#x430; init-bash &#x437;&#x430;&#x433;&#x440;&#x443;&#x436;&#x435;&#x43d;&#x43d;&#x43e;&#x43c; &#x41b;&#x418;&#x418;&#x41a;.</li>
    
<li>&#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x44f;/&#x440;&#x435;&#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x446;&#x438;&#x44f; &#x434;&#x43b;&#x44f; &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x43a;&#x43e;&#x43c;&#x43f;&#x44c;&#x44e;&#x442;&#x435;&#x440;&#x430; &#x444;&#x430;&#x437;&#x430; 2 (&#x432;&#x43a;&#x43b;&#x44e;&#x447;&#x430;&#x44f; &#x442;&#x435;&#x441;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x438; &#x432;&#x437;&#x430;&#x438;&#x43c;&#x43e;-&#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x438;) &#x432;&#x441;&#x435;&#x433;&#x43e; &#x43e;&#x441;&#x442;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x433;&#x43e; &#x41f;&#x41e; &#x43d;&#x430; init-systemd &#x437;&#x430;&#x433;&#x440;&#x443;&#x436;&#x435;&#x43d;&#x43d;&#x43e;&#x43c; &#x41b;&#x418;&#x418;&#x41a;.</li>
  </ol>
  &#x41d;&#x430;&#x447;&#x438;&#x43d;&#x430;&#x44f; &#x441; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; 1.6 &#x41b;&#x418;&#x418;&#x41a; &#x441;&#x442;&#x440;&#x43e;&#x438;&#x442;&#x441;&#x44f; &#x43d;&#x430; &#x43d;&#x43e;&#x432;&#x435;&#x439;&#x448;&#x435;&#x43c; &#x41f;&#x41e;, &#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; Kernel-5.5.2, GLIBC-2.31, SystemD-244, Gcc-9.3.0...



<p>
&#x420;&#x430;&#x431;&#x43e;&#x442;&#x430; &#x431;&#x44b;&#x43b;&#x430; &#x43f;&#x440;&#x43e;&#x434;&#x435;&#x43b;&#x430;&#x43d;&#x430; &#x43d;&#x430; Debian 9. &#x41e;&#x43d; &#x438;&#x43c;&#x435;&#x435;&#x442; &#x43a;&#x440;&#x43e;&#x441;&#x441;-&#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x44f;&#x442;&#x43e;&#x440;&#x44b; &#x434;&#x43b;&#x44f; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x438;&#x43d;&#x441;&#x442;&#x432;&#x430; &#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43a;&#x442;&#x443;&#x440;.
</p>


  
<p>&#x421;&#x43d;&#x438;&#x43c;&#x43e;&#x43a; &#x44d;&#x43a;&#x440;&#x430;&#x43d;&#x430; &#x41b;&#x418;&#x418;&#x41a; 1.8:</p>
  
<p align="center"><img src="1.1/lfsc18a.png" style="max-width: 100%" alt="" /></p>


<p>
&#x418;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x44b;&#x435; &#x43a;&#x43e;&#x434;&#x44b; (&#x43d;&#x430;&#x431;&#x43e;&#x440; bash-&#x441;&#x43a;&#x440;&#x438;&#x43f;&#x442;&#x43e;&#x432; &#x438; &#x438;&#x43d;&#x441;&#x442;&#x440;&#x443;&#x43a;&#x446;&#x438;&#x438;): <a class="externalLink" href="https://sourceforge.net/projects/linux-from-source-code/">https://sourceforge.net/projects/linux-from-source-code/</a>
(&#x438;&#x43b;&#x438; <a href="1.1/lfsc-1.8.tar.xz">lfsc-1.8.tar.xz</a>)
</p>

<p>
&#x421;&#x441;&#x44b;&#x43b;&#x43a;&#x438;:
</p>
<ul>
  
<li><a class="externalLink" href="https://wiki.debian.org/Multiarch">about multi-arch/cross-compiling https://wiki.debian.org/Multiarch</a></li>
  
<li>Linux From Scratch (LFS) http://www.linuxfromscratch.org</li>
  
<li><a class="externalLink" href="https://trac.clfs.org/">Cross-Compiled Linux From Scratch https://trac.clfs.org/</a></li>
  
<li><a class="externalLink" href="https://www.linuxjournal.com/content/diy-build-custom-minimal-linux-distribution-source">DIY: Build a Custom Minimal Linux Distribution from Source by Petros Koutoupis</a></li>
</ul>





  </div></div>


    </div>
    <div class="clear">
    </div>
    <hr/>
    <div class="footer">
              Copyright &#169;                   2019&#x2013;2021.
           All rights reserved.      
                    
                </div>
  </body>
</html>
