<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<!--
Licensed to the Apache Software Foundation (ASF) under one
or more contributor license agreements.  See the NOTICE file
distributed with this work for additional information
regarding copyright ownership.  The ASF licenses this file
to you under the Apache License, Version 2.0 (the
"License"); you may not use this file except in compliance
with the License.  You may obtain a copy of the License at

  http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing,
software distributed under the License is distributed on an
"AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
KIND, either express or implied.  See the License for the
specific language governing permissions and limitations
under the License.
-->

<!-- Generated by Apache Maven Doxia Site Renderer 1.4 at 2021-02-05 -->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <title>Beigesoft - 
    Беижсофт™ Информационная Система Предприятия</title>
    <style type="text/css" media="all">
      @import url("./css/bootstrap.min.css");
      @import url("./css/bootstrap-theme.min.css");
      @import url("./css/site.css");
    </style>
    <link rel="stylesheet" href="./css/print.css" type="text/css" media="print" />
    <meta name="Date-Revision-yyyymmdd" content="20210205" />
    <meta http-equiv="Content-Language" content="en" />
        
          <link rel="icon" href="images/favicon.png">
  </head>
  <body>
      <img class="logo-right" src="images/logo.png" alt="${project.organization.name} logo">
    <div class="page-header">
      <h1>Beigesoft™ Enterprise Information System Java code. <small>      
                    
                <div class="xleft">
        <span id="publishDate">Last Published: 2021-02-05</span>
                  &nbsp;| <span id="projectVersion">Version: 1.2-SNAPSHOT</span>
                      </div>
      </small></h1>
    </div>
    <div id="leftColumn" class="list-group">
              
                    
                                <h5>Project Documentation</h5>
                  
                                                                                                                                                                                                                                                                        <a href="project-info.html" class="list-group-item"><span class='glyphicon glyphicon-expand' aria-hidden='true'></span>  Project Information</a>
                                                                                                               <a href="project-reports.html" class="list-group-item"><span class='glyphicon glyphicon-expand' aria-hidden='true'></span>  Project Reports</a>
                   
                       <h5>Articles</h5>
                  
                                  <a href="eis-bobs-pizza.html" class="list-group-item">Beigesoft™ EIS, Bob's pizza example</a>
                                       <a href="eis-iv.html" class="list-group-item active disabled">Пример ведения коммерческого бухгалтерского учета в Беижсофт™ ИСП</a>
                                     <a href="blcexmplen.html" class="list-group-item">Beigesoft™ libraries for rapid development of cross-platform financial WEB-applications.</a>
                                     <a href="blcexmplru.html" class="list-group-item">Беижсофт™ библиотеки для быстрой разработки кроссс-платформенного финансового ПО с ВЕБ-интерфейсом</a>
                                     <a href="bslfsc.html" class="list-group-item">Beigesoft™ Linux From Source Code</a>
                                     <a href="bslfscru.html" class="list-group-item">Беижсофт™ Линукс из исходных кодов</a>
                                     <a href="bsplay.html" class="list-group-item">Beigesoft™ multimedia player</a>
                                     <a href="bs-ctsp-in-c.html" class="list-group-item">Type-safe programming complex high-level applications in C.</a>
                                     <a href="pdesign.html" class="list-group-item">Programming approaches.</a>
                                     <a href="data-protect.html" class="list-group-item">Data protection.</a>
             
                             <a href="http://maven.apache.org/" title="Built by Maven" class="poweredBy">
        <img class="poweredBy" alt="Built by Maven" src="./images/logos/maven-feather.png" />
      </a>
                   
                    
          </div>
    <div id="bodyColumn">
        

  

    <div class="section">
<h2>&#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x432;&#x435;&#x434;&#x435;&#x43d;&#x438;&#x44f; &#x43a;&#x43e;&#x43c;&#x43c;&#x435;&#x440;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x433;&#x43e; &#x431;&#x443;&#x445;&#x433;&#x430;&#x43b;&#x442;&#x435;&#x440;&#x441;&#x43a;&#x43e;&#x433;&#x43e; &#x443;&#x447;&#x435;&#x442;&#x430; &#x432; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;&#x2122; &#x418;&#x43d;&#x444;&#x43e;&#x440;&#x43c;&#x430;&#x446;&#x438;&#x43e;&#x43d;&#x43d;&#x430;&#x44f; &#x421;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x430; &#x41f;&#x440;&#x435;&#x434;&#x43f;&#x440;&#x438;&#x44f;&#x442;&#x438;&#x44f;.<a name="a_________."></a></h2>

    
<p>
      <a class="externalLink" href="https://www.facebook.com/Beigesoft-Accounting-All-In-One-401150900677249">&#x421;&#x442;&#x440;&#x430;&#x43d;&#x438;&#x446;&#x430; &#x43d;&#x430; &#x424;&#x44d;&#x439;&#x441;&#x431;&#x443;&#x43a;&#x435;</a>
    </p>

    
<p><b>&#x41a;&#x43b;&#x44e;&#x447;&#x435;&#x432;&#x44b;&#x435; &#x441;&#x43b;&#x43e;&#x432;&#x430;: &#x431;&#x435;&#x441;&#x43f;&#x43b;&#x430;&#x442;&#x43d;&#x43e;&#x435; &#x431;&#x443;&#x445;&#x433;&#x430;&#x43b;&#x442;&#x435;&#x440;&#x441;&#x43a;&#x43e;&#x435; &#x41f;&#x41e;, &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x430; &#x443;&#x447;&#x435;&#x442;&#x430; &#x434;&#x432;&#x43e;&#x439;&#x43d;&#x43e;&#x439; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x438;, &#x443;&#x447;&#x435;&#x442; &#x43f;&#x43e; &#x43e;&#x442;&#x433;&#x440;&#x443;&#x437;&#x43a;&#x435; &#x438; &#x43f;&#x43e; &#x43e;&#x43f;&#x43b;&#x430;&#x442;&#x435; (&#x43c;&#x435;&#x442;&#x43e;&#x434;&#x44b; &#x43a;&#x430;&#x441;&#x441;&#x43e;&#x432;&#x44b;&#x439; &#x438; &#x43d;&#x430;&#x447;&#x438;&#x441;&#x43b;&#x435;&#x43d;&#x438;&#x44f;).</b></p>

    
<div class="section">
<div class="section">
<h4>&#x426;&#x435;&#x43b;&#x44c; &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x439; &#x441;&#x442;&#x430;&#x442;&#x44c;&#x438;.<a name="a__."></a></h4>
    
<p>&#x41a;&#x430;&#x436;&#x434;&#x44b;&#x439; &#x43f;&#x440;&#x435;&#x434;&#x43f;&#x440;&#x438;&#x43d;&#x438;&#x43c;&#x430;&#x442;&#x435;&#x43b;&#x44c; &#x432;&#x435;&#x434;&#x435;&#x442; &#x443;&#x447;&#x435;&#x442; &#x441;&#x432;&#x43e;&#x435;&#x433;&#x43e; &#x431;&#x438;&#x437;&#x43d;&#x435;&#x441;&#x430;. &#x42d;&#x442;&#x43e; &#x442;&#x430;&#x43a;&#x430;&#x44f; &#x438;&#x43d;&#x444;&#x43e;&#x440;&#x43c;&#x430;&#x446;&#x438;&#x44f; &#x43a;&#x430;&#x43a;:
      </p>
<ul>
        
<li>&#x41a;&#x442;&#x43e; &#x43c;&#x43d;&#x435; &#x438; &#x441;&#x43a;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x434;&#x43e;&#x43b;&#x436;&#x435;&#x43d;</li>
        
<li>&#x41a;&#x43e;&#x43c;&#x443; &#x44f; &#x438; &#x441;&#x43a;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x434;&#x43e;&#x43b;&#x436;&#x435;&#x43d;</li>
        
<li>&#x421;&#x43a;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x434;&#x43e;&#x445;&#x43e;&#x434;&#x430; &#x43f;&#x43e;&#x43b;&#x443;&#x447;&#x435;&#x43d;&#x43e; &#x437;&#x430; &#x442;&#x430;&#x43a;&#x43e;&#x439;-&#x442;&#x43e; &#x43f;&#x435;&#x440;&#x438;&#x43e;&#x434;</li>
        
<li>&#x421;&#x43a;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x432;&#x44b;&#x440;&#x443;&#x447;&#x438;&#x442;&#x44c; &#x43e;&#x442; &#x43f;&#x440;&#x43e;&#x434;&#x430;&#x436;&#x438; &#x43e;&#x431;&#x43e;&#x440;&#x443;&#x434;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x438; &#x434;&#x440;&#x443;&#x433;&#x438;&#x445; &#x446;&#x435;&#x43d;&#x43d;&#x43e;&#x441;&#x442;&#x435;&#x439;</li>
        
<li>...</li>
      </ul>
      &#x414;&#x430;&#x43d;&#x43d;&#x443;&#x44e; &#x438;&#x43d;&#x444;&#x43e;&#x440;&#x43c;&#x430;&#x446;&#x438;&#x44e; &#x432; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x438;&#x43d;&#x441;&#x442;&#x432;&#x435; &#x441;&#x43b;&#x443;&#x447;&#x430;&#x435;&#x432; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x44b;&#x432;&#x430;&#x44e;&#x442; &#x432; &#x431;&#x43b;&#x43e;&#x43a;&#x43d;&#x43e;&#x442; &#x438;&#x43b;&#x438; &#x44d;&#x43b;&#x435;&#x43a;&#x442;&#x440;&#x43e;&#x43d;&#x43d;&#x443;&#x44e; &#x442;&#x430;&#x431;&#x43b;&#x438;&#x446;&#x443;.
      &#x41f;&#x43e; &#x43c;&#x435;&#x436;&#x434;&#x443;&#x43d;&#x430;&#x440;&#x43e;&#x434;&#x43d;&#x43e;&#x439; &#x43a;&#x43b;&#x430;&#x441;&#x441;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x446;&#x438;&#x438; &#x44d;&#x442;&#x43e; &#x43d;&#x430;&#x437;&#x44b;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x432;&#x435;&#x434;&#x435;&#x43d;&#x438;&#x435; &#x431;&#x443;&#x445;&#x433;&#x430;&#x43b;&#x442;&#x435;&#x440;&#x441;&#x43a;&#x43e;&#x433;&#x43e; &#x443;&#x447;&#x435;&#x442;&#x430; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x43e;&#x43c; &#x43e;&#x434;&#x438;&#x43d;&#x430;&#x440;&#x43d;&#x43e;&#x439; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x438; &#x43f;&#x43e; &#x43e;&#x442;&#x433;&#x440;&#x443;&#x437;&#x43a;&#x435; (&#x43c;&#x435;&#x442;&#x43e;&#x434;&#x43e;&#x43c; &#x43d;&#x430;&#x447;&#x438;&#x441;&#x43b;&#x435;&#x43d;&#x438;&#x44f;).
      &#x412;&#x435;&#x434;&#x435;&#x43d;&#x438;&#x435; &#x431;&#x443;&#x445;&#x433;&#x430;&#x43b;&#x442;&#x435;&#x440;&#x441;&#x43a;&#x43e;&#x433;&#x43e; &#x443;&#x447;&#x435;&#x442;&#x430; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x43e;&#x43c; &#x434;&#x432;&#x43e;&#x439;&#x43d;&#x43e;&#x439; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x438; &#x44d;&#x442;&#x43e; &#x43d;&#x430;&#x438;&#x431;&#x43e;&#x43b;&#x435;&#x435; &#x438;&#x43d;&#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442;&#x438;&#x432;&#x43d;&#x44b;&#x439;, &#x44d;&#x444;&#x444;&#x435;&#x43a;&#x442;&#x438;&#x432;&#x43d;&#x44b;&#x439; &#x438; &#x43f;&#x440;&#x430;&#x432;&#x438;&#x43b;&#x44c;&#x43d;&#x44b;&#x439; &#x43c;&#x435;&#x442;&#x43e;&#x434;.
      &#x41d;&#x43e; &#x43e;&#x43d; &#x431;&#x44b;&#x43b; &#x442;&#x440;&#x443;&#x434;&#x43e;&#x435;&#x43c;&#x43e;&#x43a; &#x43f;&#x440;&#x438; &#x43a;&#x43b;&#x430;&#x441;&#x441;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x43c; &#x440;&#x443;&#x447;&#x43d;&#x43e;&#x43c; &#x432;&#x435;&#x434;&#x435;&#x43d;&#x438;&#x438; &#x443;&#x447;&#x435;&#x442;&#x430;. &#x422;&#x430;&#x43a;&#x43e;&#x439; &#x43c;&#x435;&#x442;&#x43e;&#x434; &#x432;&#x435;&#x434;&#x435;&#x43d;&#x438;&#x44f; &#x43d;&#x435; &#x43e;&#x433;&#x440;&#x430;&#x43d;&#x438;&#x447;&#x438;&#x432;&#x430;&#x43b;&#x441;&#x44f; &#x434;&#x432;&#x443;&#x43c;&#x44f; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x44f;&#x43c;&#x438; &#x43e;&#x431; &#x43e;&#x434;&#x43d;&#x43e;&#x439; &#x43e;&#x43f;&#x435;&#x440;&#x430;&#x446;&#x438;&#x438;,
      &#x441;&#x432;&#x43e;&#x434;&#x43d;&#x44b;&#x435; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x438; &#x43f;&#x43e; &#x441;&#x447;&#x435;&#x442;&#x443; &#x440;&#x430;&#x437;&#x43d;&#x43e;&#x441;&#x438;&#x43b;&#x438;&#x441;&#x44c; &#x432; &#x433;&#x43b;&#x430;&#x432;&#x43d;&#x443;&#x44e; &#x43a;&#x43d;&#x438;&#x433;&#x443;, &#x437;&#x430;&#x442;&#x435;&#x43c; &#x432; &#x431;&#x430;&#x43b;&#x430;&#x43d;&#x441;. &#x41f;&#x440;&#x438; &#x43a;&#x43e;&#x43c;&#x43f;&#x44c;&#x44e;&#x442;&#x435;&#x440;&#x43d;&#x43e;&#x43c; &#x432;&#x435;&#x434;&#x435;&#x43d;&#x438;&#x438; &#x43b;&#x44e;&#x431;&#x430;&#x44f; &#x43e;&#x43f;&#x435;&#x440;&#x430;&#x446;&#x438;&#x44f; &#x432;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x441;&#x44f; &#x43a;&#x430;&#x43a; &#x43e;&#x434;&#x43d;&#x430; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x44c;,
      &#x430; &#x43e;&#x442;&#x447;&#x435;&#x442;&#x44b; (&#x431;&#x430;&#x43b;&#x430;&#x43d;&#x441;, &#x432;&#x435;&#x434;&#x43e;&#x43c;&#x43e;&#x441;&#x442;&#x44c; &#x43f;&#x43e; &#x441;&#x447;&#x435;&#x442;&#x443;) &#x444;&#x43e;&#x440;&#x43c;&#x438;&#x440;&#x443;&#x44e;&#x442;&#x441;&#x44f; &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438;.
    
    
<p>&#x412; &#x43c;&#x430;&#x43b;&#x43e;&#x43c; &#x43f;&#x440;&#x435;&#x434;&#x43f;&#x440;&#x438;&#x43d;&#x438;&#x43c;&#x430;&#x442;&#x435;&#x43b;&#x44c;&#x441;&#x442;&#x432;&#x435; &#x432;&#x435;&#x434;&#x435;&#x43d;&#x438;&#x435; &#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x43e;&#x432;&#x43e;&#x433;&#x43e; &#x443;&#x447;&#x435;&#x442;&#x430;, &#x446;&#x435;&#x43b;&#x44c;&#x44e; &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x43e;&#x433;&#x43e; &#x44f;&#x432;&#x43b;&#x44f;&#x435;&#x442;&#x441;&#x44f; &#x43d;&#x430;&#x447;&#x438;&#x441;&#x43b;&#x435;&#x43d;&#x438;&#x435; &#x438; &#x443;&#x43f;&#x43b;&#x430;&#x442;&#x430; &#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x43e;&#x432;, &#x441;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x441;&#x44f; &#x43a; &#x432;&#x435;&#x434;&#x435;&#x43d;&#x438;&#x44e; &#x43a;&#x43d;&#x438;&#x433;&#x438; &#x443;&#x447;&#x435;&#x442;&#x430; &#x434;&#x43e;&#x445;&#x43e;&#x434;&#x43e;&#x432; &#x438; &#x440;&#x430;&#x441;&#x445;&#x43e;&#x434;&#x43e;&#x432; &#x43a;&#x430;&#x441;&#x441;&#x43e;&#x432;&#x44b;&#x43c; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x43e;&#x43c;, &#x43b;&#x438;&#x431;&#x43e;/&#x438; &#x43f;&#x440;&#x43e;&#x441;&#x442;&#x43e;&#x439; &#x443;&#x43f;&#x43b;&#x430;&#x442;&#x43e;&#x439; &#x435;&#x434;&#x438;&#x43d;&#x43e;&#x433;&#x43e; &#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x430; &#x43d;&#x430; &#x432;&#x43c;&#x435;&#x43d;&#x435;&#x43d;&#x43d;&#x44b;&#x439; &#x434;&#x43e;&#x445;&#x43e;&#x434;.
      &#x423;&#x447;&#x435;&#x442; &#x415;&#x41d;&#x412;&#x414; &#x432;&#x43e;&#x43e;&#x431;&#x449;&#x435; &#x442;&#x440;&#x443;&#x434;&#x43d;&#x43e; &#x43e;&#x442;&#x43d;&#x435;&#x441;&#x442;&#x438; &#x43a; &#x431;&#x443;&#x445;&#x433;&#x430;&#x43b;&#x442;&#x435;&#x440;&#x441;&#x43a;&#x43e;&#x43c;&#x443; &#x443;&#x447;&#x435;&#x442;&#x443;, &#x442;&#x430;&#x43a; &#x43a;&#x430;&#x43a; &#x44d;&#x442;&#x43e; &#x43e;&#x434;&#x43d;&#x430; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x44c; &#x441; &#x444;&#x438;&#x43a;&#x441;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x43d;&#x44b;&#x43c; &#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x43e;&#x43c; &#x432; &#x434;&#x435;&#x43a;&#x43b;&#x430;&#x440;&#x430;&#x446;&#x438;&#x438;.
      &#x41a;&#x43d;&#x438;&#x433;&#x430; &#x423;&#x421;&#x41d; &#x432;&#x435;&#x434;&#x435;&#x442;&#x441;&#x44f; &#x43a;&#x430;&#x441;&#x441;&#x43e;&#x432;&#x44b;&#x43c; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x43e;&#x43c; (&#x43f;&#x43e; &#x43e;&#x43f;&#x43b;&#x430;&#x442;&#x435;), &#x438; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x438;&#x437; &#x43d;&#x435;&#x435; &#x43f;&#x440;&#x430;&#x43a;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438; &#x431;&#x435;&#x441;&#x43f;&#x43e;&#x43b;&#x435;&#x437;&#x43d;&#x44b; &#x434;&#x43b;&#x44f; &#x43a;&#x43e;&#x43c;&#x43c;&#x435;&#x440;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x433;&#x43e; &#x443;&#x447;&#x435;&#x442;&#x430; (&#x43a;&#x43e;&#x43d;&#x435;&#x447;&#x43d;&#x43e; &#x43a;&#x440;&#x43e;&#x43c;&#x435; &#x441;&#x430;&#x43c;&#x43e;&#x433;&#x43e; &#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x430;). &#x412;&#x441;&#x435; &#x44d;&#x442;&#x43e; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x43f;&#x43e;&#x43d;&#x44f;&#x442;&#x44c; &#x434;&#x43e;&#x447;&#x438;&#x442;&#x430;&#x432; &#x441;&#x442;&#x430;&#x442;&#x44c;&#x44e; &#x434;&#x43e; &#x43a;&#x43e;&#x43d;&#x446;&#x430;.
    </p>
    
<p>
      &#x412; &#x43e;&#x431;&#x449;&#x435;&#x43c;, &#x446;&#x435;&#x43b;&#x435;&#x432;&#x430;&#x44f; &#x430;&#x443;&#x434;&#x438;&#x442;&#x43e;&#x440;&#x438;&#x44f; &#x434;&#x43b;&#x44f; &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x439; &#x441;&#x442;&#x430;&#x442;&#x44c;&#x438; &#x44d;&#x442;&#x43e; &#x43f;&#x440;&#x435;&#x434;&#x43f;&#x440;&#x438;&#x43d;&#x438;&#x43c;&#x430;&#x442;&#x435;&#x43b;&#x438;.
      &#x412;&#x435;&#x434;&#x435;&#x43d;&#x438;&#x435; &#x43a;&#x43e;&#x43c;&#x43c;&#x435;&#x440;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x433;&#x43e; &#x443;&#x447;&#x435;&#x442;&#x430; &#x43d;&#x430;&#x435;&#x43c;&#x43d;&#x44b;&#x43c;&#x438; &#x431;&#x443;&#x445;&#x433;&#x430;&#x43b;&#x442;&#x435;&#x440;&#x430;&#x43c;&#x438; &#x43c;&#x43e;&#x433;&#x443;&#x442; &#x441;&#x435;&#x431;&#x435; &#x43f;&#x43e;&#x437;&#x432;&#x43e;&#x43b;&#x438;&#x442;&#x44c; &#x43a;&#x440;&#x443;&#x43f;&#x43d;&#x44b;&#x435; &#x43f;&#x440;&#x435;&#x434;&#x43f;&#x440;&#x438;&#x44f;&#x442;&#x438;&#x44f;, &#x438; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x439; &#x443;&#x447;&#x435;&#x442; &#x447;&#x430;&#x441;&#x442;&#x43e; &#x43d;&#x430;&#x437;&#x44b;&#x432;&#x430;&#x44e;&#x442; &quot;&#x423;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x43c;&quot;.
      &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;&#x2122; &#x418;&#x421;&#x41f; &#x43f;&#x440;&#x435;&#x436;&#x434;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43e; &#x441;&#x43e;&#x434;&#x435;&#x440;&#x436;&#x438;&#x442; &#x431;&#x443;&#x445;&#x433;&#x430;&#x43b;&#x442;&#x435;&#x440;&#x441;&#x43a;&#x438;&#x439; &#x444;&#x443;&#x43d;&#x43a;&#x446;&#x438;&#x43e;&#x43d;&#x430;&#x43b;.
      &#x41f;&#x440;&#x43e;&#x447;&#x438;&#x442;&#x430;&#x432; &#x441;&#x442;&#x430;&#x442;&#x44c;&#x44e; &#x438; &#x43f;&#x43e;&#x432;&#x442;&#x43e;&#x440;&#x438;&#x432; &#x432;&#x441;&#x435; &#x43e;&#x43f;&#x435;&#x440;&#x430;&#x446;&#x438;&#x438; &#x43d;&#x430; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;&#x2122; &#x418;&#x421;&#x41f;, &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x443;&#x431;&#x435;&#x434;&#x438;&#x442;&#x44c;&#x441;&#x44f; &#x447;&#x442;&#x43e; &#x44d;&#x442;&#x43e; &#x43d;&#x435; &#x442;&#x440;&#x443;&#x434;&#x43d;&#x43e; &#x438; &#x434;&#x43e;&#x432;&#x43e;&#x43b;&#x44c;&#x43d;&#x43e; &#x44d;&#x444;&#x444;&#x435;&#x43a;&#x442;&#x438;&#x432;&#x43d;&#x43e;.
    </p>

    </div>
<div class="section">
<h4>&#x41f;&#x440;&#x435;&#x438;&#x43c;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x430; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;&#x2122; &#x418;&#x421;&#x41f;.<a name="a__."></a></h4>
    
<p>
      &#x41f;&#x435;&#x440;&#x432;&#x43e;&#x435; &#x44d;&#x442;&#x43e; &#x444;&#x443;&#x43d;&#x43a;&#x446;&#x438;&#x43e;&#x43d;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x44c;.
        </p>
<ul>
          
<li>&#x41e;&#x446;&#x435;&#x43d;&#x438;&#x442;&#x44c; &#x444;&#x443;&#x43d;&#x43a;&#x446;&#x438;&#x43e;&#x43d;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x44c; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x431;&#x435;&#x437; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43a;&#x438;, &#x43f;&#x440;&#x43e;&#x441;&#x442;&#x43e; &#x447;&#x438;&#x442;&#x430;&#x44f; &#x43f;&#x440;&#x438;&#x432;&#x435;&#x434;&#x435;&#x43d;&#x43d;&#x443;&#x44e; &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x430;&#x446;&#x438;&#x44e;</li>
          
<li>&#x42d;&#x442;&#x43e; &#x433;&#x43e;&#x442;&#x43e;&#x432;&#x43e;&#x435; &#x440;&#x435;&#x448;&#x435;&#x43d;&#x438;&#x435; &#x434;&#x43b;&#x44f; &#x432;&#x435;&#x434;&#x435;&#x43d;&#x438;&#x44f; &#x43a;&#x43e;&#x43c;&#x43c;&#x435;&#x440;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x433;&#x43e; &#x443;&#x447;&#x435;&#x442;&#x430; &#x43f;&#x43e; &#x440;&#x44b;&#x43d;&#x43e;&#x447;&#x43d;&#x44b;&#x43c; &#x43f;&#x440;&#x430;&#x432;&#x438;&#x43b;&#x430;&#x43c; (&#x441;&#x43c;&#x43e;&#x442;&#x440;&#x438;&#x442;&#x435; &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x430;&#x446;&#x438;&#x44e;).</li>
          
<li>&#x421;&#x43a;&#x43b;&#x430;&#x434; - &#x442;&#x440;&#x435;&#x445;&#x43c;&#x435;&#x440;&#x43d;&#x430;&#x44f; &#x440;&#x435;&#x433;&#x438;&#x441;&#x442;&#x440;&#x430;&#x446;&#x438;&#x44f; &#x445;&#x440;&#x430;&#x43d;&#x435;&#x43d;&#x438;&#x44f; &quot;&#x421;&#x43a;&#x43b;&#x430;&#x434;-&#x41c;&#x435;&#x441;&#x442;&#x43e;-&#x415;&#x434;&#x438;&#x43d;&#x438;&#x446;&#x430; &#x418;&#x437;&#x43c;&#x435;&#x440;&#x435;&#x43d;&#x438;&#x44f;&quot;.</li>
          
<li>&#x410;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x435; &#x432;&#x44b;&#x447;&#x438;&#x441;&#x43b;&#x435;&#x43d;&#x438;&#x435; &#x441;&#x435;&#x431;&#x435;&#x441;&#x442;&#x43e;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x438; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x430;&#x43c;&#x438; &#x424;&#x418;&#x424;&#x41e;/&#x41b;&#x418;&#x424;&#x41e; &#x438; &#x43f;&#x43e; &#x441;&#x442;&#x43e;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x438; &#x435;&#x434;&#x438;&#x43d;&#x438;&#x446;&#x44b; (&#x432;&#x44b;&#x431;&#x438;&#x440;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x43d;&#x43e;&#x43c;&#x435;&#x43d;&#x43a;&#x43b;&#x430;&#x442;&#x443;&#x440;&#x430; &#x441; &#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43d;&#x43e;&#x439; &#x441;&#x442;&#x43e;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x44c;&#x44e;). &#x41b;&#x418;&#x424;&#x41e; &#x43d;&#x435; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442; &#x432; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x438;&#x43d;&#x441;&#x442;&#x432;&#x435; &#x441;&#x442;&#x440;&#x430;&#x43d;, &quot;&#x43f;&#x43e; &#x441;&#x440;&#x435;&#x434;&#x43d;&#x435;&#x439;&quot; &#x437;&#x430;&#x43a;&#x43e;&#x43d;&#x435;&#x43d; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x43d;&#x435; &#x432;&#x435;&#x437;&#x434;&#x435;. &#x424;&#x418;&#x424;&#x41e; - &#x43d;&#x430;&#x438;&#x431;&#x43e;&#x43b;&#x435;&#x435; &#x43d;&#x430;&#x442;&#x443;&#x440;&#x430;&#x43b;&#x44c;&#x43d;&#x44b;&#x439; &#x43c;&#x435;&#x442;&#x43e;&#x434;, &#x43d;&#x43e; &#x431;&#x44b;&#x43b; &#x441;&#x43b;&#x43e;&#x436;&#x435;&#x43d; &#x43f;&#x440;&#x438; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x438;&#x445; &#x43e;&#x431;&#x43e;&#x440;&#x43e;&#x442;&#x430;&#x445; &#x43f;&#x440;&#x438; &#x43d;&#x435;&#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x437;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x43d;&#x43e;&#x43c; (&#x431;&#x443;&#x43c;&#x430;&#x436;&#x43d;&#x43e;&#x43c;) &#x443;&#x447;&#x435;&#x442;&#x435;. &#x41c;&#x435;&#x442;&#x43e;&#x434; &quot;&#x43f;&#x43e; &#x441;&#x442;&#x43e;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x438; &#x435;&#x434;&#x438;&#x43d;&#x438;&#x446;&#x44b;&quot; &#x43f;&#x440;&#x438;&#x432;&#x43e;&#x434;&#x438;&#x442; &#x43a; &quot;&#x440;&#x430;&#x441;&#x43f;&#x443;&#x445;&#x430;&#x43d;&#x438;&#x44e;&quot; &#x441;&#x43f;&#x440;&#x430;&#x432;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x430; &#x43d;&#x43e;&#x43c;&#x435;&#x43d;&#x43a;&#x43b;&#x430;&#x442;&#x443;&#x440;&#x44b; (&#x411;&#x435;&#x43d;&#x437;&#x438;&#x43d; 45&#x440;, &#x411;&#x435;&#x43d;&#x437;&#x438;&#x43d; 47&#x440;...) &#x438; &#x443;&#x441;&#x43b;&#x43e;&#x436;&#x43d;&#x435;&#x43d;&#x438;&#x44e; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x43a;&#x438; (&#x43f;&#x430;&#x440;&#x442;&#x438;&#x43e;&#x43d;&#x43d;&#x44b;&#x439; &#x443;&#x447;&#x435;&#x442; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x43d;&#x435; &#x43d;&#x430;&#x448;&#x435;&#x43b; &#x443;&#x441;&#x43f;&#x435;&#x445;&#x430;).</li>
          
<li>&#x41d;&#x414;&#x421; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x44b;: &#x43f;&#x43e; &#x43e;&#x442;&#x433;&#x440;&#x443;&#x437;&#x43a;&#x435;/&#x43e;&#x43f;&#x43b;&#x430;&#x442;&#x435;, &#x440;&#x430;&#x441;&#x447;&#x435;&#x442; &#x43f;&#x43e;&#x441;&#x442;&#x440;&#x43e;&#x447;&#x43d;&#x43e;/&#x43f;&#x43e; &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x443;, &#x41d;&#x414;&#x421; &#x432;&#x43a;&#x43b;&#x44e;&#x447;&#x435;&#x43d; &#x432; &#x446;&#x435;&#x43d;&#x443;.</li>
          
<li>&#x41e;&#x442;&#x441;&#x43b;&#x435;&#x436;&#x438;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x43f;&#x43b;&#x430;&#x442;&#x435;&#x436;&#x435;&#x439; &#x437;&#x430; &#x43f;&#x43e;&#x43a;&#x443;&#x43f;&#x43a;&#x438;/&#x43f;&#x440;&#x43e;&#x434;&#x430;&#x436;&#x438; &#x432; &#x43d;&#x430;&#x446;&#x438;&#x43e;&#x43d;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x439; &#x438; &#x438;&#x43d;&#x43e;&#x441;&#x442;&#x440;&#x430;&#x43d;&#x43d;&#x43e;&#x439; &#x432;&#x430;&#x43b;&#x44e;&#x442;&#x430;&#x445;.</li>
          
<li>&#x41f;&#x440;&#x43e;&#x438;&#x437;&#x432;&#x43e;&#x434;&#x441;&#x442;&#x432;&#x43e; - &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x435; &#x432;&#x44b;&#x447;&#x438;&#x441;&#x43b;&#x435;&#x43d;&#x438;&#x435; &#x441;&#x435;&#x431;&#x435;&#x441;&#x442;&#x43e;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x438; &#x43f;&#x440;&#x43e;&#x434;&#x443;&#x43a;&#x446;&#x438;&#x438; &#x438;&#x437; &#x441;&#x442;&#x43e;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x438; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x43c;&#x430;&#x442;&#x435;&#x440;&#x438;&#x430;&#x43b;&#x43e;&#x432; &#x438; &#x434;&#x440;&#x443;&#x433;&#x438;&#x445; &#x43f;&#x440;&#x44f;&#x43c;&#x44b;&#x445; &#x437;&#x430;&#x442;&#x440;&#x430;&#x442; (&#x442;&#x440;&#x443;&#x434;).</li>
          
<li>&#x417;&#x430;&#x440;&#x43f;&#x43b;&#x430;&#x442;&#x430; - &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x435; &#x43d;&#x430;&#x447;&#x438;&#x441;&#x43b;&#x435;&#x43d;&#x438;&#x435; &#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x43e;&#x432; &#x441; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x43d;&#x438;&#x43a;&#x430;/&#x440;&#x430;&#x431;&#x43e;&#x442;&#x43e;&#x434;&#x430;&#x442;&#x435;&#x43b;&#x44f; &#x441;&#x43e;&#x433;&#x43b;&#x430;&#x441;&#x43d;&#x43e; &#x442;&#x430;&#x431;&#x43b;&#x438;&#x446;, &#x43f;&#x43e;&#x43b;&#x443;&#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x43a;&#x438; &#x437;&#x430;&#x447;&#x435;&#x442;&#x44b; &#x437;&#x430; &#x433;&#x43e;&#x434;, &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x435; &#x43f;&#x440;&#x43e;&#x432;&#x43e;&#x434;&#x43a;&#x438; &#x43f;&#x43e; &#x417;&#x41f; (&#x43f;&#x43e; &#x441;&#x442;&#x430;&#x442;&#x44c;&#x44f;&#x43c;) &#x438; &#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x430;&#x43c;.</li>
          
<li>&#x418;&#x43c;&#x43f;&#x43e;&#x440;&#x442; &#x432;&#x44b;&#x43f;&#x438;&#x441;&#x43a;&#x438; &#x431;&#x430;&#x43d;&#x43a;&#x430; &#x438;&#x437; CSV &#x444;&#x430;&#x439;&#x43b;&#x430; &#x43f;&#x43e; &#x43f;&#x440;&#x43e;&#x438;&#x437;&#x432;&#x43e;&#x43b;&#x44c;&#x43d;&#x43e;&#x439; &#x43d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x435; (&#x434;&#x43b;&#x44f; &#x43c;&#x43d;&#x43e;&#x436;&#x435;&#x441;&#x442;&#x432;&#x430; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442;&#x43e;&#x432;).</li>
          
<li>&#x418;&#x43c;&#x43f;&#x43e;&#x440;&#x442; &#x43f;&#x440;&#x43e;&#x432;&#x43e;&#x434;&#x43e;&#x43a; &#x438;&#x437; &#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x43e;&#x432;&#x43e;&#x439; &#x431;&#x430;&#x437;&#x44b; &#x432; &#x43a;&#x43e;&#x43c;&#x43c;&#x435;&#x440;&#x447;&#x435;&#x441;&#x43a;&#x443;&#x44e; &#x447;&#x435;&#x440;&#x435;&#x437; &#x412;&#x415;&#x411;-&#x441;&#x435;&#x440;&#x432;&#x438;&#x441;. &#x411;&#x43e;&#x43b;&#x44c;&#x448;&#x438;&#x43d;&#x441;&#x442;&#x432;&#x43e; &#x43f;&#x440;&#x43e;&#x432;&#x43e;&#x434;&#x43e;&#x43a; &#x438;&#x437; &quot;&#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x43e;&#x439;&quot; &#x431;&#x443;&#x445;&#x433;&#x430;&#x43b;&#x442;&#x435;&#x440;&#x438;&#x438; (&#x43e;&#x431;&#x449;&#x438;&#x439; &#x440;&#x435;&#x436;&#x438;&#x43c; &#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x43e;&#x43e;&#x431;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x44f;) &#x441;&#x43f;&#x440;&#x430;&#x432;&#x435;&#x434;&#x43b;&#x438;&#x432;&#x44b; &#x434;&#x43b;&#x44f; &#x43a;&#x43e;&#x43c;&#x43c;&#x435;&#x440;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x433;&#x43e; &#x443;&#x447;&#x435;&#x442;&#x430;.</li>
          
<li>&#x415;&#x441;&#x442;&#x44c; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44f; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;&#x2122; &#x418;&#x421;&#x41f; &#x434;&#x43b;&#x44f; &#x41c;&#x421; &#x412;&#x438;&#x43d;&#x434;&#x43e;&#x443;&#x441;, &#x41c;&#x430;&#x43a;, &#x42e;&#x43d;&#x438;&#x43a;&#x441;-&#x43f;&#x43e;&#x434;&#x43e;&#x431;&#x43d;&#x44b;&#x445; &#x41e;&#x421;. &#x412;&#x44b; &#x43c;&#x43e;&#x436;&#x435;&#x442;&#x435; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x442;&#x44c; &#x441; &#x43e;&#x434;&#x438;&#x43d;&#x430;&#x43a;&#x43e;&#x432;&#x43e;&#x439; &#x421;&#x41a;&#x41b;&#x430;&#x439;&#x442; &#x431;&#x430;&#x437;&#x43e;&#x439; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x432;&#x435;&#x437;&#x434;&#x435;.</li>
          
<li>&#x418;&#x43c;&#x43f;&#x43e;&#x440;&#x442; &#x432;&#x441;&#x435;&#x439; &#x431;&#x430;&#x437;&#x44b; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x438;&#x437; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x43d;&#x435;&#x442; (&#x438;&#x43d;&#x442;&#x440;&#x430;&#x43d;&#x435;&#x442;) &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; (&#x431;&#x430;&#x437;&#x44b; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x43d;&#x430; &#x41c;&#x430;&#x439;&#x42d;&#x441;&#x41a;&#x443;&#x42d;&#x43b;&#x44c; &#x438;&#x43b;&#x438; &#x41f;&#x43e;&#x441;&#x442;&#x433;&#x440;&#x435;&#x441;) &#x432; &#x43b;&#x43e;&#x43a;&#x430;&#x43b;&#x44c;&#x43d;&#x443;&#x44e; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44e; (&#x421;&#x41a;&#x443;&#x42d;&#x43b;&#x41b;&#x430;&#x439;&#x442;) &#x447;&#x435;&#x440;&#x435;&#x437; &#x412;&#x415;&#x411;-&#x441;&#x435;&#x440;&#x432;&#x438;&#x441;. &#x422;&#x43e; &#x435;&#x441;&#x442;&#x44c; &#x443;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x446;&#x44b; &#x438; &#x432;&#x43b;&#x430;&#x434;&#x435;&#x43b;&#x44c;&#x446;&#x44b; &#x431;&#x438;&#x437;&#x43d;&#x435;&#x441;&#x430; &#x43c;&#x43e;&#x433;&#x443;&#x442; &#x43a;&#x43e;&#x43f;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x432;&#x441;&#x44e; &#x431;&#x430;&#x437;&#x443; &#x43d;&#x430; &#x410;&#x43d;&#x434;&#x440;&#x43e;&#x438;&#x434; &#x43f;&#x43b;&#x430;&#x43d;&#x448;&#x435;&#x442; &#x434;&#x43b;&#x44f; &#x43f;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43d;&#x43e;&#x433;&#x43e; &#x430;&#x43d;&#x430;&#x43b;&#x438;&#x437;&#x430;.</li>
          
<li>&#x412;&#x441;&#x442;&#x440;&#x43e;&#x435;&#x43d;&#x43d;&#x44b;&#x439; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x43d;&#x435;&#x442; &#x43c;&#x430;&#x433;&#x430;&#x437;&#x438;&#x43d; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x44c;&#x441;&#x44f; &#x438; &#x434;&#x43b;&#x44f; &#x43e;&#x43f;&#x442;&#x43e;&#x432;&#x43e;&#x439; &#x442;&#x43e;&#x440;&#x433;&#x43e;&#x432;&#x43b;&#x438;. &#x426;&#x435;&#x43d;&#x430; &#x432; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x438; &#x43e;&#x442; &#x43f;&#x43e;&#x43a;&#x443;&#x43f;&#x430;&#x442;&#x435;&#x43b;&#x44f; &#x440;&#x435;&#x430;&#x43b;&#x438;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x430;. &#x41a;&#x430;&#x442;&#x430;&#x43b;&#x43e;&#x433; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x442;&#x44c; &#x434;&#x43b;&#x44f; &#x43b;&#x44e;&#x431;&#x44b;&#x445; &#x442;&#x43e;&#x432;&#x430;&#x440;&#x43e;&#x432; &#x438; &#x443;&#x441;&#x43b;&#x443;&#x433; &#x432;&#x432;&#x43e;&#x434;&#x44f; &#x434;&#x438;&#x43d;&#x430;&#x43c;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x432;&#x430;&#x435;&#x43c;&#x44b;&#x435; &#x445;&#x430;&#x440;&#x430;&#x43a;&#x442;&#x435;&#x440;&#x438;&#x441;&#x442;&#x438;&#x43a;&#x438; (&#x446;&#x432;&#x435;&#x442;, &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x44c;...). &#x411;&#x440;&#x43e;&#x43d;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x443;&#x441;&#x43b;&#x443;&#x433; &#x43f;&#x43e; &#x432;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x438; &#x43f;&#x43e;&#x43a;&#x430; &#x43d;&#x435; &#x440;&#x435;&#x430;&#x43b;&#x438;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x43e;.</li>
          
<li>&#x412;&#x435;&#x431;-&#x43c;&#x430;&#x433;&#x430;&#x437;&#x438;&#x43d; &#x43f;&#x43e;&#x437;&#x432;&#x43e;&#x43b;&#x44f;&#x435;&#x442; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44c; &#x43f;&#x440;&#x430;&#x439;&#x441; &#x43b;&#x438;&#x441;&#x442;&#x44b; &#x441; &#x440;&#x430;&#x437;&#x43b;&#x438;&#x447;&#x43d;&#x44b;&#x43c;&#x438; &#x446;&#x435;&#x43d;&#x430;&#x43c;&#x438; (&#x43c;&#x430;&#x433;&#x430;&#x437;&#x438;&#x43d; &#x432; &#x446;&#x435;&#x43d;&#x442;&#x440;&#x435;, &#x43e;&#x43f;&#x442;&#x43e;&#x432;&#x44b;&#x435; &#x43f;&#x43e;&#x43a;&#x443;&#x43f;&#x430;&#x442;&#x435;&#x43b;&#x438; &#x410;...) &#x438; &#x44d;&#x43a;&#x441;&#x43f;&#x43e;&#x440;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x438;&#x445; &#x432; CSV &#x444;&#x430;&#x439;&#x43b;&#x430;&#x445; &#x43e;&#x43f;&#x442;&#x43e;&#x432;&#x44b;&#x43c; &#x43f;&#x43e;&#x43a;&#x443;&#x43f;&#x430;&#x442;&#x435;&#x43b;&#x44f;&#x43c; &#x438; &#x432; POS-&#x442;&#x435;&#x440;&#x43c;&#x438;&#x43d;&#x430;&#x43b;&#x44b;.</li>
          
<li>&#x412;&#x435;&#x431;-&#x43c;&#x430;&#x433;&#x430;&#x437;&#x438;&#x43d; &#x432;&#x43a;&#x43b;&#x44e;&#x447;&#x435;&#x43d; &#x432; &#x43b;&#x43e;&#x43a;&#x430;&#x43b;&#x44c;&#x43d;&#x44b;&#x435; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x434;&#x43b;&#x44f; &#x438;&#x437;&#x443;&#x447;&#x435;&#x43d;&#x438;&#x44f;, &#x43f;&#x440;&#x430;&#x439;&#x441;&#x438;&#x43d;&#x433;&#x430; &#x438; &#x432;&#x43e;&#x437;&#x43c;&#x43e;&#x436;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x43a;&#x43e;&#x43f;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x43f;&#x43e;&#x43b;&#x43d;&#x43e;&#x439; &#x431;&#x430;&#x437;&#x44b; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x438;&#x437; &#x418;&#x43d;&#x442;&#x435;&#x440;&#x43d;&#x435;&#x442;-&#x432;&#x435;&#x440;&#x441;&#x438;&#x438;.</li>
          
<li>&#x41d;&#x435;&#x442; &#x43e;&#x433;&#x440;&#x430;&#x43d;&#x438;&#x447;&#x435;&#x43d;&#x438;&#x44f; &#x43d;&#x430; &#x43a;&#x43e;&#x43b;&#x438;&#x447;&#x435;&#x441;&#x442;&#x432;&#x43e; &#x431;&#x430;&#x437; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; (&#x43e;&#x440;&#x433;&#x430;&#x43d;&#x438;&#x437;&#x430;&#x446;&#x438;&#x439;) &#x432; &#x43b;&#x43e;&#x43a;&#x430;&#x43b;&#x44c;&#x43d;&#x44b;&#x445; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44f;&#x445;.</li>
          
<li>&#x42d;&#x442;&#x43e; &#x440;&#x435;&#x448;&#x435;&#x43d;&#x438;&#x435; &quot;&#x43d;&#x430; &#x432;&#x44b;&#x440;&#x43e;&#x441;&#x442;&quot;, &#x440;&#x430;&#x441;&#x441;&#x447;&#x438;&#x442;&#x430;&#x43d;&#x43e; &#x43d;&#x430; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x438;&#x435; &#x43d;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43a;&#x438;.</li>
          
<li>...</li>
        </ul>
    
    
<p>&#x412;&#x442;&#x43e;&#x440;&#x43e;&#x435; &#x44d;&#x442;&#x43e; &#x43d;&#x430;&#x434;&#x435;&#x436;&#x43d;&#x43e;&#x441;&#x442;&#x44c;, &#x440;&#x430;&#x431;&#x43e;&#x442;&#x43e;&#x441;&#x43f;&#x43e;&#x441;&#x43e;&#x431;&#x43d;&#x43e;&#x441;&#x442;&#x44c;.
    </p>
<ul>
      
<li>&#x41b;&#x438;&#x446;&#x435;&#x43d;&#x437;&#x438;&#x438; &#x432;&#x441;&#x435;&#x445; &#x447;&#x430;&#x441;&#x442;&#x435;&#x439; &#x433;&#x430;&#x440;&#x430;&#x43d;&#x442;&#x438;&#x440;&#x443;&#x44e;&#x442; &#x43e;&#x442;&#x441;&#x443;&#x442;&#x441;&#x442;&#x432;&#x438;&#x435; &#x432;&#x43e;&#x437;&#x43c;&#x43e;&#x436;&#x43d;&#x44b;&#x445; &#x43f;&#x440;&#x43e;&#x431;&#x43b;&#x435;&#x43c; &#x432; &#x431;&#x443;&#x434;&#x443;&#x449;&#x435;&#x43c;.</li>
      
<li>&#x41e;&#x442;&#x43a;&#x440;&#x44b;&#x442;&#x44b;&#x439; &#x43a;&#x43e;&#x434; - &#x432;&#x43e;&#x437;&#x43c;&#x43e;&#x436;&#x43d;&#x43e;&#x441;&#x442;&#x44c; &#x434;&#x43e;&#x440;&#x430;&#x431;&#x43e;&#x442;&#x43a;&#x438;,  &#x438;&#x441;&#x43f;&#x440;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x435; &#x43e;&#x448;&#x438;&#x431;&#x43e;&#x43a;.</li>
      
<li>&#x414;&#x438;&#x441;&#x442;&#x440;&#x438;&#x431;&#x443;&#x442;&#x438;&#x432;&#x44b; &#x438; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x44b;&#x439; &#x43a;&#x43e;&#x434; &#x43d;&#x430;&#x445;&#x43e;&#x434;&#x44f;&#x442;&#x441;&#x44f; &#x432; &#x446;&#x435;&#x43d;&#x442;&#x440;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x43c; &#x41c;&#x430;&#x432;&#x435;&#x43d; &#x440;&#x435;&#x43f;&#x43e;&#x437;&#x438;&#x442;&#x43e;&#x440;&#x438;&#x438;. &#x41d;&#x435;&#x442; &#x440;&#x438;&#x441;&#x43a;&#x430; &#x434;&#x430;&#x443;&#x43d;&#x433;&#x440;&#x44d;&#x439;&#x434;&#x430;, &#x438;&#x441;&#x447;&#x435;&#x437;&#x43d;&#x43e;&#x432;&#x435;&#x43d;&#x438;&#x44f;.</li>
      
<li>&#x41f;&#x41e; &#x43e;&#x441;&#x43d;&#x43e;&#x432;&#x430;&#x43d;&#x43e; &#x43d;&#x430; &#x442;&#x435;&#x445;&#x43d;&#x43e;&#x43b;&#x43e;&#x433;&#x438;&#x44f;&#x445;, &#x445;&#x43e;&#x440;&#x43e;&#x448;&#x43e; &#x437;&#x430;&#x440;&#x435;&#x43a;&#x43e;&#x43c;&#x435;&#x43d;&#x434;&#x43e;&#x432;&#x430;&#x432;&#x448;&#x438;&#x445; &#x441;&#x435;&#x431;&#x44f; &#x43d;&#x430; &#x432;&#x44b;&#x441;&#x43e;&#x43a;&#x438;&#x445; &#x43d;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43a;&#x430;&#x445;. &#x421;&#x43e;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43d;&#x43d;&#x44b;&#x439; &#x433;&#x435;&#x43d;&#x435;&#x440;&#x430;&#x442;&#x43e;&#x440; &#x43e;&#x442;&#x447;&#x435;&#x442;&#x43e;&#x432; &#x43a;&#x44d;&#x448;&#x438;&#x440;&#x443;&#x435;&#x442; TTF &#x448;&#x440;&#x438;&#x444;&#x442; &#x438; &#x433;&#x435;&#x43d;&#x435;&#x440;&#x438;&#x440;&#x443;&#x435;&#x442; PDF &#x444;&#x430;&#x439;&#x43b; &#x43c;&#x430;&#x43b;&#x43e;&#x433;&#x43e; &#x440;&#x430;&#x437;&#x43c;&#x435;&#x440;&#x430;, &#x437;&#x430;&#x43f;&#x438;&#x441;&#x44b;&#x432;&#x430;&#x44f; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x43c;&#x44b;&#x435; TTF &#x441;&#x438;&#x43c;&#x432;&#x43e;&#x43b;&#x44b;, &#x44d;&#x442;&#x43e; &#x43a;&#x440;&#x438;&#x442;&#x438;&#x447;&#x43d;&#x43e; &#x434;&#x43b;&#x44f; &#x448;&#x440;&#x438;&#x444;&#x442;&#x43e;&#x432; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44e;&#x449;&#x438;&#x435; &#x438;&#x435;&#x440;&#x43e;&#x433;&#x43b;&#x438;&#x444;&#x44b;.
        &#x414;&#x430;&#x436;&#x435; &#x43b;&#x435;&#x433;&#x43a;&#x43e; &#x434;&#x43e;&#x441;&#x442;&#x443;&#x43f;&#x43d;&#x44b;&#x439; DejaVuSans.ttf &#x438;&#x43c;&#x435;&#x435;&#x442; &#x440;&#x430;&#x437;&#x43c;&#x435;&#x440; 739 &#x43a;&#x438;&#x43b;&#x43e;&#x431;&#x430;&#x439;&#x442; (&#x432;&#x43a;&#x43b;&#x44e;&#x447;&#x435;&#x43d;&#x43e; &#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x44f;&#x437;&#x44b;&#x43a;&#x43e;&#x432;).
        &#x421;&#x43e;&#x431;&#x441;&#x442;&#x432;&#x435;&#x43d;&#x43d;&#x430;&#x44f; &#x41e;&#x420;&#x41c; &#x431;&#x438;&#x431;&#x43b;&#x438;&#x43e;&#x442;&#x435;&#x43a;&#x430; &#x43f;&#x43e;&#x437;&#x432;&#x43e;&#x43b;&#x44f;&#x435;&#x442; &#x43d;&#x435; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x431;&#x44b;&#x441;&#x442;&#x440;&#x43e; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x443; &#x441; &#x431;&#x438;&#x437;&#x43d;&#x435;&#x441; &#x43c;&#x43e;&#x434;&#x435;&#x43b;&#x44f;&#x43c;&#x438; (&#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x430; &#x43d;&#x430;&#x43a;&#x43b;&#x430;&#x434;&#x43d;&#x43e;&#x439;), &#x43d;&#x43e; &#x438; &#x43f;&#x43e;&#x437;&#x432;&#x43e;&#x43b;&#x44f;&#x435;&#x442; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x442;&#x44c; &#x441; &#x431;&#x430;&#x437;&#x43e;&#x439; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x43e;&#x43f;&#x442;&#x438;&#x43c;&#x430;&#x43b;&#x44c;&#x43d;&#x43e; &#x431;&#x44b;&#x441;&#x442;&#x440;&#x43e;, &#x43a;&#x430;&#x43a; &#x438; &#x431;&#x435;&#x437; &#x41e;&#x420;&#x41c; &#x43d;&#x430;&#x43f;&#x440;&#x44f;&#x43c;&#x443;&#x44e;.
        &#x412;&#x441;&#x435; &#x44d;&#x442;&#x43e; &#x432;&#x430;&#x436;&#x43d;&#x43e; &#x438; &#x434;&#x43b;&#x44f; &#x431;&#x44b;&#x441;&#x442;&#x440;&#x43e;&#x439; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x44b; &#x43d;&#x430; &#x441;&#x43b;&#x430;&#x431;&#x44b;&#x445; &#x443;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x441;&#x442;&#x432;&#x430;&#x445; (&#x441;&#x43c;&#x430;&#x440;&#x442;&#x444;&#x43e;&#x43d;, &#x43f;&#x43b;&#x430;&#x43d;&#x448;&#x435;&#x442;), &#x438; &#x434;&#x43b;&#x44f; &#x43d;&#x435;&#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x43e;&#x433;&#x43e; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x43d;&#x435;&#x442; &#x43c;&#x430;&#x433;&#x430;&#x437;&#x438;&#x43d;&#x430; &#x43d;&#x430; &#x441;&#x43b;&#x430;&#x431;&#x43e;&#x43c; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x435;.
      </li>
    </ul>
    
    
<p>&#x41a;&#x43e;&#x43d;&#x435;&#x447;&#x43d;&#x43e; &#x43f;&#x440;&#x43e;&#x447;&#x438;&#x442;&#x430;&#x432; &#x441;&#x442;&#x430;&#x442;&#x44c;&#x44e; &#x438; &#x43f;&#x43e;&#x43d;&#x44f;&#x432; &#x441;&#x443;&#x442;&#x44c; &#x432;&#x435;&#x434;&#x435;&#x43d;&#x438;&#x44f; &#x443;&#x447;&#x435;&#x442;&#x430; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x43e;&#x43c; &#x434;&#x432;&#x43e;&#x439;&#x43d;&#x43e;&#x439; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x438;, &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x441;&#x43a;&#x430;&#x437;&#x430;&#x442;&#x44c; &#x447;&#x442;&#x43e; &#x43b;&#x443;&#x447;&#x448;&#x435; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x44d;&#x43b;&#x435;&#x43a;&#x442;&#x440;&#x43e;&#x43d;&#x43d;&#x443;&#x44e; &#x442;&#x430;&#x431;&#x43b;&#x438;&#x446;&#x443; &#x434;&#x43b;&#x44f; &#x44d;&#x442;&#x43e;&#x433;&#x43e;. &#x41a;&#x43e;&#x43d;&#x435;&#x447;&#x43d;&#x43e; &#x43e;&#x434;&#x43d;&#x43e;&#x439; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x44c;&#x44e; &#x437;&#x434;&#x435;&#x441;&#x44c; &#x43d;&#x435; &#x43e;&#x431;&#x43e;&#x439;&#x434;&#x435;&#x442;&#x441;&#x44f;, &#x438;&#x43b;&#x438; &#x436;&#x435; &#x43f;&#x440;&#x438;&#x434;&#x435;&#x442;&#x441;&#x44f; &#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x442;&#x44c;, &#x437;&#x430;&#x442;&#x43e; &#x445;&#x43e;&#x440;&#x43e;&#x448;&#x43e; &#x437;&#x43d;&#x430;&#x43a;&#x43e;&#x43c;&#x43e; &#x438; &#x432;&#x440;&#x43e;&#x434;&#x435; &#x441;&#x43f;&#x43e;&#x434;&#x440;&#x443;&#x447;&#x43d;&#x435;&#x439;.
      &#x418; &#x43f;&#x440;&#x430;&#x439;&#x441; &#x43b;&#x438;&#x441;&#x442;&#x44b; &#x434;&#x43b;&#x44f; POS &#x442;&#x435;&#x440;&#x43c;&#x438;&#x43d;&#x430;&#x43b;&#x43e;&#x432; &#x432; &#x44d;&#x43b;&#x435;&#x43a;&#x442;&#x440;&#x43e;&#x43d;&#x43d;&#x43e;&#x439; &#x442;&#x430;&#x431;&#x43b;&#x438;&#x446;&#x435; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x441;&#x43e;&#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44c; &#x43b;&#x44e;&#x431;&#x44b;&#x435; &#x43b;&#x435;&#x433;&#x43a;&#x43e; &#x438; &#x43f;&#x440;&#x43e;&#x441;&#x442;&#x43e;. &#x41d;&#x43e; &#x435;&#x441;&#x43b;&#x438; &#x433;&#x43e;&#x432;&#x43e;&#x440;&#x438;&#x442;&#x44c; &#x43e; &#x440;&#x43e;&#x441;&#x442;&#x435;, &#x43e; &#x43c;&#x43d;&#x43e;&#x433;&#x43e;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44c;&#x441;&#x43a;&#x43e;&#x439; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x435;, &#x442;&#x43e; &#x44d;&#x43b;&#x435;&#x43a;&#x442;&#x440;&#x43e;&#x43d;&#x43d;&#x430;&#x44f; &#x442;&#x430;&#x431;&#x43b;&#x438;&#x446;&#x430; &#x43f;&#x43b;&#x43e;&#x445;&#x43e;&#x439; &#x432;&#x44b;&#x431;&#x43e;&#x440;.
      &#x41d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x430; &#x441;&#x440;&#x435;&#x434;&#x44b; &#x43a;&#x43e;&#x43c;&#x43f;&#x438;&#x43b;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; (&#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f;) &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;&#x2122; &#x418;&#x421;&#x41f; &#x43d;&#x435; &#x441;&#x43b;&#x43e;&#x436;&#x43d;&#x430;. &#x412; &#x43e;&#x442;&#x43b;&#x438;&#x447;&#x438;&#x438; &#x43e;&#x442; &#x44d;&#x43b;&#x435;&#x43a;&#x442;&#x440;&#x43e;&#x43d;&#x43d;&#x44b;&#x445; &#x442;&#x430;&#x431;&#x43b;&#x438;&#x446;, &#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x430; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x44f; &#x43d;&#x430; &#x414;&#x436;&#x430;&#x432;&#x430; &#x43f;&#x43e;&#x437;&#x432;&#x43e;&#x43b;&#x44f;&#x44e;&#x442; &#x432;&#x44b;&#x44f;&#x432;&#x43b;&#x44f;&#x442;&#x44c; &#x43c;&#x43d;&#x43e;&#x433;&#x438;&#x435; &#x43b;&#x43e;&#x433;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x435; &#x43e;&#x448;&#x438;&#x431;&#x43a;&#x438;.
      &#x412; &#x44d;&#x43b;&#x435;&#x43a;&#x442;&#x440;&#x43e;&#x43d;&#x43d;&#x43e;&#x439; &#x442;&#x430;&#x431;&#x43b;&#x438;&#x446;&#x435; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x441;&#x442;&#x43e;&#x43b;&#x43a;&#x43d;&#x443;&#x442;&#x44c;&#x441;&#x44f; &#x441; &#x43f;&#x440;&#x43e;&#x431;&#x43b;&#x435;&#x43c;&#x43e;&#x439; &#x43f;&#x440;&#x438; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x435; &#x441; &#x447;&#x438;&#x441;&#x43b;&#x430;&#x43c;&#x438; &#x441; &#x43f;&#x43b;&#x430;&#x432;&#x430;&#x44e;&#x449;&#x435;&#x439; &#x442;&#x43e;&#x447;&#x43a;&#x43e;&#x439;, &#x432; &#x414;&#x436;&#x430;&#x432;&#x435; &#x436;&#x435; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44f; &#x411;&#x438;&#x433;&#x414;&#x435;&#x446;&#x438;&#x43c;&#x430;&#x43b; &#x43f;&#x43e; &#x448;&#x430;&#x431;&#x43b;&#x43e;&#x43d;&#x443; &#x438; &#x431;&#x435;&#x437; &#x43f;&#x440;&#x43e;&#x431;&#x43b;&#x435;&#x43c;.</p>

     </div>
<div class="section">
<h4>&#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x443;&#x447;&#x435;&#x442;&#x430; &#x43a;&#x43e;&#x43c;&#x43c;&#x435;&#x440;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x439; &#x434;&#x435;&#x44f;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x43f;&#x440;&#x435;&#x434;&#x43f;&#x440;&#x438;&#x44f;&#x442;&#x438;&#x44f; &#x43c;&#x430;&#x43b;&#x43e;&#x433;&#x43e; &#x431;&#x438;&#x437;&#x43d;&#x435;&#x441;&#x430; &#x43f;&#x43e; &#x440;&#x44b;&#x43d;&#x43e;&#x447;&#x43d;&#x44b;&#x43c; &#x43f;&#x440;&#x430;&#x432;&#x438;&#x43b;&#x430;&#x43c; &#x432; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;&#x2122; &#x418;&#x421;&#x41f;.<a name="a____________."></a></h4>
     
<p>
       <b>* &#x412;&#x441;&#x44f; &#x438;&#x43d;&#x444;&#x43e;&#x440;&#x43c;&#x430;&#x446;&#x438;&#x44f; &#x43f;&#x43e; &#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x43e;&#x432;&#x43e;&#x43c;&#x443; &#x443;&#x447;&#x435;&#x442;&#x443; &#x434;&#x430;&#x43d;&#x430; &#x43b;&#x438;&#x448;&#x44c; &#x43f;&#x440;&#x438;&#x431;&#x43b;&#x438;&#x437;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;! &#x422;&#x43e;&#x447;&#x43d;&#x443;&#x44e; &#x430;&#x43a;&#x442;&#x443;&#x430;&#x43b;&#x44c;&#x43d;&#x443;&#x44e; &#x438;&#x43d;&#x444;&#x43e;&#x440;&#x43c;&#x430;&#x446;&#x438;&#x44e; &#x441;&#x43c;&#x43e;&#x442;&#x440;&#x438;&#x442;&#x435; &#x43d;&#x430; &#x441;&#x430;&#x439;&#x442;&#x435; &#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x43e;&#x432;&#x43e;&#x439; &#x441;&#x43b;&#x443;&#x436;&#x431;&#x44b;, &#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x43e;&#x432;&#x43e;&#x43c; &#x43a;&#x43e;&#x434;&#x435;&#x43a;&#x441;&#x435; &#x438; &#x432; &#x437;&#x430;&#x43a;&#x43e;&#x43d;&#x43e;&#x434;&#x430;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x44b;&#x445; &#x431;&#x430;&#x437;&#x430;&#x445; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445;.</b>
     </p>
     
<p>
        &#x41d;&#x430;&#x43b;&#x43e;&#x433;&#x43e;&#x432;&#x44b;&#x439; &#x443;&#x447;&#x435;&#x442; &#x43c;&#x430;&#x43b;&#x43e;&#x433;&#x43e; &#x431;&#x438;&#x437;&#x43d;&#x435;&#x441;&#x430; &#x43f;&#x440;&#x43e;&#x441;&#x442;. &#x414;&#x43b;&#x44f; &#x432;&#x438;&#x434;&#x43e;&#x432; &#x434;&#x435;&#x44f;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x43f;&#x43e;&#x434;&#x43b;&#x435;&#x436;&#x430;&#x449;&#x438;&#x445; &#x415;&#x41d;&#x412;&#x414; &#x434;&#x435;&#x43b;&#x430;&#x442;&#x44c; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x435;&#x439; &#x43d;&#x435; &#x43d;&#x430;&#x434;&#x43e;, &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x43f;&#x43b;&#x430;&#x442;&#x438;&#x442;&#x44c; &#x444;&#x438;&#x43a;&#x441;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x43d;&#x44b;&#x439; &#x43d;&#x430;&#x43b;&#x43e;&#x433; (&#x43d;&#x430; &#x432;&#x43c;&#x435;&#x43d;&#x435;&#x43d;&#x43d;&#x44b;&#x439; &#x434;&#x43e;&#x445;&#x43e;&#x434;) &#x438; &#x43f;&#x43e;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44c; &#x434;&#x435;&#x43a;&#x43b;&#x430;&#x440;&#x430;&#x446;&#x438;&#x44e; &#x43e;&#x431; &#x44d;&#x442;&#x43e;&#x43c;.
        &#x41f;&#x43e; &#x432;&#x438;&#x434;&#x430;&#x43c; &#x434;&#x435;&#x44f;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x43d;&#x435; &#x43f;&#x43e;&#x434;&#x43f;&#x430;&#x434;&#x430;&#x44e;&#x449;&#x438;&#x435; &#x43f;&#x43e;&#x434; &#x415;&#x41d;&#x412;&#x414; &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x432;&#x435;&#x441;&#x442;&#x438; &#x43a;&#x43d;&#x438;&#x433;&#x443; &#x443;&#x447;&#x435;&#x442;&#x430; &#x434;&#x43e;&#x445;&#x43e;&#x434;&#x43e;&#x432; &#x438; &#x440;&#x430;&#x441;&#x445;&#x43e;&#x434;&#x43e;&#x432; &#x43a;&#x430;&#x441;&#x441;&#x43e;&#x432;&#x44b;&#x43c; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x43e;&#x43c; (&#x43f;&#x43e; &#x43e;&#x43f;&#x43b;&#x430;&#x442;&#x435;). &#x420;&#x430;&#x437;&#x43d;&#x438;&#x446;&#x443; &#x443;&#x447;&#x435;&#x442;&#x430; &quot;&#x43f;&#x43e; &#x43e;&#x43f;&#x43b;&#x430;&#x442;&#x435;&quot; &#x438; &quot;&#x43f;&#x43e; &#x43e;&#x442;&#x433;&#x440;&#x443;&#x437;&#x43a;&#x435;&quot; &#x441;&#x43c;&#x43e;&#x442;&#x440;&#x438;&#x442;&#x435; &#x43d;&#x438;&#x436;&#x435;.
        &#x415;&#x441;&#x442;&#x44c; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x43d;&#x43e;&#x432;&#x430;&#x44f; &#x43f;&#x430;&#x442;&#x435;&#x43d;&#x442;&#x43d;&#x430;&#x44f; &#x441;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x430; &#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x43e;&#x43e;&#x431;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x44f;.
        &#x41a;&#x43e;&#x43c;&#x43c;&#x435;&#x440;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x439; &#x443;&#x447;&#x435;&#x442; &#x432;&#x441;&#x435;&#x433;&#x434;&#x430; &#x432;&#x435;&#x434;&#x435;&#x442;&#x441;&#x44f; &#x43f;&#x43e; &#x440;&#x44b;&#x43d;&#x43e;&#x447;&#x43d;&#x44b;&#x43c; &#x43f;&#x440;&#x430;&#x432;&#x438;&#x43b;&#x430;&#x43c; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x43e;&#x43c; &#x43d;&#x430;&#x447;&#x438;&#x441;&#x43b;&#x435;&#x43d;&#x438;&#x44f; (&#x43f;&#x43e; &#x43e;&#x442;&#x433;&#x440;&#x443;&#x437;&#x43a;&#x435;).
        &#x41f;&#x440;&#x438; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x438; &#x441;&#x43f;&#x435;&#x446;&#x438;&#x430;&#x43b;&#x438;&#x437;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x41f;&#x41e;, &#x443;&#x447;&#x435;&#x442; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x43e;&#x43c; &#x434;&#x432;&#x43e;&#x439;&#x43d;&#x43e;&#x439; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x438; &#x43d;&#x435; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x43d;&#x430;&#x438;&#x431;&#x43e;&#x43b;&#x435;&#x435; &#x43f;&#x440;&#x430;&#x432;&#x438;&#x43b;&#x44c;&#x43d;&#x44b;&#x439;, &#x43d;&#x43e; &#x438; &#x43d;&#x430;&#x438;&#x431;&#x43e;&#x43b;&#x435;&#x435; &#x44d;&#x444;&#x444;&#x435;&#x43a;&#x442;&#x438;&#x432;&#x43d;&#x44b;&#x439; - &#x434;&#x432;&#x43e;&#x439;&#x43d;&#x430;&#x44f; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x44c; &#x432;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x441;&#x44f; &#x43a;&#x430;&#x43a; &#x43e;&#x434;&#x43d;&#x430;, &#x438; &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438; &#x43f;&#x43e;&#x43f;&#x430;&#x434;&#x430;&#x435;&#x442; &#x432;&#x43e; &#x432;&#x441;&#x435; &#x43e;&#x442;&#x447;&#x435;&#x442;&#x44b;.
        &#x421;&#x43f;&#x440;&#x430;&#x432;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x438; &#x437;&#x430;&#x43f;&#x43e;&#x43b;&#x43d;&#x44f;&#x442;&#x44c; &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x43e;&#x434;&#x438;&#x43d; &#x440;&#x430;&#x437;, &#x438; &#x432; &#x43a;&#x43e;&#x43d;&#x435;&#x447;&#x43d;&#x43e;&#x43c; &#x438;&#x442;&#x43e;&#x433;&#x435; &#x442;&#x430;&#x43a;&#x43e;&#x439; &#x443;&#x447;&#x435;&#x442; &#x43c;&#x435;&#x43d;&#x435;&#x435; &#x442;&#x440;&#x443;&#x434;&#x43e;&#x435;&#x43c;&#x43e;&#x43a; &#x447;&#x435;&#x43c; &#x443;&#x447;&#x435;&#x442; &quot;&#x432; &#x442;&#x435;&#x442;&#x440;&#x430;&#x434;&#x43a;&#x435;&quot; &#x438;&#x43b;&#x438; &#x44d;&#x43b;&#x435;&#x43a;&#x442;&#x440;&#x43e;&#x43d;&#x43d;&#x43e;&#x439; &#x442;&#x430;&#x431;&#x43b;&#x438;&#x446;&#x435;.
     </p>
     
     
<p>&#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;&#x2122; &#x418;&#x421;&#x41f; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x435;&#x442; &#x43d;&#x430; &#x412;&#x415;&#x411;-&#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x435;, &#x442;.&#x435;. &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x442;&#x44c; &#x431;&#x443;&#x434;&#x435;&#x442;&#x435; &#x432; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x435;.
      &#x41b;&#x43e;&#x43a;&#x430;&#x43b;&#x44c;&#x43d;&#x44b;&#x435; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;&#x2122; &#x418;&#x421;&#x41f; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x430;&#x44e;&#x442; &#x43d;&#x430; &#x432;&#x441;&#x442;&#x440;&#x43e;&#x435;&#x43d;&#x43d;&#x43e;&#x43c;, &#x438;&#x43d;&#x442;&#x435;&#x440;&#x43d;&#x435;&#x442; &#x43d;&#x435;&#x434;&#x43e;&#x441;&#x442;&#x443;&#x43f;&#x43d;&#x43e;&#x43c; &#x412;&#x415;&#x411;-&#x441;&#x435;&#x440;&#x432;&#x435;&#x440;&#x435; &#x410;-&#x414;&#x436;&#x435;&#x442;&#x442;&#x438;.</p>
     
     
<p>&#x423;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43a;&#x430; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;&#x2122; &#x418;&#x421;&#x41f; &#x43d;&#x430; &#x43e;&#x431;&#x44b;&#x447;&#x43d;&#x44b;&#x439; &#x43a;&#x43e;&#x43c;&#x43f;&#x44c;&#x44e;&#x442;&#x435;&#x440; &#x441; &#x41c;&#x421; &#x412;&#x438;&#x43d;&#x434;&#x43e;&#x443;&#x441; &#x43d;&#x435;&#x43c;&#x43d;&#x43e;&#x433;&#x43e; &#x441;&#x43b;&#x43e;&#x436;&#x43d;&#x430; - &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x438;&#x442;&#x44c; &#x414;&#x436;&#x430;&#x432;&#x443; &#x438; &#x43a;&#x440;&#x438;&#x43f;&#x442;&#x43e;&#x43f;&#x440;&#x43e;&#x432;&#x430;&#x439;&#x434;&#x435;&#x440;. &#x412; &#x41b;&#x438;&#x43d;&#x443;&#x43a;&#x441;&#x430;&#x445; &#x432;&#x441;&#x435; &#x443;&#x436;&#x435; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43b;&#x435;&#x43d;&#x43e;.
      &#x41f;&#x43e;&#x44d;&#x442;&#x43e;&#x43c;&#x443; &#x441;&#x442;&#x43e;&#x438;&#x442; &#x43d;&#x430;&#x447;&#x430;&#x442;&#x44c; &#x441; &#x410;&#x43d;&#x434;&#x440;&#x43e;&#x438;&#x434; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; (&#x435;&#x441;&#x43b;&#x438; &#x443; &#x432;&#x430;&#x441; &#x43d;&#x435; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43b;&#x435;&#x43d; &#x41b;&#x438;&#x43d;&#x443;&#x43a;&#x441; &#x434;&#x43b;&#x44f; &#x43e;&#x431;&#x44b;&#x447;&#x43d;&#x43e;&#x433;&#x43e; &#x43a;&#x43e;&#x43c;&#x43f;&#x44c;&#x44e;&#x442;&#x435;&#x440;&#x430;), &#x442;.&#x43a;. &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x435; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x435; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x430;&#x432;&#x43b;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x43a;&#x430;&#x43a; &#x43b;&#x44e;&#x431;&#x44b;&#x435; &#x434;&#x440;&#x443;&#x433;&#x438;&#x435;. &#x412;&#x44b; &#x43c;&#x43e;&#x436;&#x435;&#x442;&#x435; &#x43d;&#x430;&#x439;&#x442;&#x438; &#x435;&#x433;&#x43e; &#x432; &#x413;&#x443;&#x433;&#x43b; &#x41f;&#x43b;&#x44d;&#x439; &#x41c;&#x430;&#x440;&#x43a;&#x435;&#x442; &#x43f;&#x43e; &#x441;&#x43b;&#x43e;&#x432;&#x443; &quot;&#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442; &#x418;&#x43d;&#x444;&#x43e;&#x440;&#x43c;&#x430;&#x446;&#x438;&#x43e;&#x43d;&#x43d;&#x430;&#x44f; &#x421;&#x438;&#x441;&#x442;&#x435;&#x43c;&#x430; &#x41f;&#x440;&#x435;&#x434;&#x43f;&#x440;&#x438;&#x44f;&#x442;&#x438;&#x44f;&quot;.
     </p>
     
     
<p>
       <b>* &#x414;&#x43b;&#x44f; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x44b; &#x441; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x43c; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x435;&#x43c; &#x432;&#x430;&#x43c; &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x438;&#x437;&#x443;&#x447;&#x438;&#x442;&#x44c; &#x438; &#x43f;&#x440;&#x438;&#x43d;&#x44f;&#x442;&#x44c; &#x443;&#x441;&#x43b;&#x43e;&#x432;&#x438;&#x44f; &#x43f;&#x43e;&#x43b;&#x438;&#x442;&#x438;&#x43a;&#x438; &#x43a;&#x43e;&#x43d;&#x444;&#x438;&#x434;&#x435;&#x43d;&#x446;&#x438;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x438;.</b>
     </p>
          
      
<p>
       &#x41f;&#x43e;&#x441;&#x43b;&#x435; &#x437;&#x430;&#x43f;&#x443;&#x441;&#x43a;&#x430; &#x432;&#x430;&#x43c; &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x43f;&#x440;&#x438;&#x434;&#x443;&#x43c;&#x430;&#x442;&#x44c; &#x43d;&#x43e;&#x43c;&#x435;&#x440; &#x410;-&#x414;&#x436;&#x435;&#x442;&#x442;&#x438; &#x438; &#x43d;&#x430;&#x434;&#x435;&#x436;&#x43d;&#x44b;&#x439; &#x43f;&#x430;&#x440;&#x43e;&#x43b;&#x44c;. &#x414;&#x43b;&#x44f; &#x43f;&#x430;&#x440;&#x43e;&#x43b;&#x44f; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x439;&#x442;&#x435; 2-3 &#x441;&#x43b;&#x43e;&#x432;&#x430; &#x43d;&#x430; &#x43b;&#x430;&#x442;&#x438;&#x43d;&#x438;&#x446;&#x435; &#x43f;&#x43e;&#x43b;&#x44e;&#x441; 3-4 &#x446;&#x438;&#x444;&#x440;&#x44b;.
       &#x41f;&#x43e;&#x441;&#x43b;&#x435; &#x437;&#x430;&#x43f;&#x443;&#x441;&#x43a;&#x430; &#x43a;&#x43d;&#x43e;&#x43f;&#x43a;&#x430; &#x43e;&#x442;&#x43a;&#x440;&#x44b;&#x442;&#x438;&#x44f; &#x43f;&#x43e;&#x43a;&#x430;&#x437;&#x44b;&#x432;&#x430;&#x435;&#x442; &#x430;&#x434;&#x440;&#x435;&#x441;:
      </p>
      
<p align="center"><img src="1.1/ivst1.png" style="max-width: 100%" alt="" /></p>
      
<p align="center"><img src="1.1/ivst2.png" style="max-width: 100%" alt="" /></p>
      
<p align="center"><img src="1.1/ivst3.png" style="max-width: 100%" alt="" /></p>
      
<p>
       &#x41f;&#x43e;&#x441;&#x43b;&#x435; &#x43d;&#x430;&#x436;&#x430;&#x442;&#x438;&#x44f; &#x43a;&#x43d;&#x43e;&#x43f;&#x43a;&#x438;, &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440; &#x438;&#x437;&#x432;&#x435;&#x449;&#x430;&#x435;&#x442; &#x43e;&#x431; &#x43f;&#x43e;&#x442;&#x435;&#x43d;&#x446;&#x438;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x439; &#x43e;&#x43f;&#x430;&#x441;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x434;&#x43b;&#x44f; &#x432;&#x432;&#x43e;&#x434;&#x438;&#x43c;&#x44b;&#x445; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445;:
      </p>
       
<p align="center"><img src="images/ivhttps.png" style="max-width: 100%" alt="" /></p>
       
<p>
       &#x41d;&#x430; &#x441;&#x430;&#x43c;&#x43e;&#x43c; &#x434;&#x435;&#x43b;&#x435; &#x43f;&#x43e;&#x434;&#x43a;&#x43b;&#x44e;&#x447;&#x435;&#x43d;&#x438;&#x435; &#x448;&#x438;&#x444;&#x440;&#x443;&#x435;&#x442;&#x441;&#x44f;, &#x442;.&#x435;. &#x43d;&#x438;&#x43a;&#x442;&#x43e; &#x43d;&#x435; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x43f;&#x440;&#x43e;&#x447;&#x438;&#x442;&#x430;&#x442;&#x44c; &#x437;&#x430;&#x448;&#x438;&#x444;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x43d;&#x44b;&#x439; &#x442;&#x440;&#x430;&#x444;&#x438;&#x43a;, &#x43f;&#x440;&#x43e;&#x441;&#x442;&#x43e; HTTPS &#x441;&#x435;&#x440;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442; &#x410;-&#x414;&#x436;&#x435;&#x442;&#x442;&#x438; &#x43f;&#x43e;&#x434;&#x43f;&#x438;&#x441;&#x430;&#x43d; &#x43d;&#x435;&#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43d;&#x44b;&#x43c; &#x443;&#x434;&#x43e;&#x441;&#x442;&#x43e;&#x432;&#x435;&#x440;&#x44f;&#x44e;&#x449;&#x438;&#x43c; &#x446;&#x435;&#x43d;&#x442;&#x440;&#x43e;&#x43c; (&#x446;&#x435;&#x43d;&#x442;&#x440;&#x43e;&#x43c; &#x441;&#x435;&#x440;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x446;&#x438;&#x438;).
       &#x412;&#x44b; &#x43c;&#x43e;&#x436;&#x435;&#x442;&#x435; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x438;&#x442;&#x44c; &#x441;&#x435;&#x440;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442; &#x443;&#x434;&#x43e;&#x441;&#x442;&#x43e;&#x432;&#x435;&#x440;&#x44f;&#x44e;&#x449;&#x435;&#x433;&#x43e; &#x446;&#x435;&#x43d;&#x442;&#x440;&#x430; - &#x444;&#x430;&#x439;&#x43b; ajetty-ca.pem. &#x421;&#x43d;&#x430;&#x447;&#x430;&#x43b;&#x430; &#x44d;&#x43a;&#x441;&#x43f;&#x43e;&#x440;&#x442;&#x438;&#x440;&#x443;&#x439;&#x442;&#x435; &#x435;&#x433;&#x43e; &#x438;&#x437; &#x43f;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43d;&#x43e;&#x433;&#x43e; &#x445;&#x440;&#x430;&#x43d;&#x438;&#x43b;&#x438;&#x449;&#x430; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x44f; &#x432; &#x43e;&#x431;&#x449;&#x435;&#x435; &#x445;&#x440;&#x430;&#x43d;&#x438;&#x43b;&#x438;&#x449;&#x435; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44f; &#x441;&#x442;&#x430;&#x440;&#x442;&#x43e;&#x432;&#x44b;&#x439; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; (&#x441;&#x43c;&#x43e;&#x442;&#x440;&#x438;&#x442;&#x435; &#x441;&#x43a;&#x440;&#x438;&#x43d;&#x448;&#x43e;&#x442;&#x44b; &#x432;&#x44b;&#x448;&#x435;). &#x414;&#x430;&#x43b;&#x435;&#x435; &#x43d;&#x430;&#x436;&#x438;&#x43c;&#x430;&#x435;&#x43c;: &#x41d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x438; - &#x411;&#x435;&#x437;&#x43e;&#x43f;&#x430;&#x441;&#x43d;&#x43e;&#x441;&#x442;&#x44c; - &#x423;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x438;&#x442;&#x44c; &#x441;&#x435;&#x440;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442; &#x441; &#x43d;&#x43e;&#x441;&#x438;&#x442;&#x435;&#x43b;, &#x438; &#x432;&#x44b;&#x431;&#x438;&#x440;&#x430;&#x435;&#x43c; &#x444;&#x430;&#x439;&#x43b; &#x438;&#x437; &#x43e;&#x431;&#x449;&#x435;&#x433;&#x43e; &#x445;&#x440;&#x430;&#x43d;&#x438;&#x43b;&#x438;&#x449;&#x430;:
       </p>
      
<p align="center"><img src="images/ivcert1.png" style="max-width: 100%" alt="" /></p>
      
<p align="center"><img src="images/ivcert2.png" style="max-width: 100%" alt="" /></p>
      
<p>
       &#x41d;&#x43e; &#x43f;&#x43e;&#x441;&#x43b;&#x435; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43a;&#x438; &#x441;&#x435;&#x440;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442;&#x430; &#x423;&#x426; &#x410;&#x43d;&#x434;&#x440;&#x43e;&#x438;&#x434; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43f;&#x443;&#x433;&#x430;&#x442;&#x44c; &quot;&#x414;&#x43e;&#x432;&#x435;&#x440;&#x435;&#x43d;&#x43d;&#x44b;&#x439; &#x441;&#x435;&#x440;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442; &#x43d;&#x430; &#x443;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x441;&#x442;&#x432;&#x435; &#x43f;&#x43e;&#x437;&#x432;&#x43e;&#x43b;&#x44f;&#x435;&#x442; &#x43f;&#x43e;&#x441;&#x442;&#x43e;&#x440;&#x43e;&#x43d;&#x43d;&#x438;&#x43c; &#x43e;&#x442;&#x441;&#x43b;&#x435;&#x436;&#x438;&#x432;&#x430;&#x442;&#x44c; &#x432;&#x430;&#x448;&#x443; &#x441;&#x435;&#x442;&#x435;&#x432;&#x443;&#x44e; &#x430;&#x43a;&#x442;&#x438;&#x432;&#x43d;&#x43e;&#x441;&#x442;&#x44c;...&quot;:
     </p>
     
<p align="center"><img src="images/ivcerterr.png" style="max-width: 100%" alt="" /></p>
     
<p>
       &#x412;&#x43e; &#x43f;&#x435;&#x440;&#x432;&#x44b;&#x445;, &#x441;&#x435;&#x440;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442; &#x423;&#x426; &#x410;-&#x414;&#x436;&#x435;&#x442;&#x442;&#x438; &#x441;&#x43e;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43d;&#x43d;&#x43e; &#x442;&#x430;&#x43a;&#x43e;&#x439; &#x436;&#x435; &#x43a;&#x430;&#x43a; &#x438; &#x43c;&#x43d;&#x43e;&#x436;&#x435;&#x441;&#x442;&#x432;&#x43e; &#x443;&#x436;&#x435; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43b;&#x435;&#x43d;&#x43d;&#x44b;&#x445;. &#x41f;&#x43e;&#x441;&#x43c;&#x43e;&#x442;&#x440;&#x438;&#x442;&#x435; &#x43f;&#x43e;&#x434;&#x43e;&#x431;&#x43d;&#x44b;&#x435; &#x441;&#x435;&#x440;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442;&#x44b; &#x432; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x435; &#x43e;&#x431;&#x44b;&#x447;&#x43d;&#x43e;&#x433;&#x43e; &#x43a;&#x43e;&#x43c;&#x43f;&#x44c;&#x44e;&#x442;&#x435;&#x440;&#x430;.
       &#x412;&#x43e; &#x432;&#x442;&#x43e;&#x440;&#x44b;&#x445;, &#x43d;&#x430; &#x442;&#x435;&#x43a;&#x443;&#x449;&#x435;&#x439; &#x441;&#x442;&#x430;&#x434;&#x438;&#x438; &#x432;&#x430;&#x43c; &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x43b;&#x438;&#x448;&#x44c; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x438;&#x442;&#x44c; &#x444;&#x443;&#x43d;&#x43a;&#x446;&#x438;&#x43e;&#x43d;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x44c; &#x41f;&#x41e;, &#x438; &#x432;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x44c; &#x43a;&#x43e;&#x43c;&#x43c;&#x435;&#x440;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x435; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x43d;&#x435; &#x43d;&#x443;&#x436;&#x43d;&#x43e;.
       &#x412; &#x442;&#x440;&#x435;&#x442;&#x44c;&#x438;&#x445;, &#x441;&#x435;&#x440;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442;&#x44b; &#x433;&#x435;&#x43d;&#x435;&#x440;&#x438;&#x440;&#x443;&#x44e;&#x442;&#x441;&#x44f; &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438; &#x43f;&#x440;&#x438; &#x43f;&#x435;&#x440;&#x432;&#x43e;&#x43c; &#x441;&#x442;&#x430;&#x440;&#x442;&#x435;, &#x43a;&#x43b;&#x44e;&#x447;&#x438; (&#x432; &#x442;&#x43e;&#x43c; &#x447;&#x438;&#x441;&#x43b;&#x435; &#x438; &#x43e;&#x442; &#x423;&#x426;) &#x445;&#x440;&#x430;&#x43d;&#x44f;&#x442;&#x441;&#x44f; &#x432; &#x43c;&#x435;&#x441;&#x442;&#x435; &#x43d;&#x435;&#x434;&#x43e;&#x441;&#x442;&#x443;&#x43f;&#x43d;&#x43e;&#x43c; &#x434;&#x440;&#x443;&#x433;&#x43e;&#x43c;&#x443; &#x41f;&#x41e;. 
       &#x41c;&#x43e;&#x436;&#x43d;&#x43e; &#x43d;&#x435; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x430;&#x432;&#x43b;&#x438;&#x432;&#x430;&#x442;&#x44c; &#x441;&#x435;&#x440;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442; &#x423;&#x426;, &#x43f;&#x440;&#x43e;&#x441;&#x442;&#x43e; &#x43d;&#x430;&#x436;&#x43c;&#x438;&#x442;&#x435; &#x43d;&#x430; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;&#x435; &#x434;&#x43e;&#x43f;&#x43e;&#x43b;&#x43d;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e; &#x438; &quot;&#x43f;&#x435;&#x440;&#x435;&#x439;&#x442;&#x438; &#x43d;&#x430; localhost(&#x43d;&#x435;&#x431;&#x435;&#x437;&#x43e;&#x43f;&#x430;&#x441;&#x43d;&#x43e;)&quot;. &#x412; &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x43c; &#x441;&#x43b;&#x443;&#x447;&#x430;&#x435; &#x442;&#x440;&#x430;&#x444;&#x438;&#x43a; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x448;&#x438;&#x444;&#x440;&#x43e;&#x432;&#x430;&#x442;&#x44c;&#x441;&#x44f;, &#x438; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43d;&#x43e;&#x435; &#x43e;&#x431;&#x435;&#x441;&#x43f;&#x435;&#x447;&#x435;&#x43d;&#x438;&#x435; &#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x43e;&#x435; &#x43c;&#x43e;&#x436;&#x435;&#x442; &#x43f;&#x435;&#x440;&#x435;&#x445;&#x432;&#x430;&#x442;&#x44b;&#x432;&#x430;&#x442;&#x44c; &#x442;&#x440;&#x430;&#x444;&#x438;&#x43a; &#x43b;&#x43e;&#x43a;&#x430;&#x43b;&#x44c;&#x43d;&#x43e; (&#x43f;&#x435;&#x440;&#x435;&#x445;&#x432;&#x430;&#x442;&#x44b;&#x432;&#x430;&#x442;&#x44c; TCP &#x43f;&#x43e;&#x440;&#x442;) &#x43d;&#x435; &#x441;&#x43c;&#x43e;&#x436;&#x435;&#x442; &#x440;&#x430;&#x441;&#x448;&#x438;&#x444;&#x440;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x412;&#x430;&#x448;&#x438; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x435;.
     </p>
     
<p>
       <b>* &#x421;&#x43e;&#x43e;&#x431;&#x449;&#x435;&#x43d;&#x438;&#x435; &quot;&#x414;&#x43e;&#x432;&#x435;&#x440;&#x435;&#x43d;&#x43d;&#x44b;&#x439; &#x441;&#x435;&#x440;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442; &#x43d;&#x430; &#x443;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x441;&#x442;&#x432;&#x435; &#x43f;&#x43e;&#x437;&#x432;&#x43e;&#x43b;&#x44f;&#x435;&#x442; &#x43f;&#x43e;&#x441;&#x442;&#x43e;&#x440;&#x43e;&#x43d;&#x43d;&#x438;&#x43c; &#x43e;&#x442;&#x441;&#x43b;&#x435;&#x436;&#x438;&#x432;&#x430;&#x442;&#x44c; &#x432;&#x430;&#x448;&#x443; &#x441;&#x435;&#x442;&#x435;&#x432;&#x443;&#x44e; &#x430;&#x43a;&#x442;&#x438;&#x432;&#x43d;&#x43e;&#x441;&#x442;&#x44c;...&quot; &#x43f;&#x43e;&#x441;&#x43b;&#x435; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43a;&#x438; &#x441;&#x435;&#x440;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442;&#x430; &#x423;&#x426; &#x43e;&#x442;&#x441;&#x443;&#x442;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442; &#x43d;&#x435;&#x43a;&#x43e;&#x442;&#x43e;&#x440;&#x44b;&#x445; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44f;&#x445; &#x410;&#x43d;&#x434;&#x440;&#x43e;&#x438;&#x434;&#x430;, &#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x43d;&#x430; &#x410;&#x43d;&#x434;&#x440;&#x43e;&#x438;&#x434; 7.0. &#x41d;&#x43e;&#x432;&#x435;&#x439;&#x448;&#x438;&#x435; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x410;&#x43d;&#x434;&#x440;&#x43e;&#x438;&#x434;&#x430; &#x43c;&#x43e;&#x433;&#x443;&#x442; &#x432;&#x44b;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x44c; &#x43f;&#x440;&#x435;&#x434;&#x443;&#x43f;&#x440;&#x435;&#x436;&#x434;&#x435;&#x43d;&#x438;&#x435; &quot;&#x423;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43b;&#x435;&#x43d; &#x441;&#x435;&#x440;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442; &#x423;&#x426;&quot;.</b>
     </p>
     
<p>&#x427;&#x430;&#x441;&#x442;&#x44c; &#x441;&#x43d;&#x438;&#x43c;&#x43a;&#x43e;&#x432; &#x44d;&#x43a;&#x440;&#x430;&#x43d;&#x430; &#x441;&#x434;&#x435;&#x43b;&#x430;&#x43d;&#x44b; &#x441; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43b;&#x435;&#x43d;&#x43d;&#x44b;&#x43c; &#x441;&#x435;&#x440;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442;&#x43e;&#x43c; (&#x441;&#x435;&#x440;&#x44b;&#x439; &#x437;&#x430;&#x43c;&#x43e;&#x43a; &#x432; &#x430;&#x434;&#x440;&#x435;&#x441;&#x435;), &#x447;&#x430;&#x441;&#x442;&#x44c; - &#x43d;&#x435;&#x442; (&#x432;&#x43e;&#x441;&#x43a;&#x43b;&#x438;&#x446;&#x430;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x44b;&#x439; &#x437;&#x43d;&#x430;&#x43a; &#x432; &#x442;&#x440;&#x435;&#x443;&#x433;&#x43e;&#x43b;&#x44c;&#x43d;&#x438;&#x43a;&#x435;)</p>
     
<p>
       &#x41f;&#x440;&#x435;&#x434;&#x43f;&#x43e;&#x43b;&#x43e;&#x436;&#x438;&#x43c; &#x447;&#x442;&#x43e; &#x418;.&#x41f;. &#x418;&#x432;&#x430;&#x43d;&#x43e;&#x432; &#x432;&#x435;&#x434;&#x435;&#x442; &#x434;&#x435;&#x44f;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x44c; &#x43f;&#x43e; &#x440;&#x430;&#x437;&#x432;&#x43e;&#x437;&#x43a;&#x435; &#x44e;&#x440;&#x438;&#x434;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x445; &#x438; &#x444;&#x438;&#x437;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x445; &#x43b;&#x438;&#x446; &#x438; &#x438;&#x445; &#x433;&#x440;&#x443;&#x437;&#x430; &#x441; &#x43d;&#x430;&#x447;&#x430;&#x43b;&#x430; 2019 &#x433;&#x43e;&#x434;&#x430;, &#x438; &#x447;&#x442;&#x43e; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x439; &#x432;&#x438;&#x434; &#x434;&#x435;&#x44f;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x43e;&#x431;&#x43b;&#x430;&#x433;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x415;&#x41d;&#x412;&#x414; 2500 &#x440;&#x443;&#x431;&#x43b;&#x435;&#x439; &#x432; &#x43c;&#x435;&#x441;&#x44f;&#x446;.
     </p>
     
<p><i>* &#x412; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x440;&#x430;&#x437;&#x432;&#x43e;&#x437; &#x434;&#x43b;&#x44f; &#x42e;&#x41b; &#x441;&#x43a;&#x43e;&#x440;&#x435;&#x435; &#x432;&#x441;&#x435;&#x433;&#x43e; &#x43e;&#x442;&#x434;&#x435;&#x43b;&#x44c;&#x43d;&#x44b;&#x439; &#x432;&#x438;&#x434; &#x434;&#x435;&#x44f;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x438; &#x43f;&#x43e;&#x434; &#x415;&#x41d;&#x412;&#x414; &#x43d;&#x435; &#x43f;&#x43e;&#x434;&#x43f;&#x430;&#x434;&#x430;&#x435;&#x442;!</i></p>
     
<p>
     &#x414;&#x43b;&#x44f; &#x43d;&#x430;&#x447;&#x430;&#x43b;&#x430; &#x43d;&#x430;&#x447;&#x43d;&#x435;&#x43c; &#x441; &#x43a;&#x43e;&#x43d;&#x446;&#x430;, &#x44d;&#x442;&#x43e; &#x431;&#x430;&#x43b;&#x430;&#x43d;&#x441; &#x43e;&#x431;&#x449;&#x438;&#x439; &#x43d;&#x430; &#x43a;&#x43e;&#x43d;&#x435;&#x446; &#x44f;&#x43d;&#x432;&#x430;&#x440;&#x44f;: 
     </p>
     
<p align="center"><img src="images/ivball.png" style="max-width: 100%" alt="" /></p>
     
<p><i>* &#x414;&#x43b;&#x44f; &#x434;&#x435;&#x43c;&#x43e;&#x43d;&#x441;&#x442;&#x440;&#x430;&#x446;&#x438;&#x438; &#x440;&#x430;&#x437;&#x43b;&#x438;&#x447;&#x438;&#x44f; &#x43a;&#x430;&#x441;&#x441;&#x43e;&#x432;&#x43e;&#x433;&#x43e; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x430; &#x438; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x430; &#x43d;&#x430;&#x447;&#x438;&#x441;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x438; &#x432; &#x43a;&#x43e;&#x43c;&#x43c;&#x435;&#x440;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x439; &#x431;&#x443;&#x445;&#x433;&#x430;&#x43b;&#x442;&#x435;&#x440;&#x438;&#x438; &#x431;&#x443;&#x434;&#x443;&#x442; &#x441;&#x43e;&#x43f;&#x440;&#x43e;&#x432;&#x43e;&#x436;&#x434;&#x435;&#x43d;&#x44b; &#x43a;&#x43e;&#x43c;&#x43c;&#x435;&#x43d;&#x442;&#x430;&#x440;&#x438;&#x44f;&#x43c;&#x438; &#x43e; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x44f;&#x445; &#x432; &#x43a;&#x43d;&#x438;&#x433;&#x435; &#x443;&#x447;&#x435;&#x442;&#x430; &#x434;&#x43e;&#x445;&#x43e;&#x434;&#x43e;&#x432; &#x438; &#x440;&#x430;&#x441;&#x445;&#x43e;&#x434;&#x43e;&#x432; &#x43f;&#x43e; &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x439; &#x43e;&#x43f;&#x435;&#x440;&#x430;&#x446;&#x438;&#x438;.</i></p>
     
<p>
       &#x411;&#x430;&#x43b;&#x430;&#x43d;&#x441; &#x43f;&#x43e;&#x43a;&#x430;&#x437;&#x44b;&#x432;&#x430;&#x435;&#x442; &#x447;&#x442;&#x43e; &#x440;&#x44b;&#x43d;&#x43e;&#x447;&#x43d;&#x430;&#x44f; &#x441;&#x442;&#x43e;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x44c; &#x431;&#x438;&#x437;&#x43d;&#x435;&#x441;&#x430; &#x440;&#x430;&#x432;&#x43d;&#x430; 414 790.00 &#x440;&#x443;&#x431;&#x43b;&#x435;&#x439;. &#x42d;&#x442;&#x43e; &#x430;&#x43a;&#x442;&#x438;&#x432;&#x44b; (&#x413;&#x430;&#x437;&#x435;&#x43b;&#x44c;, &#x434;&#x435;&#x43d;&#x44c;&#x433;&#x438;, &#x413;&#x421;&#x41c;, &#x43c;&#x43d;&#x435; &#x434;&#x43e;&#x43b;&#x436;&#x43d;&#x44b;) &#x43c;&#x438;&#x43d;&#x443;&#x441; &#x43f;&#x430;&#x441;&#x441;&#x438;&#x432;&#x44b; (&#x44f; &#x434;&#x43e;&#x43b;&#x436;&#x435;&#x43d;).
     </p>
     
<p>
       &#x420;&#x430;&#x441;&#x441;&#x43c;&#x43e;&#x442;&#x440;&#x438;&#x43c; &#x434;&#x435;&#x442;&#x430;&#x43b;&#x44c;&#x43d;&#x44b;&#x439; (&#x43d;&#x435;&#x437;&#x430;&#x43a;&#x440;&#x44b;&#x442;&#x44b;&#x439;) &#x431;&#x430;&#x43b;&#x430;&#x43d;&#x441;:
     </p>
     
<p align="center"><img src="images/ivbald.png" style="max-width: 100%" alt="" /></p>
     
<p>&#x41e;&#x43d; &#x433;&#x43b;&#x430;&#x441;&#x438;&#x442; &#x447;&#x442;&#x43e; &#x413;&#x430;&#x437;&#x435;&#x43b;&#x44c; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x43f;&#x440;&#x43e;&#x434;&#x430;&#x442;&#x44c; &#x437;&#x430; 288000 &#x440;&#x443;&#x431;, &#x431;&#x435;&#x43d;&#x437;&#x438;&#x43d;&#x430; &#x43d;&#x430; 750 &#x440;&#x443;&#x431;&#x43b;&#x435;&#x439;, &#x434;&#x43e;&#x43b;&#x433; &#x418;.&#x41f;.&#x421;&#x438;&#x434;&#x43e;&#x440;&#x43e;&#x432;&#x443; 2689&#x440;&#x443;&#x431;, &#x415;&#x41d;&#x412;&#x414; &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x437;&#x430;&#x43f;&#x43b;&#x430;&#x442;&#x438;&#x442;&#x44c; 2500&#x440;&#x443;&#x431;.
     &#x412;&#x430;&#x43b;&#x43e;&#x432;&#x44b;&#x439; &#x434;&#x43e;&#x445;&#x43e;&#x434; &#x441; &#x43d;&#x430;&#x447;&#x430;&#x43b;&#x430; &#x434;&#x435;&#x44f;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x438;: 9918&#x440;&#x443;&#x431; &#x424;&#x41b;, 28987&#x42e;&#x41b;. &#x412;&#x430;&#x43b;&#x43e;&#x432;&#x44b;&#x435; &#x440;&#x430;&#x441;&#x445;&#x43e;&#x434;&#x44b; &#x441; &#x43d;&#x430;&#x447;&#x430;&#x43b;&#x430; &#x434;&#x435;&#x44f;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x438;: &#x413;&#x421;&#x41c;-7481 &#x440;&#x443;&#x431; &#x438; &#x442;&#x430;&#x43a; &#x434;&#x430;&#x43b;&#x435;&#x435;.
     </p>
      
<p>
       &#x417;&#x430;&#x43f;&#x438;&#x441;&#x438; &#x43f;&#x43e; &#x441;&#x447;&#x435;&#x442;&#x443; &#x437;&#x430; &#x43f;&#x435;&#x440;&#x438;&#x43e;&#x434;  &#x43f;&#x43e;&#x43a;&#x430;&#x437;&#x44b;&#x432;&#x430;&#x435;&#x442; &#x43e;&#x442;&#x447;&#x435;&#x442; &#x43f;&#x43e; &#x441;&#x447;&#x435;&#x442;&#x443;, &#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x434;&#x43e;&#x445;&#x43e;&#x434;&#x44b; &#x438; &#x440;&#x430;&#x441;&#x445;&#x43e;&#x434;&#x44b; &#x441; &#x43d;&#x430;&#x447;&#x430;&#x43b;&#x430; &#x434;&#x435;&#x44f;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x438;:
      </p>
      
<p align="center"><img src="images/ivosdoh.png" style="max-width: 100%" alt="" /></p>
      
<p align="center"><img src="images/ivosras.png" style="max-width: 100%" alt="" /></p>
     
<p>
       &#x412;&#x435;&#x434;&#x435;&#x43d;&#x438;&#x435; &#x443;&#x447;&#x435;&#x442;&#x430; &#x43d;&#x430;&#x447;&#x438;&#x43d;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x441; &#x437;&#x430;&#x43f;&#x43e;&#x43b;&#x43d;&#x435;&#x43d;&#x438;&#x44f; &#x43f;&#x43b;&#x430;&#x43d;&#x430; &#x441;&#x447;&#x435;&#x442;&#x43e;&#x432;:
       
<p align="center"><img src="images/ivchartacc.png" style="max-width: 100%" alt="" /></p>
       &#x41d;&#x43e;&#x43c;&#x435;&#x440;&#x430; &#x441;&#x447;&#x435;&#x442;&#x43e;&#x432;: 1000-&#x44b;&#x435; - &#x430;&#x43a;&#x442;&#x438;&#x432;&#x44b;, 2000-&#x435;&#x44b; &#x43f;&#x430;&#x441;&#x441;&#x438;&#x432;&#x44b;, 3000-&#x44b;&#x435; - &#x43e;&#x441;&#x43d;&#x43e;&#x432;&#x43d;&#x43e;&#x439; &#x43a;&#x430;&#x43f;&#x438;&#x442;&#x430;&#x43b;, &#x434;&#x430;&#x43b;&#x435;&#x435; &#x432;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x43d;&#x44b;&#x435; &#x441;&#x447;&#x435;&#x442;&#x430; &quot;&#x434;&#x43e;&#x445;&#x43e;&#x434;&#x44b; &#x438; &#x440;&#x430;&#x441;&#x445;&#x43e;&#x434;&#x44b; &#x43f;&#x43e;&#x434;&#x43b;&#x435;&#x436;&#x430;&#x449;&#x438;&#x435; &#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x43e;&#x432;&#x43e;&#x43c;&#x443; &#x443;&#x447;&#x435;&#x442;&#x443;&quot; (&#x437;&#x434;&#x435;&#x441;&#x44c; &#x43d;&#x435; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44e;&#x442;&#x441;&#x44f;).
     
     
<p>
       &#x414;&#x43b;&#x44f; &#x433;&#x438;&#x431;&#x43a;&#x43e;&#x441;&#x442;&#x438; &#x441;&#x447;&#x435;&#x442; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x442; &#x432; &#x43a;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x441;&#x443;&#x431;&#x441;&#x447;&#x435;&#x442;&#x430; &#x441;&#x43f;&#x440;&#x430;&#x432;&#x43e;&#x447;&#x43d;&#x438;&#x43a;, &#x43d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x441;&#x447;&#x435;&#x442; &quot;&#x421;&#x43a;&#x43b;&#x430;&#x434;&quot; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x442; &#x441;&#x43f;&#x440;&#x430;&#x432;&#x43e;&#x447;&#x43d;&#x438;&#x43a; &quot;&#x41a;&#x430;&#x442;&#x435;&#x433;&#x43e;&#x440;&#x438;&#x44f; &#x43d;&#x43e;&#x43c;&#x435;&#x43d;&#x43a;&#x43b;&#x430;&#x442;&#x443;&#x440;&#x44b;&quot;, &#x441;&#x447;&#x435;&#x442; &quot;&#x411;&#x430;&#x43d;&#x43a;&quot; - &#x441;&#x43f;&#x440;&#x430;&#x432;&#x43e;&#x447;&#x43d;&#x438;&#x43a; &quot;&#x421;&#x447;&#x435;&#x442;&#x430; &#x432; &#x431;&#x430;&#x43d;&#x43a;&#x435;&quot; &#x438;.&#x442;.&#x434;.
     </p>
     
<p>
       &#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x441;&#x43f;&#x440;&#x430;&#x432;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x430; &#x440;&#x430;&#x441;&#x445;&#x43e;&#x434;&#x44b;:
     </p>
     
<p align="center"><img src="images/ivsprash.png" style="max-width: 100%" alt="" /></p>
     
<p>
       &#x41f;&#x435;&#x440;&#x432;&#x44b;&#x43c; &#x437;&#x430;&#x43f;&#x43e;&#x43b;&#x43d;&#x44f;&#x435;&#x442;&#x441;&#x44f; &#x441;&#x43f;&#x440;&#x430;&#x432;&#x43e;&#x447;&#x43d;&#x438;&#x43a; &quot;&#x411;&#x443;&#x445;&#x433;&#x430;&#x43b;&#x442;&#x435;&#x440;&#x441;&#x43a;&#x438;&#x435; &#x43d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x438;&quot;: &#x43e;&#x43f;&#x435;&#x440;&#x430;&#x446;&#x438;&#x43e;&#x43d;&#x43d;&#x44b;&#x439; &#x43c;&#x435;&#x441;&#x44f;&#x446; &#x443;&#x447;&#x435;&#x442;&#x430;, &#x43d;&#x430;&#x438;&#x43c;&#x435;&#x43d;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;, &#x442;&#x43e;&#x447;&#x43d;&#x43e;&#x441;&#x442;&#x44c; &#x432; &#x43e;&#x442;&#x447;&#x435;&#x442;&#x430;&#x445; - 2...:
     </p>
     
<p align="center"><img src="images/ivset.png" style="max-width: 100%" alt="" /></p>
     
<p>
       &#x414;&#x430;&#x43b;&#x435;&#x435; &#x437;&#x430;&#x43f;&#x43e;&#x43b;&#x43d;&#x44f;&#x435;&#x43c; &#x43f;&#x43b;&#x430;&#x43d; &#x441;&#x447;&#x435;&#x442;&#x43e;&#x432;. &#x414;&#x43b;&#x44f; &#x43a;&#x430;&#x436;&#x434;&#x43e;&#x433;&#x43e; &#x441;&#x447;&#x435;&#x442;&#x430;: &#x43d;&#x430;&#x438;&#x43c;&#x435;&#x43d;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435;, &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44f; - &#x414;&#x430;/&#x41d;&#x435;&#x442;, &#x441;&#x443;&#x431;&#x441;&#x447;&#x435;&#x442;&#x430; &#x43f;&#x440;&#x438; &#x43d;&#x435;&#x43e;&#x445;&#x43e;&#x434;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x438;...
     </p>
     
<p>
       &#x41f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x441;&#x447;&#x435;&#x442; &quot;&#x414;&#x43e;&#x445;&#x43e;&#x434;&#x44b;&quot;:
     </p>
     
<p align="center"><img src="images/ivaccdoh.png" style="max-width: 100%" alt="" /></p>
     
<p align="center"><img src="images/ivaccdoh1.png" style="max-width: 100%" alt="" /></p>
     
<p>
     &#x414;&#x43b;&#x44f; &#x43a;&#x43e;&#x434;&#x430; &#x441;&#x443;&#x431;&#x441;&#x447;&#x435;&#x442;&#x43e;&#x432; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x439;&#x442;&#x435; &#x41a;&#x43e;&#x434; &#x421;&#x447;&#x435;&#x442;&#x430; &#x441; &#x434;&#x43e;&#x431;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x435;&#x43c; &#x43f;&#x43e;&#x440;&#x44f;&#x434;&#x43a;&#x43e;&#x432;&#x43e;&#x433;&#x43e; &#x43d;&#x43e;&#x43c;&#x435;&#x440;&#x430; &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x438; &#x441;&#x443;&#x431;&#x441;&#x447;&#x435;&#x442;&#x430;, &#x437;&#x434;&#x435;&#x441;&#x44c; 3200 &#x43d;&#x43e;&#x43c;&#x435;&#x440; &#x441;&#x447;&#x435;&#x442;&#x430;.
     &#x421;&#x43f;&#x440;&#x430;&#x432;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x438; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x437;&#x430;&#x43f;&#x43e;&#x43b;&#x43d;&#x44f;&#x442;&#x44c; &#x432; &#x43f;&#x430;&#x440;&#x430;&#x43b;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x439; &#x437;&#x430;&#x43a;&#x43b;&#x430;&#x434;&#x43a;&#x435; &#x438; &#x43e;&#x431;&#x43d;&#x43e;&#x432;&#x43b;&#x44f;&#x442;&#x44c; &#x43f;&#x43e;&#x434;&#x431;&#x43e;&#x440;&#x449;&#x438;&#x43a; &#x43f;&#x43e;&#x441;&#x43b;&#x435; &#x434;&#x43e;&#x431;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f;. &#x411;&#x43e;&#x43b;&#x44c;&#x448;&#x438;&#x43d;&#x441;&#x442;&#x432;&#x43e; &#x441;&#x43f;&#x440;&#x430;&#x432;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x43e;&#x432; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442; &#x432;&#x432;&#x435;&#x434;&#x435;&#x43d;&#x438;&#x44f; &#x443;&#x43d;&#x438;&#x43a;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x433;&#x43e; &#x43a;&#x43e;&#x434;&#x430;, &#x438; &#x435;&#x441;&#x43b;&#x438; &#x432;&#x44b; &#x43f;&#x43e;&#x43b;&#x443;&#x447;&#x438;&#x43b;&#x438; &#x43e;&#x448;&#x438;&#x431;&#x43a;&#x443;, &#x442;&#x43e; &#x43a;&#x43e;&#x434; &#x43d;&#x435; &#x443;&#x43d;&#x438;&#x43a;&#x430;&#x43b;&#x435;&#x43d;.
     </p>
     
<p>
       &#x41d;&#x443;&#x436;&#x43d;&#x43e; &#x438;&#x437;&#x43c;&#x435;&#x43d;&#x438;&#x442;&#x44c; &#x444;&#x43e;&#x440;&#x43c;&#x430;&#x442; &#x43f;&#x440;&#x435;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x44f; &#x434;&#x435;&#x441;&#x44f;&#x442;&#x438;&#x447;&#x43d;&#x43e;&#x433;&#x43e; &#x447;&#x438;&#x441;&#x43b;&#x430; (&#x442;&#x43e;&#x447;&#x43a;&#x430; - &#x434;&#x435;&#x441;&#x44f;&#x442;&#x438;&#x446;&#x43d;&#x44b;&#x439; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43b;&#x438;&#x442;&#x435;&#x43b;&#x44c;, &#x43f;&#x440;&#x43e;&#x431;&#x435;&#x43b; -&#x440;&#x430;&#x437;&#x434;&#x435;&#x43b;&#x438;&#x442;&#x435;&#x43b;&#x44c; &#x433;&#x440;&#x443;&#x43f;&#x43f;) &#x432; &quot;&#x41c;&#x435;&#x43d;&#x44e; - &#x41e;&#x441;&#x43d;&#x43e;&#x432;&#x43d;&#x43e;&#x435; - &#x418;&#x437;&#x43c;&#x435;&#x43d;&#x438;&#x442;&#x44c; &#x44f;&#x437;&#x44b;&#x43a;&#x43e;&#x432;&#x44b;&#x435; &#x43d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x438;&quot;:
     </p>
     
<p align="center"><img src="images/ivlangpfr.png" style="max-width: 100%" alt="" /></p>
     
<p>&#x417;&#x434;&#x435;&#x441;&#x44c; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x430;&#x432;&#x43b;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x43e;&#x43f;&#x435;&#x440;&#x430;&#x446;&#x438;&#x43e;&#x43d;&#x43d;&#x44b;&#x439; &#x434;&#x435;&#x43d;&#x44c; &#x434;&#x43b;&#x44f; &#x430;&#x432;&#x442;&#x43e;&#x43c;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x439; &#x43f;&#x43e;&#x434;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43a;&#x438; &#x432; &#x43d;&#x43e;&#x432;&#x44b;&#x435; &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x44b;.</p>
     
<p>
       &#x41f;&#x43e;&#x441;&#x43b;&#x435; &#x437;&#x430;&#x43f;&#x43e;&#x43b;&#x43d;&#x435;&#x43d;&#x438;&#x44f; &#x441;&#x43f;&#x440;&#x430;&#x432;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x43e;&#x432; &#x432;&#x432;&#x435;&#x434;&#x435;&#x43c; &#x441;&#x442;&#x430;&#x440;&#x442;&#x43e;&#x432;&#x44b;&#x439; &#x43a;&#x430;&#x43f;&#x438;&#x442;&#x430;&#x43b; (&#x441;&#x43a;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x434;&#x435;&#x43d;&#x435;&#x433; &#x438; &#x434;&#x440;&#x443;&#x433;&#x438;&#x445; &#x446;&#x435;&#x43d;&#x43d;&#x43e;&#x441;&#x442;&#x435;&#x439; &#x432;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x43e; &#x432; &#x431;&#x438;&#x437;&#x43d;&#x435;&#x441;):
     </p>
     
<p align="center"><img src="images/ivprstcap.png" style="max-width: 100%" alt="" /></p>
     
<p align="center"><img src="images/ivprstcap1.png" style="max-width: 100%" alt="" /></p>
     
<p>&#x42d;&#x442;&#x43e; &#x434;&#x435;&#x43b;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x441; &#x43f;&#x43e;&#x43c;&#x43e;&#x449;&#x44c;&#x44e; &#x434;&#x43e;&#x43a;&#x443;&#x43c;&#x435;&#x43d;&#x442;&#x430; &quot;&#x412;&#x432;&#x43e;&#x434; &#x43f;&#x440;&#x43e;&#x432;&#x43e;&#x434;&#x43e;&#x43a;&quot;.</p>
     
<p>
       6 &#x44f;&#x43d;&#x432;&#x430;&#x440;&#x44f; &#x431;&#x44b;&#x43b;&#x430; &#x43a;&#x443;&#x43f;&#x43b;&#x435;&#x43d;&#x430; &#x413;&#x430;&#x437;&#x435;&#x43b;&#x44c; &#x437;&#x430; 300000, &#x432;&#x432;&#x43e;&#x434;&#x438;&#x43c; &#x43f;&#x440;&#x43e;&#x432;&#x43e;&#x434;&#x43a;&#x443;:
     </p>
     
<p align="center"><img src="images/ivprgazkup.png" style="max-width: 100%" alt="" /></p>
     
<p>&#x41d;&#x438;&#x43a;&#x430;&#x43a;&#x438;&#x445; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x435;&#x439; &#x432; &#x423;&#x421;&#x41d; &#x43d;&#x435; &#x434;&#x435;&#x43b;&#x430;&#x435;&#x43c; &#x442;.&#x43a;. &#x44d;&#x442;&#x43e; &#x43f;&#x440;&#x438;&#x43e;&#x431;&#x440;&#x435;&#x442;&#x435;&#x43d;&#x438;&#x435; &#x446;&#x435;&#x43d;&#x43d;&#x43e;&#x441;&#x442;&#x438;.</p>
     
<p>
       6 &#x44f;&#x43d;&#x432;&#x430;&#x440;&#x44f; &#x431;&#x44b;&#x43b; &#x43a;&#x443;&#x43f;&#x43b;&#x435;&#x43d; &#x431;&#x435;&#x43d;&#x437;&#x438;&#x43d; &#x43d;&#x430; 3000, &#x432;&#x432;&#x43e;&#x434;&#x438;&#x43c; &#x43f;&#x440;&#x43e;&#x432;&#x43e;&#x434;&#x43a;&#x443;:
     </p>
     
<p align="center"><img src="images/ivprbenzkup.png" style="max-width: 100%" alt="" /></p>
     
<p>&#x412; &#x423;&#x421;&#x41d; &#x43d;&#x438;&#x447;&#x435;&#x433;&#x43e; &#x43d;&#x435; &#x437;&#x430;&#x43d;&#x43e;&#x441;&#x438;&#x43c; &#x442;.&#x43a;. &#x44d;&#x442;&#x43e; &#x43f;&#x440;&#x438;&#x43e;&#x431;&#x440;&#x435;&#x442;&#x435;&#x43d;&#x438;&#x435; &#x446;&#x435;&#x43d;&#x43d;&#x43e;&#x441;&#x442;&#x438;, &#x43d;&#x43e; &#x43c;&#x43d;&#x43e;&#x433;&#x438;&#x435; &#x437;&#x430;&#x43d;&#x43e;&#x441;&#x44f;&#x442; &#x434;&#x430;&#x43d;&#x43d;&#x443;&#x44e; &#x43e;&#x43f;&#x435;&#x440;&#x430;&#x446;&#x438;&#x44e; &#x43a;&#x430;&#x43a; &#x440;&#x430;&#x441;&#x445;&#x43e;&#x434; &#x423;&#x421;&#x41d;, &#x447;&#x442;&#x43e; &#x441;&#x43e;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43d;&#x43d;&#x43e; &#x43d;&#x435;&#x43f;&#x440;&#x430;&#x432;&#x438;&#x43b;&#x44c;&#x43d;&#x43e;.</p>
     
<p>
       7 &#x44f;&#x43d;&#x432;&#x430;&#x440;&#x44f; &#x440;&#x430;&#x437;&#x432;&#x435;&#x437;&#x435;&#x43d;&#x43e; &#x424;&#x41b; &#x43d;&#x430; 2350:
     </p>
     
<p align="center"><img src="images/ivprdoh7.png" style="max-width: 100%" alt="" /></p>
     
<p>
     &#x420;&#x430;&#x437;&#x432;&#x43e;&#x437;&#x43a;&#x438; &#x431;&#x44b;&#x43b;&#x438; &#x441;&#x440;&#x430;&#x437;&#x443; &#x43e;&#x43f;&#x43b;&#x430;&#x447;&#x435;&#x43d;&#x44b;, &#x43f;&#x43e;&#x44d;&#x442;&#x43e;&#x43c;&#x443; &#x443;&#x43c;&#x435;&#x441;&#x442;&#x43d;&#x430; &#x43f;&#x440;&#x44f;&#x43c;&#x430;&#x44f; &#x43f;&#x440;&#x43e;&#x432;&#x43e;&#x434;&#x43a;&#x430; - &#x414;&#x435;&#x431;&#x438;&#x442; &#x41a;&#x430;&#x441;&#x441;&#x430; &#x41a;&#x440;&#x435;&#x434;&#x438;&#x442; &#x414;&#x43e;&#x445;&#x43e;&#x434;&#x44b; &#x43e;&#x442; &#x440;&#x430;&#x437;&#x432;&#x43e;&#x437;&#x43a;&#x438;.
     &#x41e;&#x431;&#x44b;&#x447;&#x43d;&#x43e; &#x434;&#x435;&#x442;&#x430;&#x43b;&#x438;&#x437;&#x438;&#x440;&#x443;&#x44e;&#x442;, &#x442;.&#x435;. &#x432;&#x432;&#x43e;&#x434;&#x44f;&#x442; &#x434;&#x432;&#x435; &#x43f;&#x440;&#x43e;&#x432;&#x43e;&#x434;&#x43a;&#x438;: &#x414;&#x435;&#x431;&#x438;&#x442; &#x41f;&#x43e;&#x43a;&#x443;&#x43f;&#x430;&#x442;&#x435;&#x43b;&#x438; &#x41a;&#x440;&#x435;&#x434;&#x438;&#x442; &#x414;&#x43e;&#x445;&#x43e;&#x434;&#x44b; &#x43e;&#x442; &#x440;&#x430;&#x437;&#x432;&#x43e;&#x437;&#x43a;&#x438;
     &#x438; &#x414;&#x435;&#x431;&#x438;&#x442; &#x41a;&#x430;&#x441;&#x441;&#x430; (&#x438;&#x43b;&#x438; &#x411;&#x430;&#x43d;&#x43a;) &#x41a;&#x440;&#x435;&#x434;&#x438;&#x442; &#x41f;&#x43e;&#x43a;&#x443;&#x43f;&#x430;&#x442;&#x435;&#x43b;&#x438;.
     &#x417;&#x430;&#x43f;&#x438;&#x441;&#x44c; &#x434;&#x43e;&#x445;&#x43e;&#x434;&#x430; &#x432; &#x423;&#x421;&#x41d; &#x434;&#x435;&#x43b;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x442;.&#x43a;. &#x43e;&#x43f;&#x43b;&#x430;&#x447;&#x435;&#x43d;&#x43e;.
     </p>
     
<p>
       7 &#x44f;&#x43d;&#x432;&#x430;&#x440;&#x44f; &#x43f;&#x43e;&#x442;&#x440;&#x430;&#x447;&#x435;&#x43d;&#x43e; &#x431;&#x435;&#x43d;&#x437;&#x438;&#x43d;&#x430; &#x43d;&#x430; 1250:
     </p>
     
<p align="center"><img src="images/ivprbenzras.png" style="max-width: 100%" alt="" /></p>
     
<p>&#x412; &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x43c; &#x441;&#x43b;&#x443;&#x447;&#x430;&#x435; &#x431;&#x435;&#x43d;&#x437;&#x438;&#x43d; &#x43e;&#x43f;&#x43b;&#x430;&#x447;&#x435;&#x43d;, &#x442;.&#x435;. &#x437;&#x430;&#x43f;&#x438;&#x441;&#x44c; &#x440;&#x430;&#x441;&#x445;&#x43e;&#x434;&#x430; &#x432; &#x423;&#x421;&#x41d; &#x434;&#x435;&#x43b;&#x430;&#x435;&#x442;&#x441;&#x44f;.</p>
     
<p>
       8 &#x44f;&#x43d;&#x432;&#x430;&#x440;&#x44f; &#x440;&#x430;&#x437;&#x432;&#x435;&#x437;&#x435;&#x43d;&#x43e; &#x432; &#x434;&#x43e;&#x43b;&#x433; &#x43d;&#x430; 3269&#x440;&#x443;&#x431;:
     </p>
     
<p align="center"><img src="images/ivdolg.png" style="max-width: 100%" alt="" /></p>
     
<p>&#x437;&#x430;&#x43f;&#x438;&#x441;&#x44c; &#x434;&#x43e;&#x445;&#x43e;&#x434;&#x430; &#x432; &#x423;&#x421;&#x41d; &#x43d;&#x435; &#x434;&#x435;&#x43b;&#x430;&#x435;&#x43c; &#x442;.&#x43a;. &#x43d;&#x435;&#x43e;&#x43f;&#x43b;&#x430;&#x447;&#x435;&#x43d;&#x43e;.</p>
     
<p>9 &#x44f;&#x43d;&#x432;&#x430;&#x440;&#x44f; &#x434;&#x43e;&#x43b;&#x433; &#x43d;&#x430; &#x441;&#x443;&#x43c;&#x43c;&#x443; 3269&#x440;&#x443;&#x431; &#x43f;&#x43e;&#x433;&#x430;&#x448;&#x435;&#x43d;:</p>
     
<p align="center"><img src="images/ivdolg1.png" style="max-width: 100%" alt="" /></p>
     
<p>&#x434;&#x435;&#x43b;&#x430;&#x435;&#x43c; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x44c; &#x43e;&#x43f;&#x43b;&#x430;&#x447;&#x435;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x434;&#x43e;&#x445;&#x43e;&#x434;&#x430; &#x432; &#x423;&#x421;&#x41d;.</p>
     
<p>
       21 &#x44f;&#x43d;&#x432;&#x430;&#x440;&#x44f; &#x440;&#x430;&#x437;&#x432;&#x43e;&#x437; &#x434;&#x43b;&#x44f; &#x418;.&#x41f;.&#x41f;&#x435;&#x442;&#x440;&#x43e;&#x432;&#x430; &#x43d;&#x430; 2134&#x440;&#x443;&#x431;  &#x432; &#x434;&#x43e;&#x43b;&#x433;:
     </p>
     
<p align="center"><img src="images/ivbaddebt.png" style="max-width: 100%" alt="" /></p>
     
<p>&#x41f;&#x435;&#x442;&#x440;&#x43e;&#x432; &#x43e;&#x431;&#x430;&#x43d;&#x43a;&#x440;&#x43e;&#x442;&#x438;&#x43b;&#x441;&#x44f;, &#x434;&#x435;&#x43d;&#x44c;&#x433;&#x438; &#x43d;&#x435; &#x432;&#x435;&#x440;&#x43d;&#x443;&#x442;&#x44c;, &#x434;&#x435;&#x43b;&#x430;&#x435;&#x442;&#x441;&#x44f; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x44c; 31 &#x44f;&#x43d;&#x432;&#x430;&#x440;&#x44f; &#x441;&#x43f;&#x438;&#x441;&#x430;&#x43d;&#x438;&#x435; &#x434;&#x43e;&#x43b;&#x433;&#x430; &#x43d;&#x430; &#x440;&#x430;&#x441;&#x445;&#x43e;&#x434;&#x44b;:</p>
     
<p align="center"><img src="images/ivbaddebt1.png" style="max-width: 100%" alt="" /></p>
     
<p>&#x412; &#x423;&#x421;&#x41d; &#x43e;&#x431;&#x435; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x438; &#x43d;&#x435; &#x434;&#x435;&#x43b;&#x430;&#x44e;&#x442;&#x441;&#x44f;.</p>
     
<p>
       &#x412; &#x43a;&#x43e;&#x43c;&#x43c;&#x435;&#x440;&#x447;&#x435;&#x441;&#x43a;&#x43e;&#x439; &#x431;&#x443;&#x445;&#x433;&#x430;&#x43b;&#x442;&#x435;&#x440;&#x438;&#x438; &#x440;&#x435;&#x437;&#x443;&#x43b;&#x44c;&#x442;&#x430;&#x442;&#x44b; &#x43e;&#x431;&#x44b;&#x447;&#x43d;&#x43e; &#x43f;&#x43e;&#x434;&#x432;&#x43e;&#x434;&#x44f;&#x442;&#x441;&#x44f; &#x435;&#x436;&#x435;&#x43c;&#x435;&#x441;&#x44f;&#x447;&#x43d;&#x43e;, &#x43a;&#x440;&#x43e;&#x43c;&#x435; &#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x43e;&#x432; &#x432;&#x432;&#x43e;&#x434;&#x44f;&#x442;&#x441;&#x44f; &#x43f;&#x435;&#x440;&#x435;&#x43e;&#x446;&#x435;&#x43d;&#x43a;&#x438; &#x446;&#x435;&#x43d;&#x43d;&#x43e;&#x441;&#x442;&#x435;&#x439;,
       &#x43a; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;&#x443; &#x440;&#x44b;&#x43d;&#x43e;&#x447;&#x43d;&#x430;&#x44f; &#x441;&#x442;&#x43e;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x44c; &#x413;&#x430;&#x437;&#x435;&#x43b;&#x438; 288000, &#x442;.&#x435;. &#x441;&#x43f;&#x438;&#x441;&#x44b;&#x432;&#x430;&#x435;&#x43c; 12000&#x440;&#x443;&#x431; &#x43d;&#x430; &#x438;&#x437;&#x43d;&#x43e;&#x441;:
     </p>
     
<p align="center"><img src="images/ivgazdepr.png" style="max-width: 100%" alt="" /></p>
     
<p>&#x43e; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x44f;&#x445; &#x432; &#x423;&#x421;&#x41d; &#x43f;&#x43e; &#x43f;&#x43e;&#x432;&#x43e;&#x434;&#x443; &#x440;&#x430;&#x441;&#x445;&#x43e;&#x434;&#x43e;&#x432; &#x43d;&#x430; &#x43e;&#x441;&#x43d;&#x43e;&#x432;&#x43d;&#x44b;&#x435; &#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x430; &#x443;&#x442;&#x43e;&#x447;&#x43d;&#x44f;&#x439;&#x442;&#x435; &#x432; &#x418;&#x424;&#x41d;&#x421; &#x438; &#x447;&#x438;&#x442;&#x430;&#x439;&#x442;&#x435; &#x43d;&#x430;&#x43b;&#x43e;&#x433;&#x43e;&#x432;&#x44b;&#x439; &#x43a;&#x43e;&#x434;&#x435;&#x43a;&#x441;.</p>
     
<p>
       &#x41d;&#x430;&#x43b;&#x43e;&#x433;&#x438; &#x432;&#x432;&#x43e;&#x434;&#x44f;&#x442;&#x441;&#x44f; &#x43e;&#x434;&#x438;&#x43d;&#x430;&#x43a;&#x43e;&#x432;&#x43e;, &#x415;&#x41d;&#x412;&#x414; &#x43a; &#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440;&#x443;:
     </p>
     
<p align="center"><img src="images/ivenvd.png" style="max-width: 100%" alt="" /></p>
     
<p>
       &#x422;&#x430;&#x43a;&#x436;&#x435; &#x431;&#x44b;&#x43b;&#x438; &#x432;&#x432;&#x435;&#x434;&#x435;&#x43d;&#x44b; &#x43e;&#x43f;&#x435;&#x440;&#x430;&#x446;&#x438;&#x438;:
       </p>
<ul>
         
<li>&#x414;&#x43e;&#x445;&#x43e;&#x434;&#x44b; &#x43e;&#x442; &#x440;&#x430;&#x437;&#x432;&#x43e;&#x437;&#x43a;&#x438; 07.01.2019: &#x414;&#x435;&#x431;&#x438;&#x442; &#x41a;&#x430;&#x441;&#x441;&#x430; &#x41a;&#x440;&#x435;&#x434;&#x438;&#x442; &#x414;&#x43e;&#x445;&#x43e;&#x434;&#x44b; &#x43e;&#x442; &#x440;&#x430;&#x437;&#x432;&#x43e;&#x437;&#x43a;&#x438;-&#x420;&#x430;&#x437;&#x432;&#x43e;&#x437; &#x411; &#x43d;&#x430; 1 780,00 &#x440;&#x443;&#x431;</li>
         
<li>&#x420;&#x430;&#x441;&#x445;&#x43e;&#x434;&#x44b; &#x43d;&#x430; &#x413;&#x421;&#x41c; 08.01.2019: &#x414;&#x435;&#x431;&#x438;&#x442; &#x420;&#x430;&#x441;&#x445;&#x43e;&#x434;&#x44b;-&#x413;&#x421;&#x41c; &#x41a;&#x440;&#x435;&#x434;&#x438;&#x442; &#x421;&#x43a;&#x43b;&#x430;&#x434;-&#x413;&#x421;&#x41c; &#x43d;&#x430; 1 000,00 &#x440;&#x443;&#x431;</li>
         
<li>&#x414;&#x43e;&#x445;&#x43e;&#x434;&#x44b; &#x43e;&#x442; &#x440;&#x430;&#x437;&#x432;&#x43e;&#x437;&#x43a;&#x438; 20.01.2019: &#x414;&#x435;&#x431;&#x438;&#x442; &#x41a;&#x430;&#x441;&#x441;&#x430; &#x41a;&#x440;&#x435;&#x434;&#x438;&#x442; &#x414;&#x43e;&#x445;&#x43e;&#x434;&#x44b; &#x43e;&#x442; &#x440;&#x430;&#x437;&#x432;&#x43e;&#x437;&#x43a;&#x438;-&#x420;&#x430;&#x437;&#x432;&#x43e;&#x437; &#x410; &#x43d;&#x430; 7 568,00 &#x440;&#x443;&#x431;</li>
         
<li>&#x414;&#x43e;&#x445;&#x43e;&#x434;&#x44b; &#x43e;&#x442; &#x440;&#x430;&#x437;&#x432;&#x43e;&#x437;&#x43a;&#x438; 20.01.2019: &#x414;&#x435;&#x431;&#x438;&#x442; &#x41a;&#x430;&#x441;&#x441;&#x430; &#x41a;&#x440;&#x435;&#x434;&#x438;&#x442; &#x414;&#x43e;&#x445;&#x43e;&#x434;&#x44b; &#x43e;&#x442; &#x440;&#x430;&#x437;&#x432;&#x43e;&#x437;&#x43a;&#x438;-&#x420;&#x430;&#x437;&#x432;&#x43e;&#x437; &#x411; &#x43d;&#x430; 12 568,00 &#x440;&#x443;&#x431;</li>
         
<li>&#x420;&#x430;&#x441;&#x445;&#x43e;&#x434;&#x44b; &#x43d;&#x430; &#x413;&#x421;&#x41c; (&#x43f;&#x440;&#x44f;&#x43c;&#x430;&#x44f; &#x43f;&#x440;&#x43e;&#x432;&#x43e;&#x434;&#x43a;&#x430; &#x431;&#x435;&#x437; &#x441;&#x43a;&#x43b;&#x430;&#x434;&#x430;) 20.01.2019: &#x414;&#x435;&#x431;&#x438;&#x442; &#x420;&#x430;&#x441;&#x445;&#x43e;&#x434;&#x44b;-&#x413;&#x421;&#x41c; &#x41a;&#x440;&#x435;&#x434;&#x438;&#x442; &#x41a;&#x430;&#x441;&#x441;&#x430; &#x43d;&#x430; 5 231,00 &#x440;&#x443;&#x431;</li>
         
<li>&#x414;&#x43e;&#x445;&#x43e;&#x434;&#x44b; &#x43e;&#x442; &#x440;&#x430;&#x437;&#x432;&#x43e;&#x437;&#x43a;&#x438; &#x432; &#x434;&#x43e;&#x43b;&#x433; 22.01.2019: &#x414;&#x435;&#x431;&#x438;&#x442; &#x41f;&#x43e;&#x43a;&#x443;&#x43f;&#x430;&#x442;&#x435;&#x43b;&#x438;-&#x418;&#x41f; &#x421;&#x438;&#x434;&#x43e;&#x440;&#x43e;&#x432; &#x41a;&#x440;&#x435;&#x434;&#x438;&#x442; &#x414;&#x43e;&#x445;&#x43e;&#x434;&#x44b; &#x43e;&#x442; &#x440;&#x430;&#x437;&#x432;&#x43e;&#x437;&#x43a;&#x438;-&#x420;&#x430;&#x437;&#x432;&#x43e;&#x437; &#x411; &#x43d;&#x430; 9 236,00 &#x440;&#x443;&#x431;</li>
         
<li>&#x421;&#x438;&#x434;&#x43e;&#x440;&#x43e;&#x432; &#x437;&#x430;&#x43f;&#x43b;&#x430;&#x442;&#x438;&#x43b; 23.01.2019: &#x414;&#x435;&#x431;&#x438;&#x442; &#x41a;&#x430;&#x441;&#x441;&#x430; &#x41a;&#x440;&#x435;&#x434;&#x438;&#x442; &#x41f;&#x43e;&#x43a;&#x443;&#x43f;&#x430;&#x442;&#x435;&#x43b;&#x438;-&#x418;&#x41f; &#x421;&#x438;&#x434;&#x43e;&#x440;&#x43e;&#x432; &#x43d;&#x430; 9 236,00 &#x440;&#x443;&#x431;</li>
         
<li>&#x41f;&#x440;&#x435;&#x434;&#x43e;&#x43f;&#x43b;&#x430;&#x442;&#x430; &#x43e;&#x442; &#x421;&#x438;&#x434;&#x43e;&#x440;&#x43e;&#x432;&#x430; &#x437;&#x430; &#x431;&#x443;&#x434;&#x443;&#x449;&#x438;&#x439; &#x440;&#x430;&#x437;&#x432;&#x43e;&#x437; 30.01.2019: &#x414;&#x435;&#x431;&#x438;&#x442; &#x41a;&#x430;&#x441;&#x441;&#x430; &#x41a;&#x440;&#x435;&#x434;&#x438;&#x442; &#x41f;&#x440;&#x435;&#x434;&#x43e;&#x43f;&#x43b;&#x430;&#x442;&#x430; &#x43e;&#x442; &#x43f;&#x43e;&#x43a;&#x443;&#x43f;&#x430;&#x442;&#x435;&#x43b;&#x435;&#x439;-&#x418;&#x41f; &#x421;&#x438;&#x434;&#x43e;&#x440;&#x43e;&#x432; 2 689,00 &#x440;&#x443;&#x431;</li>
       </ul>
     
     
     
<p>&#x412;&#x44b;&#x432;&#x43e;&#x434;  &#x434;&#x435;&#x43d;&#x435;&#x433; &#x438;&#x437; &#x431;&#x438;&#x437;&#x43d;&#x435;&#x441;&#x430; (&#x441;&#x432;&#x43e;&#x44f; &#x437;&#x430;&#x440;&#x43f;&#x43b;&#x430;&#x442;&#x430;). &#x414;&#x435;&#x43b;&#x430;&#x435;&#x43c; &#x43d;&#x43e;&#x432;&#x44b;&#x439; &#x440;&#x430;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x44b;&#x439; &#x441;&#x447;&#x435;&#x442; &#x43d;&#x430; &#x43e;&#x441;&#x43d;&#x43e;&#x432;&#x43d;&#x44b;&#x445; &#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x430;&#x445; (&#x434;&#x435;&#x431;&#x438;&#x442;&#x43e;&#x432;&#x44b;&#x439;). &#x41a;&#x43e;&#x434; &#x441;&#x447;&#x435;&#x442;&#x430; - &#x43b;&#x430;&#x442;&#x438;&#x43d;&#x441;&#x43a;&#x438;&#x435; &#x431;&#x443;&#x43a;&#x432;&#x44b; &#x431;&#x435;&#x437; &#x43f;&#x440;&#x43e;&#x431;&#x435;&#x43b;&#x43e;&#x432;.
      &#x41f;&#x440;&#x43e;&#x432;&#x43e;&#x434;&#x43a;&#x430;: &#x414;&#x435;&#x431;&#x438;&#x442; &#x41c;&#x43e;&#x44f; &#x437;&#x430;&#x440;&#x43f;&#x43b;&#x430;&#x442;&#x430; &#x41a;&#x440;&#x435;&#x434;&#x438;&#x442; &#x41a;&#x430;&#x441;&#x441;&#x430; &#x438;&#x43b;&#x438; &#x411;&#x430;&#x43d;&#x43a;.
     </p>
     
     
<p>&#x415;&#x441;&#x43b;&#x438; &#x438;&#x43c;&#x435;&#x435;&#x442;&#x441;&#x44f; &#x432;&#x438;&#x434;(&#x44b;) &#x434;&#x435;&#x44f;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x43f;&#x43e; &#x423;&#x421;&#x41d;, &#x442;&#x43e; &#x432;&#x435;&#x434;&#x435;&#x43c; &#x43a;&#x43d;&#x438;&#x433;&#x443; &#x432; &#x43e;&#x431;&#x44b;&#x447;&#x43d;&#x43e;&#x439; &#x44d;&#x43b;&#x435;&#x43a;&#x442;&#x440;&#x43e;&#x43d;&#x43d;&#x43e;&#x439; &#x442;&#x430;&#x431;&#x43b;&#x438;&#x446;&#x435; &#x43a;&#x430;&#x441;&#x441;&#x43e;&#x432;&#x44b;&#x43c; &#x43c;&#x435;&#x442;&#x43e;&#x434;&#x43e;&#x43c;. &#x415;&#x436;&#x435;&#x43c;&#x435;&#x441;&#x44f;&#x447;&#x43d;&#x44b;&#x439; &#x440;&#x435;&#x437;&#x443;&#x43b;&#x44c;&#x442;&#x430;&#x442; &#x432;&#x432;&#x43e;&#x434;&#x438;&#x43c; &#x43a;&#x430;&#x43a; &#x438; &#x43e;&#x43f;&#x438;&#x441;&#x430;&#x43d;&#x43d;&#x44b;&#x439; &#x432;&#x44b;&#x448;&#x435; &#x415;&#x41d;&#x412;&#x414;.
     &#x41f;&#x440;&#x438; &#x43e;&#x434;&#x43d;&#x43e;&#x432;&#x440;&#x435;&#x43c;&#x435;&#x43d;&#x43d;&#x43e;&#x43c; &#x432;&#x435;&#x434;&#x435;&#x43d;&#x438;&#x438; &#x432;&#x438;&#x434;&#x43e;&#x432; &#x43f;&#x43e; &#x423;&#x421;&#x41d; &#x438; &#x415;&#x41d;&#x412;&#x414; &#x434;&#x43e;&#x445;&#x43e;&#x434;&#x44b; &#x438; &#x440;&#x430;&#x441;&#x445;&#x43e;&#x434;&#x44b; &#x434;&#x435;&#x43b;&#x44f;&#x442; &#x43f;&#x440;&#x43e;&#x43f;&#x43e;&#x440;&#x446;&#x438;&#x43e;&#x43d;&#x430;&#x43b;&#x44c;&#x43d;&#x43e; &#x434;&#x435;&#x44f;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x438;.
     &#x41d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; 70 &#x43b;&#x438;&#x442;&#x440;&#x43e;&#x432; &#x431;&#x435;&#x43d;&#x437;&#x438;&#x43d;&#x430; &#x43f;&#x43e;&#x442;&#x440;&#x430;&#x447;&#x435;&#x43d;&#x43e;, &#x438;&#x437; &#x43d;&#x438;&#x445; 40 &#x43d;&#x430; &#x423;&#x421;&#x41d;, 30 &#x43d;&#x430; &#x415;&#x41d;&#x412;&#x414;.</p>
     
<p>&#x41f;&#x43e; &#x423;&#x421;&#x41d; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x43e;&#x442;&#x43c;&#x435;&#x442;&#x438;&#x442;&#x44c;, &#x447;&#x442;&#x43e; &#x437;&#x430;&#x44f;&#x432;&#x43b;&#x435;&#x43d;&#x438;&#x435; &#x43d;&#x430; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x423;&#x421;&#x41d; &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x43f;&#x43e;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44c; &#x441;&#x440;&#x430;&#x437;&#x443; &#x43f;&#x440;&#x438; &#x440;&#x435;&#x433;&#x438;&#x441;&#x442;&#x440;&#x430;&#x446;&#x438;&#x438; &#x43f;&#x440;&#x435;&#x434;&#x43f;&#x440;&#x438;&#x44f;&#x442;&#x438;&#x44f; (&#x418;&#x41f;).
     &#x412;&#x44b;&#x431;&#x43e;&#x440; &#x43c;&#x435;&#x436;&#x434;&#x443; &quot;&#x414;&#x43e;&#x445;&#x43e;&#x434;&#x44b;&quot; &#x438; &quot;&#x414;&#x43e;&#x445;&#x43e;&#x434;&#x44b; &#x43c;&#x438;&#x43d;&#x443;&#x441; &#x420;&#x430;&#x441;&#x445;&#x43e;&#x434;&#x44b;&quot; &#x43f;&#x440;&#x43e;&#x438;&#x437;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x441;&#x44f; &#x43f;&#x440;&#x43e;&#x441;&#x442;&#x44b;&#x43c; &#x440;&#x430;&#x441;&#x447;&#x435;&#x442;&#x43e;&#x43c; &#x441; &#x43f;&#x43e;&#x434;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43a;&#x43e;&#x439; &#x43f;&#x440;&#x435;&#x434;&#x43f;&#x43e;&#x43b;&#x430;&#x433;&#x430;&#x435;&#x43c;&#x43e;&#x433;&#x43e; &#x434;&#x43e;&#x445;&#x43e;&#x434;&#x430; &#x438; &#x440;&#x430;&#x441;&#x445;&#x43e;&#x434;&#x430;,
     &#x43d;&#x43e; &#x43c;&#x43d;&#x43e;&#x433;&#x438;&#x435; &#x437;&#x430;&#x431;&#x44b;&#x432;&#x430;&#x44e;&#x442; &#x44d;&#x442;&#x43e; &#x441;&#x434;&#x435;&#x43b;&#x430;&#x442;&#x44c;, &#x430; &#x43f;&#x435;&#x440;&#x435;&#x439;&#x442;&#x438; &#x441; &quot;&#x414;&#x43e;&#x445;&#x43e;&#x434;&#x44b; &#x43c;&#x438;&#x43d;&#x443;&#x441; &#x420;&#x430;&#x441;&#x445;&#x43e;&#x434;&#x44b;&quot; &#x43d;&#x430; &quot;&#x414;&#x43e;&#x445;&#x43e;&#x434;&#x44b;&quot; &#x44d;&#x442;&#x43e; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x430;&#x44f; &#x43f;&#x440;&#x43e;&#x431;&#x43b;&#x435;&#x43c;&#x430;.
     </p>
     
     </div>
<div class="section">
<h4>&#x412;&#x435;&#x434;&#x435;&#x43d;&#x438;&#x435; &#x443;&#x447;&#x435;&#x442;&#x430; &quot;&#x43d;&#x435; &#x441; &#x43d;&#x430;&#x447;&#x430;&#x43b;&#x430; &#x434;&#x435;&#x44f;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x438;&quot;.<a name="a_____."></a></h4>
     
<p>&#x41f;&#x43e;&#x441;&#x43b;&#x435; &#x432;&#x432;&#x43e;&#x434;&#x430; &#x441;&#x43f;&#x440;&#x430;&#x432;&#x43e;&#x447;&#x43d;&#x438;&#x43a;&#x43e;&#x432; &#x438; &#x43f;&#x43b;&#x430;&#x43d;&#x430; &#x441;&#x447;&#x435;&#x442;&#x43e;&#x432; &#x432;&#x432;&#x43e;&#x434;&#x438;&#x43c; &#x43e;&#x441;&#x442;&#x430;&#x442;&#x43a;&#x438; &#x43f;&#x43e; &#x430;&#x43a;&#x442;&#x438;&#x432;&#x430;&#x43c; &#x438; &#x43f;&#x430;&#x441;&#x441;&#x438;&#x432;&#x430;&#x43c; &#x432; &#x440;&#x44b;&#x43d;&#x43e;&#x447;&#x43d;&#x43e;&#x439; &#x441;&#x442;&#x43e;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x438;. &#x422;.&#x435;. &#x442;&#x435;&#x43a;&#x443;&#x449;&#x430;&#x44f; &#x440;&#x44b;&#x43d;&#x43e;&#x447;&#x43d;&#x430;&#x44f; &#x441;&#x442;&#x43e;&#x438;&#x43c;&#x43e;&#x441;&#x442;&#x44c; &#x430;&#x432;&#x442;&#x43e; &#x440;&#x430;&#x432;&#x43d;&#x430; 231000&#x440;&#x443;&#x431;, &#x434;&#x43e;&#x43b;&#x433; &#x43f;&#x43e;&#x441;&#x442;&#x430;&#x432;&#x449;&#x438;&#x43a;&#x443; 2300&#x440;&#x443;&#x431; &#x438; &#x442;.&#x434;.
     &#x417;&#x430;&#x43f;&#x438;&#x441;&#x438; &#x43f;&#x43e; &#x432;&#x430;&#x43b;&#x43e;&#x432;&#x43e;&#x43c;&#x443; &#x434;&#x43e;&#x445;&#x43e;&#x434;&#x443; &#x438; &#x440;&#x430;&#x441;&#x445;&#x43e;&#x434;&#x430;&#x43c; &#x441; &#x43d;&#x430;&#x447;&#x430;&#x43b;&#x430; &#x434;&#x435;&#x44f;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x434;&#x43e;&#x43b;&#x436;&#x43d;&#x44b; &#x431;&#x44b;&#x442;&#x44c;, &#x432;&#x432;&#x43e;&#x434;&#x438;&#x43c; &#x438;&#x445;.
     &#x417;&#x430;&#x43f;&#x438;&#x441;&#x438; &#x434;&#x435;&#x43b;&#x430;&#x44e;&#x442;&#x441;&#x44f; &#x43d;&#x435;&#x441;&#x438;&#x43c;&#x43c;&#x435;&#x442;&#x440;&#x438;&#x447;&#x43d;&#x44b;&#x435;, &#x442;.&#x435;. &#x441; &#x443;&#x43a;&#x430;&#x437;&#x430;&#x43d;&#x438;&#x435;&#x43c; &#x43e;&#x434;&#x43d;&#x43e;&#x433;&#x43e; &#x441;&#x447;&#x435;&#x442;&#x430;. &#x41d;&#x430;&#x43f;&#x440;&#x438;&#x43c;&#x435;&#x440; &#x414;&#x435;&#x431;&#x438;&#x442; &#x41e;&#x441;&#x43d;&#x43e;&#x432;&#x43d;&#x44b;&#x435; &#x441;&#x440;&#x435;&#x434;&#x441;&#x442;&#x432;&#x430;.&#x410;&#x432;&#x442;&#x43e; 234000&#x440;&#x443;&#x431;.
     &#x41f;&#x43e;&#x441;&#x43b;&#x435; &#x43e;&#x441;&#x442;&#x430;&#x442;&#x43e;&#x43a; - &#x434;&#x438;&#x441;&#x431;&#x430;&#x43b;&#x430;&#x43d;&#x441; &#x435;&#x441;&#x442;&#x44c; &#x441;&#x442;&#x430;&#x440;&#x442;&#x43e;&#x432;&#x44b;&#x439; &#x43a;&#x430;&#x43f;&#x438;&#x442;&#x430;&#x43b; &#x438; &#x432;&#x44b;&#x432;&#x43e;&#x434; &#x434;&#x435;&#x43d;&#x435;&#x433; &#x438; &#x434;&#x440;&#x443;&#x433;&#x438;&#x445; &#x446;&#x435;&#x43d;&#x43d;&#x43e;&#x441;&#x442;&#x435;&#x439;.
     </p>
     
<p>
       &#x414;&#x435;&#x43c;&#x43e;&#x43d;&#x441;&#x442;&#x440;&#x430;&#x446;&#x438;&#x43e;&#x43d;&#x43d;&#x443;&#x44e; &#x431;&#x430;&#x437;&#x443; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; ipivanov1.sqlite (&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44c;/&#x43f;&#x430;&#x440;&#x43e;&#x43b;&#x44c;: admin/admin) &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x441;&#x43a;&#x430;&#x447;&#x430;&#x442;&#x44c; &#x438;&#x437; <a class="externalLink" href="https://sourceforge.net/projects/beige-accounting/">https://sourceforge.net/projects/beige-accounting/</a>.
       &#x412;&#x44b; &#x43c;&#x43e;&#x436;&#x435;&#x442;&#x435; &#x43a;&#x43e;&#x43f;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x431;&#x430;&#x437;&#x44b; &#x43d;&#x430;/&#x441; &#x410;&#x43d;&#x434;&#x440;&#x43e;&#x438;&#x434; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44e; &#x415;&#x418;&#x421; &#x447;&#x435;&#x440;&#x435;&#x437; &#x413;&#x443;&#x433;&#x43b; &#x414;&#x440;&#x430;&#x439;&#x432; &#x431;&#x435;&#x437; &#x448;&#x438;&#x444;&#x440;&#x430;&#x446;&#x438;&#x438;. &#x414;&#x43b;&#x44f; &#x44d;&#x442;&#x43e;&#x433;&#x43e; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x439;&#x442;&#x435; &#x441;&#x442;&#x430;&#x440;&#x442;&#x43e;&#x432;&#x44b;&#x439; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; (&#x441;&#x43c;&#x43e;&#x442;&#x440;&#x438;&#x442;&#x435; &#x432;&#x44b;&#x448;&#x435;) &#x434;&#x43b;&#x44f; &#x44d;&#x43a;&#x441;&#x43f;&#x43e;&#x440;&#x442;&#x430;/&#x438;&#x43c;&#x43f;&#x43e;&#x440;&#x442;&#x430; &#x411;&#x414; &#x432;/&#x441; &#x43f;&#x440;&#x438;&#x432;&#x430;&#x442;&#x43d;&#x43e;&#x435; &#x445;&#x440;&#x430;&#x43d;&#x438;&#x43b;&#x438;&#x449;&#x435; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x44f; &#x441;/&#x432; &#x413;&#x443;&#x433;&#x43b;  &#x414;&#x440;&#x430;&#x439;&#x432;. &#x414;&#x430;&#x43b;&#x435;&#x435; &#x43f;&#x435;&#x440;&#x435;&#x43a;&#x43b;&#x44e;&#x447;&#x430;&#x439;&#x442;&#x435; &#x431;&#x430;&#x437;&#x44b; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44f; &#x412;&#x415;&#x411;-&#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441;.
     </p>
     
     </div>
<div class="section">
<h4>&#x423;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43a;&#x430; &#x411;&#x435;&#x438;&#x436;&#x441;&#x43e;&#x444;&#x442;-&#x415;&#x418;&#x421; &#x43d;&#x430; &#x43e;&#x431;&#x44b;&#x447;&#x43d;&#x44b;&#x439; &#x43a;&#x43e;&#x43c;&#x43f;&#x44c;&#x44e;&#x442;&#x435;&#x440;.<a name="a_-___."></a></h4>
     
<p>&#x414;&#x436;&#x430;&#x432;&#x430; &#x443;&#x436;&#x435; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43b;&#x435;&#x43d;&#x430; &#x43d;&#x430; &#x41b;&#x438;&#x43d;&#x443;&#x43a;&#x441;. &#x41a;&#x440;&#x438;&#x43f;&#x442;&#x43e;&#x43f;&#x440;&#x43e;&#x432;&#x430;&#x439;&#x434;&#x435;&#x440; &#x438; &#x444;&#x430;&#x439;&#x43b;&#x44b; &#x43f;&#x43e;&#x43b;&#x438;&#x442;&#x438;&#x43a; &#x434;&#x43b;&#x438;&#x43d;&#x44b; &#x43a;&#x43b;&#x44e;&#x447;&#x435;&#x439; &#x442;&#x43e;&#x436;&#x435; &#x43d;&#x435; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442;&#x441;&#x44f; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x430;&#x432;&#x43b;&#x438;&#x432;&#x430;&#x442;&#x44c;.</p>
     
<p>&#x41f;&#x435;&#x440;&#x432;&#x43e;&#x435; &#x447;&#x442;&#x43e; &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x43f;&#x43e;&#x43d;&#x44f;&#x442;&#x44c; &#x43e; &#x431;&#x435;&#x437;&#x43e;&#x43f;&#x430;&#x441;&#x43d;&#x43e;&#x441;&#x442;&#x438; - &#x437;&#x430;&#x433;&#x440;&#x443;&#x436;&#x430;&#x439;&#x442;&#x435; &#x444;&#x430;&#x439;&#x43b;&#x44b; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; &#x441; &#x43e;&#x444;&#x438;&#x446;&#x438;&#x430;&#x43b;&#x44c;&#x43d;&#x44b;&#x445; &#x441;&#x430;&#x439;&#x442;&#x43e;&#x432; &#x438;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x44e;&#x449;&#x438;&#x445; &#x448;&#x438;&#x444;&#x440;&#x430;&#x446;&#x438;&#x44e; &#x442;&#x440;&#x430;&#x444;&#x438;&#x43a;&#x430;. &#x422;&#x43e; &#x435;&#x441;&#x442;&#x44c; HTTP &#x44d;&#x442;&#x43e; &#x432;&#x441;&#x435;&#x433;&#x434;&#x430; &#x43e;&#x43f;&#x430;&#x441;&#x43d;&#x43e;, &#x437;&#x430; &#x438;&#x441;&#x43a;&#x43b;&#x44e;&#x447;&#x435;&#x43d;&#x438;&#x435;&#x43c; &#x43f;&#x43e;&#x434;&#x43f;&#x438;&#x441;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x444;&#x430;&#x439;&#x43b;&#x43e;&#x432; - &#x442;.&#x435;. &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x438;&#x442;&#x44c; &#x44d;&#x43b;&#x435;&#x43a;&#x442;&#x440;&#x43e;&#x43d;&#x43d;&#x443;&#x44e; &#x43f;&#x43e;&#x434;&#x43f;&#x438;&#x441;&#x44c; (&#x435;&#x441;&#x43b;&#x438; &#x435;&#x441;&#x442;&#x44c;) &#x447;&#x442;&#x43e;&#x431; &#x443;&#x434;&#x43e;&#x441;&#x442;&#x43e;&#x432;&#x435;&#x440;&#x438;&#x442;&#x44c;&#x441;&#x44f; &#x447;&#x442;&#x43e; &#x444;&#x430;&#x439;&#x43b; &#x43d;&#x435; &#x43f;&#x43e;&#x434;&#x43c;&#x435;&#x43d;&#x435;&#x43d;/&#x437;&#x430;&#x440;&#x430;&#x436;&#x435;&#x43d;.</p>
     
<p>
       &#x41d;&#x430; &#x41c;&#x421; &#x412;&#x438;&#x43d;&#x434;&#x43e;&#x443;&#x441; &#x414;&#x436;&#x430;&#x432;&#x443; &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x438;&#x442;&#x44c; &#x441; &#x43e;&#x444;&#x438;&#x446;&#x438;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x433;&#x43e; &#x441;&#x430;&#x439;&#x442;&#x430; &#x41e;&#x440;&#x430;&#x43a;&#x43b; https://www.java.com/ru/download/.
       &#x424;&#x430;&#x439;&#x43b; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x44f; <b>beige-accjet-1.1-bin.zip</b> &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x441;&#x43a;&#x430;&#x447;&#x430;&#x442;&#x44c; &#x441; &#x446;&#x435;&#x43d;&#x442;&#x440;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x433;&#x43e; &#x41c;&#x430;&#x432;&#x435;&#x43d; &#x440;&#x435;&#x43f;&#x43e;&#x437;&#x438;&#x442;&#x43e;&#x440;&#x438;&#x44f; <a class="externalLink" href="https://search.maven.org/#search%7Cga%7C1%7Cg%3A%22org.beigesoft%22">https://search.maven.org/#search%7Cga%7C1%7Cg%3A%22org.beigesoft%22</a>
  &#x438;&#x43b;&#x438; <a class="externalLink" href="https://repo1.maven.org/maven2/org/beigesoft/beige-accjet/">https://repo1.maven.org/maven2/org/beigesoft/beige-accjet/</a>.
  &#x414;&#x430;&#x43d;&#x43d;&#x44b;&#x439; &#x438;&#x441;&#x442;&#x43e;&#x447;&#x43d;&#x438;&#x43a; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c; &#x441; &#x438;&#x441;&#x445;&#x43e;&#x434;&#x43d;&#x44b;&#x43c; &#x43a;&#x43e;&#x434;&#x43e;&#x43c; &#x448;&#x438;&#x440;&#x43e;&#x43a;&#x43e; &#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x435;&#x43d; &#x438; &#x431;&#x435;&#x437;&#x43e;&#x43f;&#x430;&#x441;&#x435;&#x43d;. &#x421;&#x43a;&#x430;&#x447;&#x438;&#x432;&#x430;&#x43d;&#x438;&#x435; &#x43f;&#x440;&#x43e;&#x438;&#x437;&#x432;&#x43e;&#x434;&#x438;&#x442;&#x441;&#x44f; &#x447;&#x435;&#x440;&#x435;&#x437; &#x448;&#x438;&#x444;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x43d;&#x43e;&#x435; &#x441;&#x43e;&#x435;&#x434;&#x438;&#x43d;&#x435;&#x43d;&#x438;&#x435;. &#x422;&#x435;&#x43c; &#x43d;&#x435; &#x43c;&#x435;&#x43d;&#x435;&#x435; &#x443;&#x447;&#x438;&#x442;&#x44c;&#x441;&#x44f; &#x438; &#x442;&#x440;&#x435;&#x43d;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x442;&#x44c;&#x441;&#x44f; &#x431;&#x435;&#x437;&#x43e;&#x43f;&#x430;&#x441;&#x43d;&#x43e;&#x441;&#x442;&#x438; &#x43d;&#x443;&#x436;&#x43d;&#x43e;, &#x438; &#x43b;&#x443;&#x447;&#x448;&#x435; &#x43f;&#x440;&#x43e;&#x432;&#x435;&#x440;&#x438;&#x442;&#x44c; &#x44d;&#x43b;&#x435;&#x43a;&#x442;&#x440;&#x43e;&#x43d;&#x43d;&#x443;&#x44e; &#x43f;&#x43e;&#x434;&#x43f;&#x438;&#x441;&#x44c; &#x43f;&#x440;&#x43e;&#x433;&#x440;&#x430;&#x43c;&#x43c;&#x43e;&#x439; GnuPg (&#x443;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x438;&#x442;&#x44c; &#x435;&#x435; &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x442;&#x430;&#x43a;&#x436;&#x435; &#x441; &#x43e;&#x444;&#x438;&#x446;&#x438;&#x430;&#x43b;&#x44c;&#x43d;&#x43e;&#x433;&#x43e; &#x441;&#x430;&#x439;&#x442;&#x430; &#x43d;&#x430; &#x430;&#x43d;&#x433;&#x43b;&#x438;&#x439;&#x441;&#x43a;&#x43e;&#x43c; https://gnupg.org/download/).
  &#x420;&#x430;&#x441;&#x43f;&#x430;&#x43a;&#x443;&#x439;&#x442;&#x435; &#x430;&#x440;&#x445;&#x438;&#x432; &#x438; &#x437;&#x430;&#x43f;&#x443;&#x441;&#x442;&#x438;&#x442;&#x435; JAR &#x444;&#x430;&#x439;&#x43b; <b> beige-accjet-jar-with-dependencies.jar</b> &#x434;&#x432;&#x43e;&#x439;&#x43d;&#x44b;&#x43c; &#x43a;&#x43b;&#x438;&#x43a;&#x43e;&#x43c; &#x43c;&#x44b;&#x448;&#x43a;&#x438; &#x438;&#x43b;&#x438; &#x432;&#x44b;&#x437;&#x43e;&#x432;&#x43e;&#x43c; &#x43c;&#x435;&#x43d;&#x44e; - Java.
  &#x412;&#x44b; &#x43c;&#x43e;&#x436;&#x435;&#x442;&#x435; &#x437;&#x430;&#x43f;&#x443;&#x441;&#x442;&#x438;&#x442;&#x44c; JAR &#x447;&#x435;&#x440;&#x435;&#x437; &#x438;&#x43d;&#x442;&#x435;&#x440;&#x444;&#x435;&#x439;&#x441; &#x43a;&#x43e;&#x43c;&#x430;&#x43d;&#x434;&#x43d;&#x43e;&#x439; &#x441;&#x442;&#x440;&#x43e;&#x43a;&#x438; (&quot;command prompt&quot;, &quot;power shell&quot;, &quot;&#x43a;&#x43e;&#x43c;&#x43c;&#x430;&#x43d;&#x434; &#x43f;&#x440;&#x43e;&#x43c;&#x43f;&#x442;&quot;, &quot;&#x43f;&#x43e;&#x432;&#x44d;&#x440; &#x448;&#x435;&#x43b;&#x43b;&quot;) &#x43a;&#x43e;&#x43c;&#x430;&#x43d;&#x434;&#x43e;&#x439;:  <b>java -jar beige-accjet-jar-with-dependencies.jar</b>
  &#x41f;&#x435;&#x440;&#x432;&#x44b;&#x439; &#x437;&#x430;&#x43f;&#x443;&#x441;&#x43a; &#x43d;&#x430; &#x41c;&#x421; &#x412;&#x438;&#x43d;&#x434;&#x43e;&#x443;&#x441; &#x437;&#x430;&#x439;&#x43c;&#x435;&#x442; &#x432;&#x440;&#x435;&#x43c;&#x44f; &#x431;&#x43e;&#x43b;&#x44c;&#x448;&#x435; &#x447;&#x435;&#x43c; &#x43d;&#x430; &#x410;&#x43d;&#x434;&#x440;&#x43e;&#x438;&#x434; &#x441;&#x43c;&#x430;&#x440;&#x442;&#x444;&#x43e;&#x43d;&#x435;, &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x43f;&#x43e;&#x434;&#x43e;&#x436;&#x434;&#x430;&#x442;&#x44c;.  
  &#x412;&#x44b; &#x443;&#x432;&#x438;&#x434;&#x438;&#x442;&#x435; &#x43e;&#x448;&#x438;&#x431;&#x43a;&#x443; &#x437;&#x430;&#x43f;&#x443;&#x441;&#x43a;&#x430;:
     </p>
       
<p align="center"><img src="images/ajsterrru.png" style="max-width: 100%" alt="" /></p>
       
<p>&#x415;&#x441;&#x43b;&#x438; &#x43f;&#x43e;&#x441;&#x43c;&#x43e;&#x442;&#x440;&#x438;&#x442;&#x435; &#x444;&#x430;&#x439;&#x43b; starter0.log &#x432; &#x43a;&#x43e;&#x440;&#x43d;&#x435;&#x432;&#x43e;&#x439; &#x43f;&#x430;&#x43f;&#x43a;&#x435; &#x41f;&#x41e;, &#x442;&#x43e; &#x443;&#x432;&#x438;&#x434;&#x438;&#x442;&#x435;:</p>
  
<div>
<pre style="white-space:pre-wrap">
...org.bouncycastle.operator.OperatorCreationException: unable to create OutputEncryptor: JCE cannot authenticate the provider BC...
  </pre></div>
     
<p>
        &#x41d;&#x443;&#x436;&#x43d;&#x43e; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x438;&#x442;&#x44c; &#x43a;&#x440;&#x438;&#x43f;&#x442;&#x43e;&#x43f;&#x440;&#x43e;&#x432;&#x430;&#x439;&#x434;&#x435;&#x440; &#x441;&#x442;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43a;&#x438;&#x43c; &#x43f;&#x443;&#x442;&#x435;&#x43c;. &#x41d;&#x443;&#x436;&#x43d;&#x43e; &#x441;&#x43a;&#x430;&#x447;&#x430;&#x442;&#x44c; &#x444;&#x430;&#x439;&#x43b;&#x44b; download bcprov-jdk15on-1.67.jar &#x438;&#x437; <a class="externalLink" href="https://repo1.maven.org/maven2/org/bouncycastle/bcprov-jdk15on/1.67/">https://repo1.maven.org/maven2/org/bouncycastle/bcprov-jdk15on/1.67/</a>
    &#x438; bcpkix-jdk15on-1.67.jar &#x438;&#x437; <a class="externalLink" href="https://repo1.maven.org/maven2/org/bouncycastle/bcpkix-jdk15on/1.67/">https://repo1.maven.org/maven2/org/bouncycastle/bcpkix-jdk15on/1.67/</a>
    &#x438; &#x441;&#x43a;&#x43e;&#x43f;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x438;&#x445; &#x430; [java-&#x43f;&#x430;&#x43f;&#x43a;&#x430;]/lib/ext e.g. &quot;C:\Program Files (x86)\Java\jre[version#8]\lib\ext&quot;:
     </p>
     
<p align="center"><img src="images/bslibru.png" style="max-width: 100%" alt="" /></p>
     
<p>
        &#x42d;&#x442;&#x43e;&#x433;&#x43e; &#x434;&#x43e;&#x441;&#x442;&#x430;&#x442;&#x43e;&#x447;&#x43d;&#x43e; &#x432; &#x43f;&#x43e;&#x441;&#x43b;&#x435;&#x434;&#x43d;&#x435;&#x439; &#x432;&#x435;&#x440;&#x441;&#x438;&#x438; &#x414;&#x436;&#x430;&#x432;&#x430;, &#x43d;&#x43e; &#x43e;&#x431;&#x44b;&#x447;&#x43d;&#x43e; &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x432;&#x43d;&#x435;&#x441;&#x442;&#x438; &#x437;&#x430;&#x43f;&#x438;&#x441;&#x44c; &#x43e; &#x43a;&#x440;&#x438;&#x43f;&#x442;&#x43e;&#x43f;&#x440;&#x43e;&#x432;&#x430;&#x439;&#x434;&#x435;&#x440;&#x435; &quot;security.provider.[&#x441;&#x43b;&#x435;&#x434;&#x443;&#x44e;&#x449;&#x438;&#x439; &#x43d;&#x43e;&#x43c;&#x435;&#x440;]=org.bouncycastle.jce.provider.BouncyCastleProvider&quot; &#x432; [JAVA &#x43f;&#x430;&#x43f;&#x43a;&#x430;]/lib/security/java.security:
  </p>
<div>
<pre style="white-space:pre-wrap">
...
security.provider.8=org.jcp.xml.dsig.internal.dom.XMLDSigRI
security.provider.9=sun.security.smartcardio.SunPCSC
security.provider.10=sun.security.mscapi.SunMSCAPI
security.provider.11=org.bouncycastle.jce.provider.BouncyCastleProvider
...
  </pre></div>
  &#x414;&#x43b;&#x44f; &#x44d;&#x442;&#x43e;&#x433;&#x43e; &#x444;&#x430;&#x439;&#x43b; &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x441;&#x43a;&#x43e;&#x43f;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x432; &#x441;&#x432;&#x43e;&#x44e; &#x434;&#x43e;&#x43c;&#x430;&#x448;&#x43d;&#x44e;&#x44e; &#x43f;&#x430;&#x43f;&#x43a;&#x443;, &#x43e;&#x442;&#x440;&#x435;&#x434;&#x430;&#x43a;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x432; &#x431;&#x43b;&#x43e;&#x43a;&#x43d;&#x43e;&#x442;&#x435; &#x438; &#x441;&#x43a;&#x43e;&#x43f;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x43d;&#x430;&#x437;&#x430;&#x434; (&#x437;&#x430;&#x43c;&#x435;&#x43d;&#x438;&#x442;&#x44c;).
     
     
<p>
        &#x41f;&#x43e;&#x441;&#x43b;&#x435;&#x434;&#x43d;&#x44f;&#x44f; &#x432;&#x435;&#x440;&#x441;&#x438;&#x44f; &#x414;&#x436;&#x430;&#x432;&#x44b; &#x43d;&#x435; &#x432;&#x44b;&#x432;&#x43e;&#x434;&#x438;&#x442; &#x441;&#x43e;&#x43e;&#x431;&#x449;&#x435;&#x43d;&#x438;&#x435; &#x43e;&#x431; &#x43e;&#x433;&#x440;&#x430;&#x43d;&#x438;&#x447;&#x435;&#x43d;&#x438;&#x438; &#x434;&#x43b;&#x438;&#x43d;&#x44b; &#x43a;&#x43b;&#x44e;&#x447;&#x435;&#x439; (&#x43e;&#x448;&#x438;&#x431;&#x43a;&#x430; &#x437;&#x430;&#x43f;&#x443;&#x441;&#x43a;&#x430; - &#x444;&#x430;&#x439;&#x43b; starter.log):
  </p>
<div>
<pre style="white-space:pre-wrap">
...org.bouncycastle.operator.OperatorCreationException: unable to create OutputEncryptor: Illegal key size or default parameters...
  </pre></div>
  &#x415;&#x441;&#x43b;&#x438; &#x442;&#x430;&#x43a;&#x430;&#x44f; &#x43e;&#x448;&#x438;&#x431;&#x43a;&#x430; &#x432;&#x43e;&#x437;&#x43d;&#x438;&#x43a;&#x430;&#x435;&#x442;, &#x442;&#x43e; &#x43d;&#x443;&#x436;&#x43d;&#x43e; &#x441;&#x43a;&#x43e;&#x43f;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x442;&#x44c; &#x444;&#x430;&#x439;&#x43b;&#x44b; &#x43f;&#x43e;&#x43b;&#x438;&#x442;&#x438;&#x43a; &#x434;&#x43b;&#x438;&#x43d;&#x44b; &#x43a;&#x43b;&#x44e;&#x447;&#x435;&#x439; &#x438;&#x437; &quot;C:\Program Files (x86)\Java\jre[version#8]\lib\security\policy\unlimited&quot; &#x432; &quot;[JAVA &#x43f;&#x430;&#x43f;&#x43a;&#x430;]/lib/security&quot;.
     
     
<p>
        &#x41f;&#x43e;&#x441;&#x43b;&#x435; &#x443;&#x441;&#x43f;&#x435;&#x448;&#x43d;&#x43e;&#x433;&#x43e; &#x437;&#x430;&#x43f;&#x443;&#x441;&#x43a;&#x430; &#x43c;&#x43e;&#x436;&#x43d;&#x43e; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x438;&#x442;&#x44c; &#x441;&#x435;&#x440;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442; &#x432; &#x431;&#x440;&#x430;&#x443;&#x437;&#x435;&#x440;: &#x43d;&#x430;&#x441;&#x442;&#x440;&#x43e;&#x439;&#x43a;&#x438; - &#x434;&#x43e;&#x43f;&#x43e;&#x43b;&#x43d;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x43e; - &#x441;&#x435;&#x440;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442;&#x44b; - &#x432;&#x43a;&#x43b;&#x430;&#x434;&#x43a;&#x430; &quot;&#x414;&#x43e;&#x432;&#x435;&#x440;&#x435;&#x43d;&#x43d;&#x44b;&#x435; &#x43a;&#x43e;&#x440;&#x43d;&#x435;&#x432;&#x44b;&#x435; &#x446;&#x435;&#x43d;&#x442;&#x440;&#x44b; &#x441;&#x435;&#x440;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x446;&#x438;&#x438;&quot; - &#x438;&#x43c;&#x43f;&#x43e;&#x440;&#x442;. &#x414;&#x43b;&#x44f; &#x432;&#x44b;&#x431;&#x43e;&#x440;&#x430; &#x444;&#x430;&#x439;&#x43b;&#x430; <b>ajetty-ca[&#x41d;&#x43e;&#x43c;&#x435;&#x440; &#x410;&#x434;&#x436;&#x435;&#x442;&#x438;].pem</b> &#x443;&#x431;&#x435;&#x440;&#x438;&#x442;&#x435; &#x444;&#x438;&#x43b;&#x44c;&#x442;&#x440; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43d;&#x438;&#x439;. &#x418;&#x43c;&#x43f;&#x43e;&#x440;&#x442;&#x438;&#x440;&#x43e;&#x432;&#x430;&#x43d;&#x43d;&#x44b;&#x439; &#x444;&#x430;&#x439;&#x43b; &#x432; &#x441;&#x43f;&#x438;&#x441;&#x43a;&#x435;:
     </p>
     
<p align="center"><img src="images/cacertru.png" style="max-width: 100%" alt="" /></p>
     
<p>&#x412; &#x41b;&#x438;&#x43d;&#x443;&#x43a;&#x441; &#x438;&#x43c;&#x435;&#x435;&#x442;&#x441;&#x44f; &#x434;&#x43e;&#x43f;&#x43e;&#x43b;&#x43d;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x430;&#x44f; &#x432;&#x43e;&#x437;&#x43c;&#x43e;&#x436;&#x43d;&#x43e;&#x441;&#x442;&#x44c; &#x443;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x438;&#x442;&#x44c; &#x43f;&#x43e;&#x43b;&#x435;&#x437;&#x43d;&#x43e;&#x435; &#x43e;&#x433;&#x440;&#x430;&#x43d;&#x438;&#x447;&#x435;&#x43d;&#x438;&#x435; - &quot;&#x414;&#x43e;&#x432;&#x435;&#x440;&#x44f;&#x442;&#x44c; &#x442;&#x43e;&#x43b;&#x44c;&#x43a;&#x43e; HTTPS &#x441;&#x435;&#x440;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442;&#x430;&#x43c; &#x432;&#x44b;&#x43f;&#x443;&#x449;&#x435;&#x43d;&#x43d;&#x44b;&#x43c; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x43c; &#x426;&#x421;&quot;,  &#x442;.&#x435;. &#x435;&#x441;&#x43b;&#x438; &#x43f;&#x43e;&#x44f;&#x432;&#x438;&#x442;&#x441;&#x44f; &#x444;&#x430;&#x439;&#x43b; &#x41f;&#x41e; &#x43f;&#x43e;&#x434;&#x43f;&#x438;&#x441;&#x430;&#x43d;&#x43d;&#x44b;&#x439; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x43c; &#x441;&#x435;&#x440;&#x442;&#x438;&#x444;&#x438;&#x43a;&#x430;&#x442;&#x43e;&#x43c; &#x43e;&#x442; &#x434;&#x430;&#x43d;&#x43d;&#x43e;&#x433;&#x43e; &#x426;&#x421;, &#x442;&#x43e; &#x43f;&#x43e;&#x434;&#x43f;&#x438;&#x441;&#x44c; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43d;&#x435;&#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x442;&#x435;&#x43b;&#x44c;&#x43d;&#x430;.</p>
     
<p>
        &#x41f;&#x43e;&#x441;&#x43b;&#x435; &#x437;&#x430;&#x43f;&#x443;&#x441;&#x43a;&#x430; &#x437;&#x430;&#x440;&#x435;&#x433;&#x438;&#x441;&#x442;&#x440;&#x438;&#x440;&#x443;&#x439;&#x442;&#x435; &#x43d;&#x43e;&#x432;&#x43e;&#x433;&#x43e; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44f;:
     </p>
     
<p align="center"><img src="images/adduserru.png" style="max-width: 100%" alt="" /></p>
     
<p>
       &#x421;&#x43a;&#x43e;&#x43f;&#x438;&#x440;&#x443;&#x439;&#x442;&#x435; &#x434;&#x435;&#x43c;&#x43e;&#x43d;&#x441;&#x442;&#x440;&#x430;&#x446;&#x438;&#x43e;&#x43d;&#x43d;&#x443;&#x44e; &#x431;&#x430;&#x437;&#x443; &quot;bobs-pizza-ws6.sqlite&quot; &#x438;&#x437;  https://sourceforge.net/projects/beige-accounting/ &#x432; &#x43f;&#x430;&#x43f;&#x43a;&#x443; &#x43f;&#x440;&#x438;&#x43b;&#x43e;&#x436;&#x435;&#x43d;&#x438;&#x44f; &quot;/webapp&quot;. &#x417;&#x430;&#x442;&#x435;&#x43c; &#x432;&#x43e;&#x439;&#x434;&#x435;&#x442;&#x435; &#x432; &#x43c;&#x435;&#x43d;&#x44e;-&#x431;&#x430;&#x437;&#x44b; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x445; &#x438; &#x43d;&#x430;&#x436;&#x43c;&#x438;&#x442;&#x435; &quot;&#x418;&#x437;&#x43c;&#x435;&#x43d;&#x438;&#x442;&#x44c;&quot; &#x43d;&#x430; &#x44d;&#x442;&#x43e;&#x439; &#x411;&#x414;, &#x43e;&#x43d;&#x430; &#x441;&#x442;&#x430;&#x43d;&#x435;&#x442; &#x442;&#x435;&#x43a;&#x443;&#x449;&#x435;&#x439; &#x411;&#x414;. &#x418;&#x441;&#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x443;&#x439;&#x442;&#x435; &#x43f;&#x43e;&#x43b;&#x44c;&#x437;&#x43e;&#x432;&#x430;&#x442;&#x435;&#x43b;&#x44c;/&#x43f;&#x430;&#x440;&#x43e;&#x43b;&#x44c; &quot;admin/admin&quot; &#x434;&#x43b;&#x44f; &#x440;&#x430;&#x431;&#x43e;&#x442;&#x44b; &#x432; &#x43d;&#x435;&#x439;.
       &#x412;&#x43e;&#x441;&#x441;&#x442;&#x430;&#x43d;&#x43e;&#x432;&#x43b;&#x435;&#x43d;&#x43d;&#x44b;&#x435; &#x434;&#x430;&#x43d;&#x43d;&#x44b;&#x435; &#x43d;&#x430; &#x43a;&#x43e;&#x43c;&#x43f;&#x44c;&#x44e;&#x442;&#x435;&#x440;&#x435;:
     </p>
     
<p align="center"><img src="images/webstoreru.png" style="max-width: 100%" alt="" /></p>

    
    </div></div></div>

  


    </div>
    <div class="clear">
    </div>
    <hr/>
    <div class="footer">
              Copyright &#169;                   2019&#x2013;2021.
           All rights reserved.      
                    
                </div>
  </body>
</html>
